import { Question } from '../../../../types';

// db / Деректердің тұтастығы
export const db2DataIntegrityQuestions = [
  {
    "id": "1e0f5045-db47-4f05-8c9c-9d9191bc3ca9",
    "subjectId": "db",
    "text": "CHECK constraint не істейді?",
    "options": [
      {
        "id": "0565fa14-eea4-4200-b7f4-c43e09c5a6c1",
        "text": "Foreign Key орнатады"
      },
      {
        "id": "0643c519-b685-427e-9e65-0ece90f584b1",
        "text": "Мәнге шектеу қояды (мыс: age > 0)"
      },
      {
        "id": "c3d874e8-3316-48b8-94bb-a60e71e66099",
        "text": "Индекс құрады"
      },
      {
        "id": "cb81acd5-7a74-47dd-bc1d-900893b3f13a",
        "text": "Primary Key құрады"
      },
      {
        "id": "456e4bc4-0be2-445d-b315-335149f98df7",
        "text": "Кестелер арасындағы сілтемелерді қамтамасыз етеді"
      },
      {
        "id": "16228d84-5054-44ee-9c57-9914bbea649b",
        "text": "Деректерді іздеу жылдамдығын арттырады"
      },
      {
        "id": "748e3d70-a304-42a6-956d-03cc06d03249",
        "text": "Жолдардың бірегейлігін тексереді"
      },
      {
        "id": "6bc39e28-05dc-4d67-aee2-e98f7411fd10",
        "text": "Бағанға әдепкі мәнді автоматты түрде тағайындайды"
      }
    ],
    "correctOptionIds": [
      "0643c519-b685-427e-9e65-0ece90f584b1"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "3a23c7aa-cc4a-459f-849d-cc580e073187",
    "subjectId": "db",
    "text": "NOT NULL constraint не істейді?",
    "options": [
      {
        "id": "4fd2d925-6b45-485f-8d46-a3398d6f2c92",
        "text": "Мәнді автоматты толтырады"
      },
      {
        "id": "a18a61c9-cab0-4c2c-ae4c-91a9704599d6",
        "text": "Мәннің NULL болмауын талап етеді"
      },
      {
        "id": "b36194ca-176b-45dc-ba34-3a0243306318",
        "text": "Мәннің бос болуын талап етеді"
      },
      {
        "id": "db1b927d-adb7-47c0-9584-805ab2863a55",
        "text": "Индекс құрады"
      },
      {
        "id": "3b611380-108a-4b53-97b3-11a9e3a7dbb5",
        "text": "Бағанға енгізілетін мәндердің бірегей болуын қамтамасыз етеді"
      },
      {
        "id": "91c250d4-515e-42eb-b695-e92aff2ac928",
        "text": "Кестеге жаңа жазба қосылғанда өрісті нөлге теңейді"
      },
      {
        "id": "6c0c29a6-92bd-4204-8d01-6d2da645ad83",
        "text": "Басқа кестелермен сыртқы кілт арқылы байланыс орнатады"
      },
      {
        "id": "337143dd-3bc2-4835-be33-b480ba5792ff",
        "text": "Мәліметтерді сақтау кезінде оларды автоматты түрде шифрлайды"
      }
    ],
    "correctOptionIds": [
      "a18a61c9-cab0-4c2c-ae4c-91a9704599d6"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "66a10020-9652-4247-9cb8-f7efda2119da",
    "subjectId": "db",
    "text": "Семантикалық тұтастық дегеніміз не?",
    "options": [
      {
        "id": "52357d2a-8b91-4648-aa7b-435b4dbe0aa4",
        "text": "Деректердің бизнес логикаға сәйкестігі"
      },
      {
        "id": "ba6503bb-87ee-4c8f-84c9-c6e99da1adb2",
        "text": "Типтердің дұрыстығы"
      },
      {
        "id": "c2c7fc54-3bf0-4179-a1cb-9a3468be6f70",
        "text": "Байланыстардың дұрыстығы"
      },
      {
        "id": "fbb99cb1-3dfd-406b-ae23-af850b2887ed",
        "text": "Кілттердің дұрыстығы"
      },
      {
        "id": "1d6e6f44-361c-4bc7-a3eb-0be2ea95d28a",
        "text": "Дерекқордағы деректердің көшірмесін жасау процесі"
      },
      {
        "id": "c9ac1564-4491-4499-a25b-77f56a62fcdf",
        "text": "Кестелер арасындағы физикалық байланыстардың орнатылуы"
      },
      {
        "id": "b16fa8d6-838c-44bc-bd1e-e6660bdf8963",
        "text": "Пайдаланушылардың деректерге қол жеткізу құқықтарын шектеу"
      },
      {
        "id": "26b438d0-03ed-4c5b-952c-dbd24f15e1b5",
        "text": "Деректерді сығу арқылы дискілік кеңістікті үнемдеу"
      }
    ],
    "correctOptionIds": [
      "52357d2a-8b91-4648-aa7b-435b4dbe0aa4"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "6760aefc-fc01-4958-889b-9c7024d25d61",
    "subjectId": "db",
    "text": "Сілтемелік тұтастық нені қамтамасыз етеді?",
    "options": [
      {
        "id": "26c89822-36d8-45e4-a008-326db8aaab0f",
        "text": "Шифрлаудың дұрыстығын"
      },
      {
        "id": "84950b03-0b6c-48c7-9776-f8a96ca3548a",
        "text": "Foreign Key байланысының дұрыстығын"
      },
      {
        "id": "88cdb8a5-2c70-4855-b7a2-921d758279c5",
        "text": "Индекстердің дұрыстығын"
      },
      {
        "id": "d6ab763f-303a-45fa-ad95-01847f00f3b1",
        "text": "Типтердің дұрыстығын"
      },
      {
        "id": "fb8586ed-dfc8-493e-88e7-5715bc249ad8",
        "text": "Деректер ұяшықтарындағы мәндердің форматын"
      },
      {
        "id": "e98bd3a1-711d-4e64-b67f-d9ae8c191c19",
        "text": "Пайдаланушының дерекқорға кіру құқығын"
      },
      {
        "id": "919e6d7d-446f-40c0-9c96-19321de0ee1f",
        "text": "Кестедегі жолдардың бірегейлігін"
      },
      {
        "id": "8cf19941-9083-487b-8306-5c081d4b0532",
        "text": "Сақтау кеңістігін оңтайландыруды"
      }
    ],
    "correctOptionIds": [
      "84950b03-0b6c-48c7-9776-f8a96ca3548a"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "a8f70776-63f4-4578-a34a-0bb901aa91a5",
    "subjectId": "db",
    "text": "DEFAULT constraint не істейді?",
    "options": [
      {
        "id": "0d13df25-4481-46f3-843e-d189b2924ac1",
        "text": "Мән берілмесе әдепкі мән қояды"
      },
      {
        "id": "a9403348-b84f-4e4a-ada5-4bd3ae9229c0",
        "text": "Индекс құрады"
      },
      {
        "id": "bc3c699e-4c7f-4856-b61a-110f1eefd008",
        "text": "Мәнді шифрлайды"
      },
      {
        "id": "dcb80e4d-9d1d-4682-a1f7-4600baeef20c",
        "text": "Мәнді жояды"
      },
      {
        "id": "29e38748-9841-46df-b05a-3e3e1195afd3",
        "text": "Бағанға енгізілетін мәндердің бірегейлігін тексереді"
      },
      {
        "id": "b914c180-d4b4-49b9-a547-668a33fcd9fd",
        "text": "Кестедегі жазбаларды автоматты түрде сұрыптайды"
      },
      {
        "id": "22453aaf-8c0d-4f3f-af1f-f58d75d565c6",
        "text": "Бос мәндерді (NULL) енгізуге тыйым салады"
      },
      {
        "id": "d2195bd1-55e4-49ec-9eb1-0e80ded8a5e4",
        "text": "Басқа кестемен байланысты орнатады"
      }
    ],
    "correctOptionIds": [
      "0d13df25-4481-46f3-843e-d189b2924ac1"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "aaaef50f-0746-4a54-8f9e-2fbb47db8bc2",
    "subjectId": "db",
    "text": "Домендік тұтастық нені қамтамасыз етеді?",
    "options": [
      {
        "id": "665d62a2-42a8-4fb4-8e88-8c6b0c53c02a",
        "text": "Байланыстардың дұрыстығын"
      },
      {
        "id": "77492a47-5b90-4094-9308-a322f46052d1",
        "text": "Индекстердің дұрыстығын"
      },
      {
        "id": "9dd0d296-c8f4-4169-a128-a96b3b04f422",
        "text": "Транзакциялардың дұрыстығын"
      },
      {
        "id": "e4a88641-3dfb-4cc2-be07-520607967e75",
        "text": "Типі мен диапазонның дұрыстығын"
      },
      {
        "id": "3c13cd80-6468-468d-927f-b17815b4a20f",
        "text": "Кестелер арасындағы сілтемелердің сақталуын"
      },
      {
        "id": "93fd5108-c12d-4bb1-ae2b-203c538b8441",
        "text": "Деректерді өзгерту операцияларының толықтығын"
      },
      {
        "id": "012b610f-4991-4bea-a2de-fbb8bfd9ddc6",
        "text": "Пайдаланушылардың рұқсат деңгейлерін"
      },
      {
        "id": "e33d1ef5-101e-47e3-b744-0f6e6528dff1",
        "text": "Жүйенің істен шығу кезіндегі деректердің қалпына келуін"
      }
    ],
    "correctOptionIds": [
      "e4a88641-3dfb-4cc2-be07-520607967e75"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "bdc097db-1a7c-404f-88ba-687a1b0797d1",
    "subjectId": "db",
    "text": "UNIQUE constraint не істейді?",
    "options": [
      {
        "id": "929bf90c-aa83-4656-8d80-eb371208f02e",
        "text": "Бағандағы мәндердің бірегейлігін қамтамасыз етеді"
      },
      {
        "id": "dbaba1b5-b2b5-4a1a-b024-78cd19a36878",
        "text": "Primary Key орнатады"
      },
      {
        "id": "e4b1a25b-d548-4db1-8193-b6ee9eb26500",
        "text": "Деректерді шифрлайды"
      },
      {
        "id": "f949c025-7aa1-4d33-9e5e-3eb10b667220",
        "text": "NULL мәнге рұқсат береді"
      },
      {
        "id": "40a871a8-5dcb-432d-a5d9-aa11aba02e8e",
        "text": "Бағандағы барлық мәндерді автоматты түрде бас әріппен жазады"
      },
      {
        "id": "2d48643c-2602-46df-8396-9b3898b0f590",
        "text": "Кестедегі деректердің көшірмесін жасайды"
      },
      {
        "id": "214bbefc-6a89-41bd-aa94-442025c394ab",
        "text": "Бағанға тек сандық мәндерді енгізуге рұқсат береді"
      },
      {
        "id": "92637450-2cc5-48d6-a2a3-23f40fcb6a17",
        "text": "Деректерді кестеге енгізу жылдамдығын арттырады"
      }
    ],
    "correctOptionIds": [
      "929bf90c-aa83-4656-8d80-eb371208f02e"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "00db67a1-4db2-48c8-a9a3-258cad8f50ab",
    "subjectId": "db",
    "text": "Deadlock дегеніміз не?",
    "options": [
      {
        "id": "790750e3-a338-4e02-b048-e34c4c8d8510",
        "text": "Транзакция сәтті аяқталды"
      },
      {
        "id": "a9ca7fa1-1be7-4533-b5f6-9b0a5dd1eef4",
        "text": "Индекс құру"
      },
      {
        "id": "ec926e23-47c1-469a-98b7-a09e7338551d",
        "text": "Деректерді жылдам оқу"
      },
      {
        "id": "f527daea-232e-4379-af4b-65587cd407c7",
        "text": "Екі транзакция бір-бірінің құлпын күтіп тұрып қалу"
      },
      {
        "id": "1d7b7c4a-e969-4dd5-ab22-e3523c7addcc",
        "text": "Транзакцияның орындалу уақытын қысқарту әдісі"
      },
      {
        "id": "748d89ba-562d-46fb-91ec-7fa00ec36f58",
        "text": "Дерекқордағы деректердің көшірмесін жасау процесі"
      },
      {
        "id": "2f92acbb-19af-44dd-80fd-1256643efb48",
        "text": "Бір транзакцияның екіншісіне тәуелді болып, тізбектей орындалуы"
      },
      {
        "id": "5783eacd-aa53-4e68-bbc1-628dcb6592b1",
        "text": "Жүйенің жұмысын тоқтатпай, құлыптарды автоматты түрде босату механизмі"
      }
    ],
    "correctOptionIds": [
      "f527daea-232e-4379-af4b-65587cd407c7"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "0cd0000f-2ce1-46a8-95ff-201dd48b79cc",
    "subjectId": "db",
    "text": "Isolation дегеніміз не?",
    "options": [
      {
        "id": "3e88f42f-d0d8-49d4-a2e6-4e651692d3f7",
        "text": "Транзакциялар бір-біріне әсер етпеуі"
      },
      {
        "id": "5dc2a0b0-d715-4d6d-9a31-0450a645ac9e",
        "text": "Толық орындалу"
      },
      {
        "id": "e4a3a6d6-3ca1-4866-b183-e106204c26b1",
        "text": "Дерекқордың дұрыс күйде қалуы"
      },
      {
        "id": "f80fc12e-22d7-4469-8760-9ed0251aaa85",
        "text": "Нәтиженің сақталуы"
      },
      {
        "id": "e3f34a78-d7ea-4030-a17d-d5d1a9d0f876",
        "text": "Транзакцияның толық орындалуы немесе мүлдем орындалмауы"
      },
      {
        "id": "77c3b5d7-c9c3-4f42-95bd-ab5af3a261df",
        "text": "Жүйе істен шыққан кезде деректердің жоғалмауы"
      },
      {
        "id": "d78f702c-6f4e-46a3-88d1-f2cc7d9cb528",
        "text": "Дерекқордағы барлық шектеулердің сақталуы"
      },
      {
        "id": "4393746c-8ac8-4303-b5ad-4f72addb3bed",
        "text": "Транзакциялардың реттілікпен орындалуы"
      }
    ],
    "correctOptionIds": [
      "3e88f42f-d0d8-49d4-a2e6-4e651692d3f7"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "155dc073-6072-4f3c-93bd-ae11a92c4f2b",
    "subjectId": "db",
    "text": "COMMIT командасы не істейді?",
    "options": [
      {
        "id": "4923b92a-63f1-4c71-8773-f2b1837961a1",
        "text": "Деректерді жояды"
      },
      {
        "id": "6b44bdd2-8a25-476e-9c9f-c45bd74e1652",
        "text": "Транзакциядағы өзгерістерді тұрақты сақтайды"
      },
      {
        "id": "7811d286-ed9e-4795-ab40-f1d1769775ac",
        "text": "Транзакцияны болдырмайды"
      },
      {
        "id": "d7994e29-06ee-424e-9a5f-0f757f3fcfac",
        "text": "Транзакцияны бастайды"
      },
      {
        "id": "a2d14960-0220-473a-96ad-b68e7da7ce8f",
        "text": "Транзакцияны уақытша тоқтатады"
      },
      {
        "id": "45395af1-d084-4d5d-b5d3-358f144ea1fb",
        "text": "Өзгерістерді кестеге жазбай, тек жадыда сақтайды"
      },
      {
        "id": "a0129e57-b6e1-4399-b030-8bc10ef950bf",
        "text": "Алдыңғы транзакцияның барлық әрекеттерін қайтарады"
      },
      {
        "id": "88d2e6d1-7004-419f-b83c-47c7f0fedc81",
        "text": "Дерекқорға жаңа пайдаланушыны тіркейді"
      }
    ],
    "correctOptionIds": [
      "6b44bdd2-8a25-476e-9c9f-c45bd74e1652"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "3859c422-43df-410d-8c05-27d01a5d5f8a",
    "subjectId": "db",
    "text": "Atomicity дегеніміз не?",
    "options": [
      {
        "id": "669db788-e1de-4ae5-847f-407ec5492e5e",
        "text": "Нәтиже сақталады"
      },
      {
        "id": "bea7c630-c693-461c-bd4c-882cd1c37fcc",
        "text": "Транзакция толық орындалады немесе орындалмайды"
      },
      {
        "id": "e5aca8f9-f6d8-45bf-b813-6394f13a887c",
        "text": "Деректердің дұрыстығы"
      },
      {
        "id": "f72a7281-aaf2-4ecc-9402-ea065883fecb",
        "text": "Транзакциялар бір-біріне әсер етпейді"
      },
      {
        "id": "2f11583c-1b33-4956-8f25-0469ccb524b0",
        "text": "Транзакциялардың орындалу реті маңызды емес"
      },
      {
        "id": "830c195f-1e5b-4c3c-bbb5-69bb94f9fbe6",
        "text": "Дерекқорға жазылған өзгерістер бірден көрінеді"
      },
      {
        "id": "84a4150d-0898-4da6-8530-e9ff05fa6572",
        "text": "Жүйе істен шыққан кезде деректер автоматты түрде қалпына келеді"
      },
      {
        "id": "5c93d908-17b9-483f-b013-c3c6a19c3cd8",
        "text": "Бір уақытта бірнеше пайдаланушы деректерге қол жеткізе алады"
      }
    ],
    "correctOptionIds": [
      "bea7c630-c693-461c-bd4c-882cd1c37fcc"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "4282275f-6233-4899-b7ec-3adceb58258c",
    "subjectId": "db",
    "text": "Lost Update дегеніміз не?",
    "options": [
      {
        "id": "0e67354d-f696-4e29-bb20-240915967582",
        "text": "Бір транзакцияның өзгертуі екіншісімен қайта жазылды"
      },
      {
        "id": "805fdf9f-27a2-47e3-8792-18ee3b8c475a",
        "text": "Дерек жойылды"
      },
      {
        "id": "e0e21265-d4cf-4836-99da-b33b406dfa74",
        "text": "Дерек табылмады"
      },
      {
        "id": "e35707aa-68ee-4024-94cf-75af59d50bb5",
        "text": "Жаңа дерек қосылды"
      },
      {
        "id": "0a8ad8f2-521b-40b5-8aed-3c4f7bec006b",
        "text": "Транзакция орындалмай жатып жүйе істен шықты"
      },
      {
        "id": "0c420254-fc9b-4e17-81e2-141bf09dc604",
        "text": "Екі транзакция бір уақытта деректі оқуға тырысты"
      },
      {
        "id": "2a237d36-68b3-42e3-9078-13279a251a29",
        "text": "Дерекқордағы деректер түпнұсқа күйіне қайтарылды"
      },
      {
        "id": "86afd94d-c15c-4e5c-b6a0-e7021f9cb490",
        "text": "Бір транзакция екіншісінің құлыптауын күтіп тұр"
      }
    ],
    "correctOptionIds": [
      "0e67354d-f696-4e29-bb20-240915967582"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "65baaaad-2491-460f-bd44-e9fae9cfc09b",
    "subjectId": "db",
    "text": "SAVEPOINT не істейді?",
    "options": [
      {
        "id": "2b4ee9bb-06d3-4c68-85fc-97b2a2027ce6",
        "text": "Транзакция ішінде бақылау нүктесін құрады"
      },
      {
        "id": "97d2e729-467a-4948-8c26-4d1767742007",
        "text": "Транзакцияны аяқтайды"
      },
      {
        "id": "a1deaa9f-fbbf-43dd-9afc-fe4aaef61e60",
        "text": "Деректерді жояды"
      },
      {
        "id": "c3152340-b5b6-4221-8bfa-e0768abffe29",
        "text": "Кестені құрады"
      },
      {
        "id": "460c8ccc-3df0-448e-9735-5e5d63b9a9a7",
        "text": "Транзакцияны толығымен болдырмайды (rollback)"
      },
      {
        "id": "68543b71-8c65-4208-b43d-6062cdb7252b",
        "text": "Дерекқорға тұрақты түрде сақтауды бекітеді"
      },
      {
        "id": "bbb461e3-4773-46a3-ac3d-daae9584c310",
        "text": "Транзакциялар арасындағы байланысты үзеді"
      },
      {
        "id": "7661637a-b38c-446d-97d4-c28027fa116b",
        "text": "Кесте құрылымын уақытша өзгертеді"
      }
    ],
    "correctOptionIds": [
      "2b4ee9bb-06d3-4c68-85fc-97b2a2027ce6"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "66bb97d7-9bf3-4092-b627-50b1f5bcd401",
    "subjectId": "db",
    "text": "Phantom Read дегеніміз не?",
    "options": [
      {
        "id": "0155a423-0db3-4573-8b6b-d3ee1142b0c3",
        "text": "Деректі жою"
      },
      {
        "id": "3bdb1b51-a258-4efe-be33-3f207ebe80cb",
        "text": "Деректі табу мүмкін емес"
      },
      {
        "id": "9dc7ddd8-0a7a-43f2-bea7-8221d9c444ca",
        "text": "Екі оқу арасында басқа транзакция жаңа жазба қосқан"
      },
      {
        "id": "d725301a-7df9-4b8a-aae7-eba3f93a2ad5",
        "text": "Бір дерек екі рет өзгерген"
      },
      {
        "id": "b61aac18-5981-468c-b864-8bd50d9ec85f",
        "text": "Бір транзакция ішінде деректі екі рет оқығанда мәні өзгеріп кетуі"
      },
      {
        "id": "5e62f034-ffee-4052-882c-35664559d05f",
        "text": "Жойылған деректердің уақытша қалпына келуі"
      },
      {
        "id": "36e98395-ef01-452f-9d8a-2f6c8e7dbb53",
        "text": "Екі транзакцияның бір уақытта бір жазбаны жаңартуға тырысуы"
      },
      {
        "id": "7a5638d9-2311-41ea-b54d-7a0c3f2149f3",
        "text": "Оқу операциясы кезінде дерекқор индексінің бұзылуы"
      }
    ],
    "correctOptionIds": [
      "9dc7ddd8-0a7a-43f2-bea7-8221d9c444ca"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "682c44da-7fee-4985-a7b2-15784912e4e7",
    "subjectId": "db",
    "text": "READ COMMITTED изоляция деңгейі нені қамтамасыз етеді?",
    "options": [
      {
        "id": "34ad90d4-367f-4494-a127-75b63ccf5332",
        "text": "Phantom Read болмайды"
      },
      {
        "id": "b045a2cb-3ae9-42d0-929f-351127ba33de",
        "text": "Ешқандай қорғаныс жоқ"
      },
      {
        "id": "c2e03df2-2d41-4330-99a3-5fd9975c3601",
        "text": "Толық оқшаулау"
      },
      {
        "id": "c7c807cc-564b-4f61-8280-455ee87030a8",
        "text": "Dirty Read болмайды"
      },
      {
        "id": "966b76d3-b74e-419b-975e-0b052f6ed5fd",
        "text": "Non-Repeatable Read болмайды"
      },
      {
        "id": "5fa3579c-7d70-4c4e-8dc6-4ef8ee8f92ba",
        "text": "Барлық транзакциялар кезекпен орындалады"
      },
      {
        "id": "48a43bca-3b8e-4bd4-a164-2e6c2e14b9f5",
        "text": "Phantom Read толығымен жойылады"
      },
      {
        "id": "fe73bb5d-6ba8-424d-b638-123a36fd6c8a",
        "text": "Өзгерілмеген деректерді қайта оқуға тыйым салынады"
      }
    ],
    "correctOptionIds": [
      "c7c807cc-564b-4f61-8280-455ee87030a8"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "9106749f-57bf-4d57-a730-1fae7d6cdd78",
    "subjectId": "db",
    "text": "SERIALIZABLE изоляция деңгейі нені қамтамасыз етеді?",
    "options": [
      {
        "id": "0de668cd-bbd1-4d9c-b02d-bc0741dc1cc6",
        "text": "Ең төменгі қорғаныс"
      },
      {
        "id": "347d2e0b-8adc-43d2-81d8-ab16c8f78733",
        "text": "Оқшаулау жоқ"
      },
      {
        "id": "45e615ac-1de1-42dc-99d2-761d64f47c0d",
        "text": "Dirty Read ғана алдын алады"
      },
      {
        "id": "a9ce2835-3442-467e-aeb4-ef04626860b6",
        "text": "Ең жоғары изоляция, барлық проблемаларды болдырмайды"
      },
      {
        "id": "3fedf85c-b293-4c59-974c-bf832e0e0627",
        "text": "Тек Phantom Read мәселесін шешеді, бірақ басқаларына әсер етпейді"
      },
      {
        "id": "9f1c7385-4371-4e08-8d22-5b7f2c25c448",
        "text": "Орындалу жылдамдығын арттыру үшін құлыптауды толық алып тастайды"
      },
      {
        "id": "33bf2823-ada2-428e-a69b-e998932a31b6",
        "text": "READ COMMITTED деңгейімен бірдей қорғаныс деңгейін ұсынады"
      },
      {
        "id": "9d8c9021-6a30-4567-b540-c0157e30a9ee",
        "text": "Тек өз транзакциясының деректерін көруге рұқсат береді, басқаларын блоктамайды"
      }
    ],
    "correctOptionIds": [
      "a9ce2835-3442-467e-aeb4-ef04626860b6"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "9b80b50f-bbde-418b-87c8-870e931a7b60",
    "subjectId": "db",
    "text": "Consistency (ACID) дегеніміз не?",
    "options": [
      {
        "id": "05eb6c07-ed68-4be5-bebc-fbced64495d0",
        "text": "Дерекқор транзакциядан кейін дұрыс күйде қалады"
      },
      {
        "id": "56cdcf3a-5732-4b32-a69a-bc4f20a5d98c",
        "text": "Тұрақтылық"
      },
      {
        "id": "7bdb4017-a9fc-4a24-8b38-d37ad8edc48f",
        "text": "Оқшаулау"
      },
      {
        "id": "f125c624-2903-4657-83de-b87f2be10e48",
        "text": "Толық орындалу"
      },
      {
        "id": "89ee6a45-cced-433d-9239-13d3fa1f7b17",
        "text": "Транзакцияның орындалу уақытын қысқарту"
      },
      {
        "id": "1dd5b240-f2ed-4750-8a03-00cd9967d471",
        "text": "Деректердің физикалық сақтаушыда мәңгілікке жазылуы"
      },
      {
        "id": "8d6855e9-ddd1-4c48-b4cf-a72ed2b6ec92",
        "text": "Бір мезетте бірнеше пайдаланушының деректерге қол жеткізуі"
      },
      {
        "id": "c10336de-ecd6-42a2-8ff0-50e5a6643f42",
        "text": "Жүйенің істен шығу кезінде деректерді автоматты түрде қалпына келтіру"
      }
    ],
    "correctOptionIds": [
      "05eb6c07-ed68-4be5-bebc-fbced64495d0"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "d0ccbbc9-2cfd-4003-9def-19f5f0d85d04",
    "subjectId": "db",
    "text": "Dirty Read дегеніміз не?",
    "options": [
      {
        "id": "2c36b295-98bb-4ce4-a7d7-0addfb4f63e2",
        "text": "Қате оқу"
      },
      {
        "id": "6270a1c6-2508-4bdd-8ea2-c95111f3f138",
        "text": "Commit болған деректі оқу"
      },
      {
        "id": "9163fb04-7459-4468-b588-fc7ef4bce650",
        "text": "Басқа транзакцияның commit болмаған деректін оқу"
      },
      {
        "id": "f870b663-f074-4990-aa06-acc9f5e86ab9",
        "text": "Тез оқу"
      },
      {
        "id": "92398e23-c036-46cb-81a7-9bba6ecde664",
        "text": "Басқа транзакцияның сәтсіз аяқталған (rollback) деректерін оқу"
      },
      {
        "id": "83426c7b-7424-4194-846f-d1f9f8a295fb",
        "text": "Дерекқордың физикалық бұзылуынан пайда болған қате деректі оқу"
      },
      {
        "id": "1c5c1635-2b70-40ab-9472-5979d95424d5",
        "text": "Транзакциялар параллель орындалғандағы уақытша кідірісті оқу"
      },
      {
        "id": "f8c60e99-ac09-477c-945f-ad593d7076f1",
        "text": "Жүйелік кэштен жаңартылмаған ескі деректерді оқу"
      }
    ],
    "correctOptionIds": [
      "9163fb04-7459-4468-b588-fc7ef4bce650"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "d84e0a4e-8e5e-4991-9654-47bcbd07a94e",
    "subjectId": "db",
    "text": "ACID атауындағы A, C және I қасиеттеріне сәйкес келетін атауларды таңдаңыз. (3 жауап)",
    "options": [
      {
        "id": "34e84716-85fe-4d8e-92e7-385b15dc3a62",
        "text": "Accuracy"
      },
      {
        "id": "8f3d3cb9-ba86-487d-87bc-d9f1a4e5ea7e",
        "text": "Isolation"
      },
      {
        "id": "a8a2e681-47e9-49cb-a0de-bdeec8280532",
        "text": "Durability"
      },
      {
        "id": "c6d246e2-26d2-443d-b9ce-ecca681f4aae",
        "text": "Consistency"
      },
      {
        "id": "e6499af1-6183-4473-90f7-5a5db32eaf2f",
        "text": "Atomicity"
      },
      {
        "id": "cd6ba79e-0be5-4803-8b3a-8a17413bac86",
        "text": "Тұрақтылық"
      },
      {
        "id": "7f7d71e5-6588-4e54-ab0f-e3af4ef054eb",
        "text": "Дәлдік"
      },
      {
        "id": "75db7092-d622-49d6-8d54-7162724fce02",
        "text": "Интеграция"
      }
    ],
    "correctOptionIds": [
      "e6499af1-6183-4473-90f7-5a5db32eaf2f",
      "c6d246e2-26d2-443d-b9ce-ecca681f4aae",
      "8f3d3cb9-ba86-487d-87bc-d9f1a4e5ea7e"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "f12b6e83-6853-4434-96db-c7cae0a55d2f",
    "subjectId": "db",
    "text": "Durability дегеніміз не?",
    "options": [
      {
        "id": "9eacc1f5-e5cc-472f-8f3c-87a7641ff082",
        "text": "Нәтиженің сақталып қалуы"
      },
      {
        "id": "b68d2111-0f09-497b-9497-c99c4c6ec354",
        "text": "Толық орындалу"
      },
      {
        "id": "cb29561d-b519-4e2f-9b0a-a36902e375d3",
        "text": "Транзакциялардың оқшаулануы"
      },
      {
        "id": "db19d7fd-9816-4e95-ad5f-e198efe28e0c",
        "text": "Дерекқордың дұрыстығы"
      },
      {
        "id": "1cc606ad-98cd-4693-bd46-c74aa6a96260",
        "text": "Транзакциялардың бір-біріне әсер етпеуі"
      },
      {
        "id": "29f4e939-46a4-46c6-af11-12c25a7974ff",
        "text": "Деректердің қателіксіздігін қамтамасыз ету"
      },
      {
        "id": "2de2559e-0e31-40a4-b323-7b6683caf304",
        "text": "Жүйенің үзіліссіз жұмыс істеу уақыты"
      },
      {
        "id": "489af631-7ca6-4889-9312-8546ab28fbed",
        "text": "Операцияның толық немесе мүлдем орындалмауы"
      }
    ],
    "correctOptionIds": [
      "9eacc1f5-e5cc-472f-8f3c-87a7641ff082"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "fa102836-10c6-4e76-bc7c-95669b4f62cd",
    "subjectId": "db",
    "text": "ROLLBACK командасы не істейді?",
    "options": [
      {
        "id": "2749d2bd-96f2-4062-bf6f-9039e7728c75",
        "text": "Транзакцияны болдырмайды, өзгерістерді қайтарады"
      },
      {
        "id": "410670cb-7712-42b2-986e-02e3ef8d7114",
        "text": "Деректер қосады"
      },
      {
        "id": "6391c3a5-d5f4-46f5-bed6-6c3169dd5c8c",
        "text": "Өзгерістерді сақтайды"
      },
      {
        "id": "ddb05c66-a055-4508-90f4-6de209282b23",
        "text": "Транзакцияны бастайды"
      },
      {
        "id": "73d12cd1-4f0e-4d92-b03c-5d3448ddd17e",
        "text": "Транзакцияны уақытша тоқтатады"
      },
      {
        "id": "883a0511-9523-4f12-8979-8a6f06329193",
        "text": "Өзгерістерді дерекқорға біржола бекітеді"
      },
      {
        "id": "b502e189-1268-4454-9a34-0b3b4e4968a4",
        "text": "Кесте құрылымын өзгертуге мүмкіндік береді"
      },
      {
        "id": "8ea06b56-8976-4e5d-8a79-1812d51d76e2",
        "text": "Жойылған деректерді қалпына келтіреді"
      }
    ],
    "correctOptionIds": [
      "2749d2bd-96f2-4062-bf6f-9039e7728c75"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "bee0043c-2a14-4ac1-8f96-7d0e5637190d",
    "subjectId": "db",
    "text": "Сілтемелік тұтастық (Referential Integrity) ережесі нені талап етеді?",
    "options": [
      {
        "id": "6833421f-d474-48f3-9fe7-4ba4a92db62e",
        "text": "Сыртқы кілттің мәні сілтеме жасалатын кестенің бастапқы кілтінде болуын немесе NULL болуын"
      },
      {
        "id": "7c7f8f00-e52e-4e6a-ae15-614320efb80d",
        "text": "Бастапқы кілттің ешқашан бос (NULL) болмауын"
      },
      {
        "id": "4c5d8cd0-3817-47b2-b2c1-51e930ac5053",
        "text": "Деректердің типі тек бүтін сандар болуын"
      },
      {
        "id": "1d767d93-a6f8-4848-8fde-e0cfb9ab12e0",
        "text": "Сұраныстардың жылдам орындалуын"
      },
      {
        "id": "fd6275c0-693b-4a94-8531-1ae1b358e0fe",
        "text": "Сыртқы кілттің мәні кез келген басқа кестедегі кез келген бағанға сәйкес келуін"
      },
      {
        "id": "23d068c9-d181-4ea4-8126-d8838665e58b",
        "text": "Бастапқы кілт пен сыртқы кілттің деректер типтері әртүрлі болуын"
      },
      {
        "id": "3cfc3f04-0384-4bc3-be5f-8c54107bca20",
        "text": "Сілтеме жасалатын кестедегі барлық жазбалардың міндетті түрде өшірілуін"
      },
      {
        "id": "76b9ff5c-a605-42f2-b53f-87363170553d",
        "text": "Сыртқы кілттегі қайталанатын мәндерге тыйым салынуын"
      }
    ],
    "correctOptionIds": [
      "6833421f-d474-48f3-9fe7-4ba4a92db62e"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "3a90879d-407d-4608-b775-703c1ae06e92",
    "subjectId": "db",
    "text": "Мән мәтін деңгейіндегі тұтастықты (Domain/Value Integrity) қамтамасыз ету үшін SQL-де қандай шектеу (constraint) қолданылады?",
    "options": [
      {
        "id": "ad2f5cca-15b8-4477-9a00-595cd77eff2b",
        "text": "CHECK"
      },
      {
        "id": "a38348b1-26a2-4b67-bb10-2dff028bcc54",
        "text": "PRIMARY KEY"
      },
      {
        "id": "8d886d6c-7ff5-4e81-9c19-68d825a124f8",
        "text": "FOREIGN KEY"
      },
      {
        "id": "85a3e4aa-c54a-495f-b2ed-fa3f895b3b21",
        "text": "INDEX"
      },
      {
        "id": "b8af7dce-ab8a-4efe-8a1a-c8939fead40f",
        "text": "NOT NULL"
      },
      {
        "id": "da5cc42e-ba6d-4e79-9e92-dbeb380c8792",
        "text": "UNIQUE"
      },
      {
        "id": "5e40c2d5-91f8-44e5-8b20-10c0e3da5f63",
        "text": "DEFAULT"
      },
      {
        "id": "18d0a598-c75c-4d96-a516-dd050d30a532",
        "text": "CASCADE"
      }
    ],
    "correctOptionIds": [
      "ad2f5cca-15b8-4477-9a00-595cd77eff2b"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "554106d0-125d-47c8-b1db-78b39c629473",
    "subjectId": "db",
    "text": "Деректер қорындағы \"Мәндер тұтастығы\" (Entity Integrity) ережесі нені білдіреді?",
    "options": [
      {
        "id": "a3fbdc2a-3c7e-41dc-8ac5-1223f867fa80",
        "text": "Бастапқы кілттің бірегей болуын және оның ешбір бөлігі NULL мәнін қабылдамауын"
      },
      {
        "id": "d1d1e780-b457-4a2c-91f5-48c68105c89f",
        "text": "Сыртқы кілттің дұрыс сілтеме жасауын"
      },
      {
        "id": "e8093fab-874e-449f-a53f-0561f7a357f7",
        "text": "Деректерді жою кезінде транзакцияның тоқтауын"
      },
      {
        "id": "0bf0afd8-ad47-49ec-9667-a5f14707b972",
        "text": "Кестелердегі жолдардың шектеусіз санын"
      },
      {
        "id": "598a9003-a921-46fd-986c-432748b544c9",
        "text": "Кестедегі барлық бағандардың міндетті түрде толтырылуын қамтамасыз ету"
      },
      {
        "id": "c6167bac-6fda-42d8-9212-010189d3d53a",
        "text": "Сыртқы кілттердің тек бастапқы кестеге ғана сілтеме жасау шартын"
      },
      {
        "id": "9f80bddc-3440-4c4f-9ae6-8740f684b837",
        "text": "Деректерді өзгерткен кезде автоматты түрде сақтық көшірме жасауды"
      },
      {
        "id": "9d1a6ce8-a125-4b98-a5d3-b457f0a0096f",
        "text": "Бір кестедегі деректердің екінші кестемен толық сәйкес келу талабын"
      }
    ],
    "correctOptionIds": [
      "a3fbdc2a-3c7e-41dc-8ac5-1223f867fa80"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "65ed2d86-e106-46c3-883f-49d516148a35",
    "subjectId": "db",
    "text": "Сыртқы кілтті жою немесе өзгерту кезіндегі ON DELETE CASCADE әрекеті нені білдіреді?",
    "options": [
      {
        "id": "77e9c4cd-4a6a-4c5b-a7ee-4fe5a4f4a25b",
        "text": "Басты кестедегі жол жойылғанда, оған сілтеме жасаған бағынышты кестедегі жолдар автоматты түрде жойылады"
      },
      {
        "id": "d98d30e6-1752-4885-a906-d4762c4a1506",
        "text": "Басты кестедегі жолды жоюға тыйым салынады"
      },
      {
        "id": "2135f404-374a-4ff6-aea8-98d11f42986f",
        "text": "Бағынышты кестедегі мәндер NULL-ге теңестіріледі"
      },
      {
        "id": "a758e513-9112-49fb-8c29-cd5f4082d956",
        "text": "Тек басты кестедегі мән ғана жойылады"
      },
      {
        "id": "16dd7434-a98f-4a4d-9d24-bc7488147683",
        "text": "Басты кестедегі жол жойылғанда, бағынышты кестедегі сәйкес жолдар жаңартылып, деректер көшіріледі"
      },
      {
        "id": "c261bafd-6aad-4e74-9b4a-b072716167d0",
        "text": "Бағынышты кестедегі жолдар жойылмайды, бірақ оларға уақытша тыйым салынады"
      },
      {
        "id": "45c3eb70-c49d-4841-b0c1-2fa6f867160c",
        "text": "Басты кестедегі өзгеріс тек сол жолға әсер етеді, бағынышты кестелерге ешқандай әрекет жасалмайды"
      },
      {
        "id": "5d876cbc-cb40-43be-8bae-2eb189df29cb",
        "text": "Бағынышты кестедегі барлық жолдар толығымен тазаланып, кесте бос қалады"
      }
    ],
    "correctOptionIds": [
      "77e9c4cd-4a6a-4c5b-a7ee-4fe5a4f4a25b"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "716ef304-cd8d-40a5-bf42-92e068704944",
    "subjectId": "db",
    "text": "ON UPDATE SET NULL шектеуі орындалғанда не болады?",
    "options": [
      {
        "id": "511d0738-a83c-4fed-a041-73528767d682",
        "text": "Басты кестедегі бастапқы кілт өзгергенде, бағынышты кестедегі сәйкес сыртқы кілт мәндері NULL-ге ауыстырылады"
      },
      {
        "id": "97df220d-227b-4fe6-b580-8553b9ebaea7",
        "text": "Басты кестедегі өзгертуге тыйым салынады"
      },
      {
        "id": "afbd77e6-79de-4bae-bb1b-fdcf8bbafd26",
        "text": "Сәйкес жолдар автоматты түрде жойылады"
      },
      {
        "id": "2e980296-c7eb-4efe-81fa-1990fcc9fa9e",
        "text": "Бағынышты кестеде жаңа жол пайда болады"
      },
      {
        "id": "b287fd4f-2a3e-40be-a124-eed39630cff9",
        "text": "Басты кестедегі бастапқы кілт өзгергенде, бағынышты кестедегі сәйкес жолдар автоматты түрде жаңартылып, жаңа мәнмен толықтырылады"
      },
      {
        "id": "fd52db64-35fa-4f4c-bc00-7b6496db4146",
        "text": "Бағынышты кестедегі сыртқы кілт мәні өзгермей, ескі бастапқы кілтке сілтеме жасап қала береді"
      },
      {
        "id": "ee34cc9e-1d6b-4a11-a61a-322212fde0e5",
        "text": "Басты кестедегі өзгерту әрекеті толығынан болдырмайды және қате хабарламасы қайтарылады"
      },
      {
        "id": "f2c925ce-c714-4d1b-bace-3156e0cb8ed9",
        "text": "Бағынышты кестедегі барлық жолдар дерекқордан біржола өшіріледі"
      }
    ],
    "correctOptionIds": [
      "511d0738-a83c-4fed-a041-73528767d682"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "179dcc67-6c7f-4000-a158-2953e00ff8b0",
    "subjectId": "db",
    "text": "Деректер қорындағы тұтастық шектеулері (Declarative Constraints) мен Триггерлердің (Triggers) негізгі айырмашылығы қандай?",
    "options": [
      {
        "id": "5d67447b-a3c3-4262-a418-7526159f51a5",
        "text": "Шектеулер декларативті түрде кесте құрылымында анықталады және жылдам жұмыс істейді, ал триггерлер процедуралық код болып табылады"
      },
      {
        "id": "d8571172-ab71-4621-8f57-13e9a5f21caa",
        "text": "Триггерлер тек NULL мәндерді тексереді"
      },
      {
        "id": "3eb50f56-5d8c-46c7-9d5a-69f6093d2c3c",
        "text": "Шектеулерді өшіру мүмкін емес"
      },
      {
        "id": "7d512fd6-f91d-4abe-a05d-fd71858ae3fb",
        "text": "Айырмашылығы жоқ"
      },
      {
        "id": "a752bd7b-2af4-44af-9de0-3971251e6494",
        "text": "Триггерлер дерекқордың физикалық сақтау құрылымын өзгертеді, ал шектеулер тек логикалық деңгейде жұмыс істейді"
      },
      {
        "id": "e6497785-ff3d-4142-a286-7299fa8c27bb",
        "text": "Шектеулер тек INSERT операциясы кезінде орындалады, ал триггерлер UPDATE және DELETE кезінде ғана іске қосылады"
      },
      {
        "id": "e389f4c8-be5c-45e0-ad44-0feee2178cc8",
        "text": "Триггерлерді қолдану дерекқор өнімділігін әрқашан арттырады, ал шектеулер жүйені баяулатады"
      },
      {
        "id": "66f4b89b-1ac4-4212-8883-c897bd40e4f9",
        "text": "Шектеулер тек бір ғана кесте ішіндегі деректерді тексерсе, триггерлер басқа дерекқорлармен байланыс орната алады"
      }
    ],
    "correctOptionIds": [
      "5d67447b-a3c3-4262-a418-7526159f51a5"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "09cc322f-d7e6-4d01-a4c9-043ab9751ee1",
    "subjectId": "db",
    "text": "Деректердің транзитивті тұтастығын немесе күрделі бизнес ережелерді бақылау үшін қандай нысан жиі қолданылады?",
    "options": [
      {
        "id": "8719b59b-fd94-43c3-b407-824ca0e15d26",
        "text": "Триггер (Trigger)"
      },
      {
        "id": "e2128f6c-da7d-4268-a585-c375857d9640",
        "text": "Кластерленген индекс"
      },
      {
        "id": "3228f063-e4a0-4ffb-a27c-e6c104f4ad1c",
        "text": "Көрініс (View)"
      },
      {
        "id": "bfd5efaf-c262-46b6-8190-7c95aec2732e",
        "text": "Сақталған процедура"
      },
      {
        "id": "a27ad213-ca50-4e26-9bff-ace4d35b5a52",
        "text": "Бастапқы кілт (Primary Key)"
      },
      {
        "id": "22d4b92e-946e-4f82-9e17-d618e58bca6a",
        "text": "Сыртқы кілт (Foreign Key)"
      },
      {
        "id": "8332b29f-df31-40de-a5c1-524d3455687c",
        "text": "Домендік шектеу (Domain Constraint)"
      },
      {
        "id": "39fb5b61-1c1b-4a51-9cf8-33f80bb29d4f",
        "text": "Индекстелген көрініс (Indexed View)"
      }
    ],
    "correctOptionIds": [
      "8719b59b-fd94-43c3-b407-824ca0e15d26"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "262523f4-a665-4b88-94d1-3ae9638eac18",
    "subjectId": "db",
    "text": "Сыртқы кілтті орнатқанда NO ACTION опциясы қандай әрекетті білдіреді?",
    "options": [
      {
        "id": "4c658f49-180d-469e-9c2b-005f0a73dce0",
        "text": "Басты кестедегі жолды жоюға немесе өзгертуге әрекет жасалғанда, егер бағынышты кестеде оған сілтеме болса, қате шығарып, әрекетті болдырмайды"
      },
      {
        "id": "81a8919c-40fd-4fa8-acb0-2cca3a633b81",
        "text": "Бағынышты кестедегі жолдарды автоматты түрде жояды"
      },
      {
        "id": "04d26060-86a7-4227-843a-6372c53ff96b",
        "text": "Сыртқы кілт мәнін бос қалдырады"
      },
      {
        "id": "5e48b692-3e85-45ce-8517-ededefc690a1",
        "text": "Ешқандай тексеру жүргізбейді"
      },
      {
        "id": "af54cdd5-8da6-449c-b10a-a50d9aefbbb3",
        "text": "Бағынышты кестедегі сәйкес жолдарды автоматты түрде жаңартып, басты кестедегі өзгерістерге бейімдейді"
      },
      {
        "id": "b80cd73e-16be-4635-aa4e-9a907bc0c115",
        "text": "Әрекетті уақытша тоқтатып, дерекқор әкімшісінің қосымша растауын күтеді"
      },
      {
        "id": "6a6289ac-c11d-4cb3-9b06-905824e8eeb6",
        "text": "Басты кестедегі жолды жоюға рұқсат береді, бірақ бағынышты кестеге ескерту хабарламасын жібереді"
      },
      {
        "id": "aad8901a-d55e-4202-8d03-a0ee129dfa14",
        "text": "Сыртқы кілт шектеуін уақытша алып тастап, операцияны орындайды да, кейін қайта орнатады"
      }
    ],
    "correctOptionIds": [
      "4c658f49-180d-469e-9c2b-005f0a73dce0"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "4a653638-9cc3-4cb2-a572-2b0cfca9ae40",
    "subjectId": "db",
    "text": "SQL-де кестеге мән қосқанда CHECK шектеуі қандай шартпен орындалады?",
    "options": [
      {
        "id": "2fbc2c67-9412-4e4b-82bb-cbe4ad4c00a5",
        "text": "Шарттың нәтижесі TRUE немесе NULL болғанда (тек FALSE болса ғана қате шығарады)"
      },
      {
        "id": "364c570f-ed7e-420a-b380-00092e4c5be5",
        "text": "Шарт тек TRUE болуы тиіс, NULL болса қате шығады"
      },
      {
        "id": "67cf356b-c607-49f9-9cdf-cbf5a405315c",
        "text": "Тек сандық мәндер үшін ғана орындалады"
      },
      {
        "id": "300e6b8b-b366-4445-b5cc-fd662173eb8a",
        "text": "Шарт әрқашан FALSE болуы керек"
      },
      {
        "id": "1f12903f-026b-41af-88eb-50619fbe8e95",
        "text": "Шарттың нәтижесі міндетті түрде FALSE болуы керек, әйтпесе қате шығады"
      },
      {
        "id": "8bc9a5c3-5317-4a61-b0d6-8b3486f11e64",
        "text": "CHECK шектеуі тек кестеге алғашқы жазба қосылған кезде бір рет тексеріледі"
      },
      {
        "id": "8c3e021d-5ea4-4d1d-8c89-c5d39a215ba6",
        "text": "Егер шарттың нәтижесі NULL болса, жүйе автоматты түрде қате хабарламасын береді"
      },
      {
        "id": "5cdb68f7-d891-43f4-a536-0c1e70941c8b",
        "text": "Бұл шектеу тек PRIMARY KEY бағандарына қатысты жұмыс істейді"
      }
    ],
    "correctOptionIds": [
      "2fbc2c67-9412-4e4b-82bb-cbe4ad4c00a5"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "4f08c3eb-626a-4d1c-8ac0-7d97a81102ea",
    "subjectId": "db",
    "text": "Дерекқордағы \"Жүйелік тұтастық\" (System Integrity) қай компоненттің жауапкершілігінде болады?",
    "options": [
      {
        "id": "b830680c-36c7-472b-a414-7a0edfeca14a",
        "text": "ДҚБЖ (DBMS) ядросының өзінде"
      },
      {
        "id": "f56fe865-2ea6-4418-9b3a-46ae1ee1063c",
        "text": "Пайдаланушы интерфейсінде"
      },
      {
        "id": "d2b310f4-6e28-4ef2-a72e-5258d54dd15e",
        "text": "Клиенттік бағдарламаның кодында"
      },
      {
        "id": "533ee0d5-aaf0-4a46-8f9b-484da63f9edd",
        "text": "Операциялық жүйенің файлдық құрылымында"
      },
      {
        "id": "7f548bf4-ab44-4c32-8cb9-ec8ac258b0a7",
        "text": "Желілік қауіпсіздік брандмауэрінің конфигурациясында"
      },
      {
        "id": "c2b018d9-67a9-4b0f-8fa4-d2a90c6f45c6",
        "text": "Дерекқор әкімшісінің қолмен жазатын скрипттерінде"
      },
      {
        "id": "ad0c0f71-98db-436e-813e-daa4074b7130",
        "text": "Аппараттық жадтың (RAM) басқару драйверінде"
      },
      {
        "id": "3937e2c6-378e-4ba8-bf57-ac35b35e1007",
        "text": "Сақтық көшірме жасау (Backup) құралдарының алгоритмінде"
      }
    ],
    "correctOptionIds": [
      "b830680c-36c7-472b-a414-7a0edfeca14a"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "7684da59-c156-49e9-a29e-ac272ab4e0f6",
    "subjectId": "db",
    "text": "Дерекқордағы \"User-defined Integrity\" (Пайдаланушы анықтаған тұтастық) деген не?",
    "options": [
      {
        "id": "d76338e8-a048-4f23-9e47-a52185e5c2bd",
        "text": "Кәсіпорынның немесе қолданбаның нақты бизнес-ережелерін сипаттайтын шектеулер жиынтығы"
      },
      {
        "id": "cc4b9716-d844-4a67-9127-a4e26b67072e",
        "text": "Тек пайдаланушының құпия сөзін тексеру ережесі"
      },
      {
        "id": "f978e1ca-2289-416b-9aed-7025f59725d6",
        "text": "Бастапқы кілттің бірегейлік ережесі"
      },
      {
        "id": "e4dee1eb-bd62-4b84-b2de-24422984de6d",
        "text": "Дерекқордың резервтік көшірмесін жасау ережесі"
      },
      {
        "id": "c8d629a8-88e0-44cc-a0d6-4975d766a978",
        "text": "Дерекқорды физикалық зақымданудан қорғайтын аппараттық шектеулер"
      },
      {
        "id": "a6bb60ff-75a6-4676-ae01-5829836795d4",
        "text": "Кестелер арасындағы сыртқы кілттердің сәйкестігін автоматты түрде тексеретін жүйелік ереже"
      },
      {
        "id": "57c8265e-2988-46b2-a37c-b4a4d3b4085f",
        "text": "Деректерді сақтау кезінде оларды сығу және кеңістікті үнемдеу алгоритмі"
      },
      {
        "id": "5b548146-ee5f-4a03-8f4f-fb89ae671a1f",
        "text": "Пайдаланушының дерекқорға кіру құқығын басқаратын рөлдер мен рұқсаттар тізімі"
      }
    ],
    "correctOptionIds": [
      "d76338e8-a048-4f23-9e47-a52185e5c2bd"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "9a42f77e-e236-48fd-b3b7-f75a9f156f61",
    "subjectId": "db",
    "text": "Изоляция деңгейлерінің ішіндегі ең төменгі деңгей қайсысы?",
    "options": [
      {
        "id": "12d916ab-dbef-4bb6-a497-5f6d99577939",
        "text": "Read Uncommitted"
      },
      {
        "id": "d028be14-0a66-4ff9-901d-83053daab3bf",
        "text": "Read Committed"
      },
      {
        "id": "afa95a13-8ccd-4d2c-b84d-02c706ccf4bd",
        "text": "Repeatable Read"
      },
      {
        "id": "4c545ee2-e197-4ae0-9882-e4561d550b27",
        "text": "Serializable"
      },
      {
        "id": "8bb7af86-c9c8-438f-a665-3f5c71a66196",
        "text": "Write Committed"
      },
      {
        "id": "1a03fe87-da42-40b2-9ad3-243709de5b11",
        "text": "Full Isolation"
      },
      {
        "id": "1171e338-b1e2-43be-8b62-1860a491dc46",
        "text": "Dirty Read Allowed"
      },
      {
        "id": "0481fcee-cced-47b2-8241-0a58561cbe71",
        "text": "Snapshot Level"
      }
    ],
    "correctOptionIds": [
      "12d916ab-dbef-4bb6-a497-5f6d99577939"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "4fd1a8c6-39dd-411a-a1d0-8c27d6d5104a",
    "subjectId": "db",
    "text": "Read Uncommitted деңгейінде қандай аномалия орын алуы мүмкін?",
    "options": [
      {
        "id": "5f90997a-8c3f-4ec1-bdf2-fbee4f5f5050",
        "text": "Dirty Read, Non-repeatable Read және Phantom Read"
      },
      {
        "id": "f523ba7d-2012-45bd-9169-db76e23efcca",
        "text": "Тек қана Phantom Read"
      },
      {
        "id": "2e70637c-888c-456a-8354-705092035609",
        "text": "Ешқандай аномалия болмайды"
      },
      {
        "id": "b394591f-a7f4-4023-97ed-b524d54d625f",
        "text": "Тек қана Lost Update"
      },
      {
        "id": "3834b030-4194-4be5-b256-4898573f8cac",
        "text": "Тек қана Non-repeatable Read және Phantom Read"
      },
      {
        "id": "7b364da3-ffaf-4ea4-be05-873a4ffde180",
        "text": "Dirty Read және Lost Update аномалиялары"
      },
      {
        "id": "7b4e6220-7fba-4bf5-8351-ca8e62b04e37",
        "text": "Тек қана Dirty Read аномалиясы"
      },
      {
        "id": "98d01406-2465-4bec-bff9-357fb3e48202",
        "text": "Serializable деңгейіндегі барлық аномалиялар"
      }
    ],
    "correctOptionIds": [
      "5f90997a-8c3f-4ec1-bdf2-fbee4f5f5050"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "2baf354b-30e2-4338-9897-e2248e44e606",
    "subjectId": "db",
    "text": "Read Committed изоляция деңгейі қандай аномалияны болдырмайды, бірақ қайсысына жол береді?",
    "options": [
      {
        "id": "88b9aa0a-579d-4da2-8e9e-f6c2e4fcfe71",
        "text": "Dirty Read-ті болдырмайды, бірақ Non-repeatable Read пен Phantom Read-ке жол береді"
      },
      {
        "id": "5d7947c7-fecc-4ed3-b4a2-914987c50247",
        "text": "Phantom Read-ті болдырмайды, бірақ Dirty Read-ке жол береді"
      },
      {
        "id": "49c7c200-5c4d-461e-b9ce-75c327c4c4a3",
        "text": "Барлық аномалияларды толық жояды"
      },
      {
        "id": "b3caa993-1d3e-43c6-ace6-5e58d207a526",
        "text": "Lost Update-ке ғана жол береді"
      },
      {
        "id": "bc3ee641-97aa-44cb-b904-878cfb3a8cd2",
        "text": "Non-repeatable Read-ті болдырмайды, бірақ Dirty Read пен Phantom Read-ке жол береді"
      },
      {
        "id": "f34faa63-c900-4a76-9879-2fcff3daed83",
        "text": "Phantom Read-ті болдырмайды, бірақ Non-repeatable Read-ке ғана жол береді"
      },
      {
        "id": "d3896ae9-e80e-4c2e-b0c3-50b3e076a52c",
        "text": "Dirty Read пен Non-repeatable Read-ті болдырмайды, бірақ Phantom Read-ке жол береді"
      },
      {
        "id": "9cabab2e-b006-461d-a691-1a618b4151c3",
        "text": "Барлық оқу аномалияларын (Dirty, Non-repeatable, Phantom) толықтай болдырмайды"
      }
    ],
    "correctOptionIds": [
      "88b9aa0a-579d-4da2-8e9e-f6c2e4fcfe71"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "48e6ead2-f0c8-4498-b91a-8f47123a76a4",
    "subjectId": "db",
    "text": "Repeatable Read изоляция деңгейі қандай аномалияны болдырмайды, бірақ қайсысына әлі де жол беруі мүмкін?",
    "options": [
      {
        "id": "72f3ecd2-299c-4f82-8c3d-2e16cb4bc6a9",
        "text": "Non-repeatable Read-ті болдырмайды, бірақ Phantom Read орын алуы мүмкін"
      },
      {
        "id": "40579fa2-5776-4806-912c-90bae2dc93fb",
        "text": "Dirty Read-ті болдырмайды, бірақ Lost Update орын алуы мүмкін"
      },
      {
        "id": "0a2ae6f2-fe47-4dfe-96ed-7b26b7712598",
        "text": "Phantom Read-ті болдырмайды, бірақ Dirty Read орын алуы мүмкін"
      },
      {
        "id": "681eb56d-cf04-457b-875e-df7a7347f9e3",
        "text": "Ешқандай аномалияға жол бермейді"
      },
      {
        "id": "05c49619-bfef-4de9-8a75-29cca90b9030",
        "text": "Dirty Read-ті болдырмайды, бірақ Non-repeatable Read орын алуы мүмкін"
      },
      {
        "id": "3d92b514-e4ca-463e-89f0-7fefa756e30d",
        "text": "Phantom Read-ті болдырмайды, бірақ Non-repeatable Read орын алуы мүмкін"
      },
      {
        "id": "af01c0bf-cc0f-47ec-9c92-58a9d4a51a7c",
        "text": "Lost Update-ті болдырмайды, бірақ Phantom Read орын алуы мүмкін"
      },
      {
        "id": "beab5315-9293-44dc-bc28-60ffa18393b4",
        "text": "Барлық аномалияларды болдырмайды, тек Serializability деңгейінде ғана шектеулер болады"
      }
    ],
    "correctOptionIds": [
      "72f3ecd2-299c-4f82-8c3d-2e16cb4bc6a9"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "67ff95e9-4c8b-4543-b193-74e16d604375",
    "subjectId": "db",
    "text": "Дерекқордағы \"Non-repeatable Read\" (Қайталанбайтын оқу) аномалиясы деген не?",
    "options": [
      {
        "id": "6fef8020-7fa6-4fe0-8fa6-cf057aeb0572",
        "text": "Бір транзакция ішінде бір деректі екі рет оқығанда, екінші рет басқа транзакция өзгерткен (UPDATE) жаңа мәнді оқу"
      },
      {
        "id": "3343ada6-e8c7-42c1-b229-53f56f6e1246",
        "text": "Деректердің мүлдем оқылмауы"
      },
      {
        "id": "14a28005-ba6b-4e5f-89dc-b50c3354bf04",
        "text": "Жойылып кеткен деректерді оқу әрекеті"
      },
      {
        "id": "b33859f2-ad3c-4929-a8c2-a050ac5a08cb",
        "text": "Ішкі сұраныстың қате орындалуы"
      },
      {
        "id": "0b681149-72f3-41e5-a75c-17f702f62fdf",
        "text": "Бір транзакция ішінде бір шарт бойынша оқылған деректер жиынына басқа транзакция жаңа жазбалар қосқанда, екінші рет оқығанда сол жаңа жазбалардың пайда болуы"
      },
      {
        "id": "69a96a59-0de3-4104-b567-def6a26a49d2",
        "text": "Екі түрлі транзакцияның бір уақытта бір деректі өзгертуге әрекеттеніп, жүйенің біреуін таңдап, екіншісін тоқтатуы"
      },
      {
        "id": "7f90e7bc-7968-4fe4-99cb-d21bfb6dbc41",
        "text": "Транзакция аяқталмай тұрып жүйе істен шыққан жағдайда, орындалмаған өзгерістердің дерекқордан автоматты түрде жойылуы"
      },
      {
        "id": "f370cd98-f934-47c1-a9a9-6eed3d8bfe94",
        "text": "Бір транзакция барысында деректерді оқу кезінде құлыптау (lock) механизмнің дұрыс жұмыс істемеуінен бағдарламаның қате беруі"
      }
    ],
    "correctOptionIds": [
      "6fef8020-7fa6-4fe0-8fa6-cf057aeb0572"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "33cf5057-7f7c-4603-a4a8-345d3a069e0e",
    "subjectId": "db",
    "text": "ACID қасиетіндегі \"Durability\" (Тұрақтылық) немен қамтамасыз етіледі?",
    "options": [
      {
        "id": "625a7aa5-4092-41b7-9ad3-c86ac650db4d",
        "text": "Транзакциялар журналымен (Transaction Log) және деректерді дискіге тұрақты жазумен"
      },
      {
        "id": "1d7ee4dd-9e02-4825-a31b-677ec5e4e00e",
        "text": "SQL сұраныстарын жылдам сұрыптаумен"
      },
      {
        "id": "841c2480-f9bd-4c1c-8854-ae27dd4579e1",
        "text": "Жедел жадтың (RAM) көлемін үлкейтумен"
      },
      {
        "id": "4bc2d2ab-fa9d-43bd-896d-dace6ef09231",
        "text": "Индекстерді дұрыс таңдаумен"
      },
      {
        "id": "852ab8c4-674f-4e61-9e90-f35b436439ca",
        "text": "Транзакцияларды параллель орындау арқылы"
      },
      {
        "id": "a226f13e-a7c8-40ef-86b6-c537e8f791c8",
        "text": "Деректерді кэштеу механизмдерімен"
      },
      {
        "id": "470bfd30-edc7-406d-8242-083c7b735c46",
        "text": "Қолданушы құқықтарын шектеу арқылы"
      },
      {
        "id": "4d12005a-2cc8-44d5-afd2-564720e3fd9d",
        "text": "Атомарлық операцияларды қамтамасыз етумен"
      }
    ],
    "correctOptionIds": [
      "625a7aa5-4092-41b7-9ad3-c86ac650db4d"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "3813baa1-d557-49f0-bdb8-92fc4b3eaf62",
    "subjectId": "db",
    "text": "SQL-дегі транзакцияны қолмен басқаруды бастау үшін қай команда қолданылады?",
    "options": [
      {
        "id": "bbc3d394-91d2-4c49-8806-7544c3b38c1c",
        "text": "BEGIN TRANSACTION немесе START TRANSACTION"
      },
      {
        "id": "33ccd87e-d443-4ae0-a52d-eb8347f0fde4",
        "text": "COMMIT TRANSACTION"
      },
      {
        "id": "5ef5823c-63cf-41b7-92b6-6df78ec01d75",
        "text": "ROLLBACK TRANSACTION"
      },
      {
        "id": "1581f1b4-0351-4812-b5d1-9680c883a0fa",
        "text": "SET TRANSACTION"
      },
      {
        "id": "35959e86-6e78-4419-83a8-0baa32201ee3",
        "text": "OPEN TRANSACTION"
      },
      {
        "id": "2bb617bf-f698-46af-90a6-d928ba80dc9b",
        "text": "INIT TRANSACTION"
      },
      {
        "id": "38435252-ea98-41d2-a42b-7f9c13fa0c23",
        "text": "LAUNCH TRANSACTION"
      },
      {
        "id": "c56601af-bf9c-4fa9-8a46-427889176af7",
        "text": "CREATE TRANSACTION"
      }
    ],
    "correctOptionIds": [
      "bbc3d394-91d2-4c49-8806-7544c3b38c1c"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "b6f58180-0a8a-4e84-8a3c-3b828b51b1a8",
    "subjectId": "db",
    "text": "Дерекқордағы \"Shared Lock\" (S-lock / Бірлескен құлып) не үшін қолданылады?",
    "options": [
      {
        "id": "a7323748-e7ce-4c55-be37-95a898a852d6",
        "text": "Деректерді тек оқу (Read) операциялары үшін және басқа сессиялардың да оқуына рұқсат беру үшін"
      },
      {
        "id": "b66222d8-3fe6-41a5-b6b3-fd308f602c11",
        "text": "Деректерді өзгерту және жою үшін"
      },
      {
        "id": "c0651e1d-da7d-4dd1-a957-833b4e30bccb",
        "text": "Кестені толық өшіру үшін"
      },
      {
        "id": "739c2c9d-bb90-4849-a165-553e2048047e",
        "text": "Бастапқы кілтті өзгерту үшін"
      },
      {
        "id": "9f572b3b-33b3-4a47-9ff8-7a597667bd71",
        "text": "Деректерді оқуға тыйым салып, тек бір сессияның өзгертуіне рұқсат беру үшін"
      },
      {
        "id": "568dbcf3-8315-4152-9298-ec7a33f2becb",
        "text": "Транзакция аяқталғанша басқа барлық сессиялардың деректерге қол жеткізуін толық блоктау үшін"
      },
      {
        "id": "f00b0e5d-7f5f-4fd1-8b38-2a97a0679821",
        "text": "Деректерді оқу және сол уақытта басқа транзакциялардың жазу операциясын жүргізуіне мүмкіндік беру үшін"
      },
      {
        "id": "5476b911-d007-4bbc-8853-0346fda1048d",
        "text": "Кесте құрылымын (schema) өзгерту кезінде деректердің тұтастығын сақтау үшін"
      }
    ],
    "correctOptionIds": [
      "a7323748-e7ce-4c55-be37-95a898a852d6"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "2070ce00-1fba-4ef2-b64e-0895f0980804",
    "subjectId": "db",
    "text": "Дерекқордағы \"Exclusive Lock\" (X-lock / Ерекше құлып) не істейді?",
    "options": [
      {
        "id": "6f0c2fe2-bb0b-4dd5-96fb-be355c96f30c",
        "text": "Деректі өзгерту немесе жою (Write) кезінде қойылады, басқа ешбір сессияға оқуға да, жазуға да рұқсат бермейді"
      },
      {
        "id": "384bf8cc-733d-4f40-960b-7683ebbd6fd5",
        "text": "Тек оқу амалдарына рұқсат береді"
      },
      {
        "id": "f8d678ef-af50-48bc-a2ec-d6fe911541bc",
        "text": "Басқа транзакциялардың жұмысын жылдамдатады"
      },
      {
        "id": "13fa1d2b-639a-472f-8b69-e034e935f537",
        "text": "Тек уақытша кестелерге қойылады"
      },
      {
        "id": "7c8c4791-dbdc-4781-905a-f729bb9923dd",
        "text": "Деректі оқуға рұқсат береді, бірақ өзгертуге тыйым салады"
      },
      {
        "id": "29dd526d-5776-4fd7-8881-24d5b7173abb",
        "text": "Тек сол транзакция ішіндегі деректерді қорғайды, басқа сессияларға кедергі жасамайды"
      },
      {
        "id": "e921b394-ceef-44f2-9cd0-dbe8a072b078",
        "text": "Деректерді индекстеу процесінде автоматты түрде қойылады және оқуды шектемейді"
      },
      {
        "id": "f7495117-e0f1-4837-88db-c5b30a493491",
        "text": "Басқа транзакцияларға тек оқуға рұқсат беріп, жазу амалдарын ғана бұғаттайды"
      }
    ],
    "correctOptionIds": [
      "6f0c2fe2-bb0b-4dd5-96fb-be355c96f30c"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "26cdb0f0-e17b-4ecb-8ad4-71cfe1fa31ae",
    "subjectId": "db",
    "text": "Дерекқордағы \"Lock Granularity\" (Құлыптың бөлшектенуі) деген не?",
    "options": [
      {
        "id": "22e1a7a0-47be-4a2f-8791-080bbd12382c",
        "text": "Құлыпталатын объектінің өлшемі (мысалы, жеке жол, бет, экстент немесе бүкіл кесте)"
      },
      {
        "id": "d4427d58-0e90-4979-8c1b-350f62639d77",
        "text": "Құлыпты ашатын кілттің ұзындығы"
      },
      {
        "id": "05cf9cd3-ab74-4dce-8a67-6534fb03e29b",
        "text": "Транзакцияның орындалу уақыты"
      },
      {
        "id": "3d0b1410-b7be-4bb1-ae9e-8d04a601ac3c",
        "text": "Құлыптардың жалпы саны"
      },
      {
        "id": "4f2cd5ac-c6d0-4e57-96f3-22c2511a4574",
        "text": "Құлыптың сақталу ұзақтығы мен мерзімі"
      },
      {
        "id": "1a339b5a-9db6-47aa-a704-e0bd7c4dc6ed",
        "text": "Транзакциялардың орындалу реттілігін анықтайтын алгоритм"
      },
      {
        "id": "1c861cbf-6fc4-49b4-b844-853747723f5b",
        "text": "Деректерді шифрлау үшін қолданылатын кілт өлшемі"
      },
      {
        "id": "0dd2515c-f650-47b2-8560-299a8ac0b4a7",
        "text": "Құлып қақтығыстарын шешудегі басымдық деңгейі"
      }
    ],
    "correctOptionIds": [
      "22e1a7a0-47be-4a2f-8791-080bbd12382c"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "aab9c1c4-858b-4e25-84ea-e2d1a9cb91c2",
    "subjectId": "db",
    "text": "Deadlock (Өзара бұғатталу) жағдайын шешу үшін ДҚБЖ не істейді?",
    "options": [
      {
        "id": "4986b58f-330e-45c0-b3ee-ebe256a880a9",
        "text": "Транзакциялардың бірін (Deadlock victim) таңдап, оны автоматты түрде ROLLBACK жасайды"
      },
      {
        "id": "d80710e0-09b4-413f-a912-5bf7bc748bd3",
        "text": "Серверді қайта іске қосады"
      },
      {
        "id": "4986d8f8-d0c8-48ff-b03e-afd165af89ae",
        "text": "Екі транзакцияның да өзгерістерін бір мезгілде COMMIT жасайды"
      },
      {
        "id": "551fe383-7941-4429-a3f2-dd787343fb2b",
        "text": "Пайдаланушыға шешім қабылдауды ұсынады"
      },
      {
        "id": "86697817-479d-459b-a2a6-653deac91ac9",
        "text": "Екі транзакцияны да уақытша тоқтатып, пайдаланушының қолмен араласуын күтеді"
      },
      {
        "id": "096233a7-5f80-4908-a1a9-cbc0dffdff4f",
        "text": "Барлық бұғатталған ресурстарды бір мезгілде босатып, транзакцияларды жалғастырады"
      },
      {
        "id": "7505ccc7-5819-4fc8-9eeb-0cedd75c4a25",
        "text": "Deadlock анықталған сәтте екі транзакцияны да бірдей COMMIT жасап, деректерді сақтайды"
      },
      {
        "id": "409dd5fb-8503-485b-8434-fe4838a25852",
        "text": "Транзакциялардың орындалу ретін өзгертіп, екеуін де кезекпен орындауды жалғастырады"
      }
    ],
    "correctOptionIds": [
      "4986b58f-330e-45c0-b3ee-ebe256a880a9"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "30e1c393-d0bb-4fca-986a-8ab404d2fda4",
    "subjectId": "db",
    "text": "Транзакциялар журналының (Transaction Log) басты рөлі қандай?",
    "options": [
      {
        "id": "546c37df-ed25-44ed-b6a9-af628507435b",
        "text": "Жүйе апатты түрде тоқтағаннан кейін (system crash) дерекқорды қалпына келтіру (Redo/Undo) үшін"
      },
      {
        "id": "c8a31aa7-a278-4db2-994b-b9afaaee9b31",
        "text": "SQL сұраныстарын оңтайлы сақтау үшін"
      },
      {
        "id": "78a00571-32ee-4d71-953a-01ed7e2aba9e",
        "text": "Пайдаланушылардың құпия сөздерін сақтау үшін"
      },
      {
        "id": "d078195d-055d-4565-92e0-53e356846f21",
        "text": "Деректерді сұрыптауды жеделдету үшін"
      },
      {
        "id": "3a28bb1b-f411-465a-af79-26a9fb879058",
        "text": "Дерекқордағы кестелер арасындағы сыртқы кілттерді (Foreign Keys) тексеру үшін"
      },
      {
        "id": "e495ec07-5dc5-443a-bede-e59eecd7b285",
        "text": "Жүйенің жұмыс істеу жылдамдығын арттыру мақсатында деректерді кэштеу үшін"
      },
      {
        "id": "55a400aa-be35-4243-9c76-54e09cb01458",
        "text": "Пайдаланушыларға дерекқорға қол жеткізу құқықтарын басқару үшін"
      },
      {
        "id": "6dd554a5-8840-401d-91bd-86e8b8f6d35d",
        "text": "Деректерді дискідегі физикалық орналасу ретімен сақтау үшін"
      }
    ],
    "correctOptionIds": [
      "546c37df-ed25-44ed-b6a9-af628507435b"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "c6c72522-1f21-468e-9fde-37e18773e141",
    "subjectId": "db",
    "text": "\"Two-Phase Commit\" (2PC / Екі фазалы фиксация) хаттамасы қай жерде қолданылады?",
    "options": [
      {
        "id": "726d6d60-201f-48d3-af1b-e7cac9732413",
        "text": "Таратылған дерекқорлардағы (distributed databases) транзакциялардың бірыңғай орындалуын қамтамасыз ету үшін"
      },
      {
        "id": "d271dca3-8d15-4aa0-9adc-566cf18f9c56",
        "text": "Жеке бір кестеге индекс құру үшін"
      },
      {
        "id": "ce2fae63-830e-4a6a-91c0-b16bf994abfb",
        "text": "Деректерді қалыпқа келтіруде"
      },
      {
        "id": "916ab890-096d-47a1-ad7e-e5c3e203f9c3",
        "text": "SQL сервердің жадын тазарту үшін"
      },
      {
        "id": "6ad841f2-4fb5-4b28-a507-732812a54cc0",
        "text": "Бір дерекқор ішіндегі көптеген пайдаланушылардың бір уақытта кіруін реттеу үшін"
      },
      {
        "id": "a389ab48-4a1b-4fea-a671-8d36dbe7d02e",
        "text": "Транзакцияларды орындау жылдамдығын арттыру мақсатында кэшті басқару үшін"
      },
      {
        "id": "6c473cfd-4597-4df4-b2b6-2abbe0faf25c",
        "text": "Дерекқор серверлері арасындағы желілік кідірістерді азайту үшін"
      },
      {
        "id": "3a87c466-8477-48ab-bddf-2fb5b5e4f2d2",
        "text": "Қателіктер болған жағдайда деректерді автоматты түрде резервтік көшірмеден қалпына келтіру үшін"
      }
    ],
    "correctOptionIds": [
      "726d6d60-201f-48d3-af1b-e7cac9732413"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "e26e3e61-2dc2-4318-bbcf-0378dee356c9",
    "subjectId": "db",
    "text": "2PC хаттамасының екі фазасы қалай аталады?",
    "options": [
      {
        "id": "0eb45ac0-c4ea-42d9-9a93-4d1e583467c8",
        "text": "Дайындық фазасы (Prepare phase) және Фиксация фазасы (Commit phase)"
      },
      {
        "id": "4f94d137-5c3f-4c00-9ae9-46d77ea503ff",
        "text": "Бастау фазасы және Аяқтау фазасы"
      },
      {
        "id": "d2cab808-ff01-4c5c-ba19-c36302c09e88",
        "text": "Оқу фазасы және Жазу фазасы"
      },
      {
        "id": "7a9ab9bf-1711-441b-a102-f0d74d064949",
        "text": "Бұғаттау фазасы және Бұғатты ашу фазасы"
      },
      {
        "id": "43c3926d-26c9-4e64-8502-8e753f1c032d",
        "text": "Бастау фазасы және Аяқтау фазасы"
      },
      {
        "id": "02a8b917-d8e8-4848-97c3-1bfcf542aaab",
        "text": "Тексеру фазасы және Орындау фазасы"
      },
      {
        "id": "0f53722d-c74f-465f-83de-f9bcfd491849",
        "text": "Құлыптау фазасы және Босату фазасы"
      },
      {
        "id": "f51db688-6733-4f67-b817-29449615af2b",
        "text": "Синхрондау фазасы және Репликация фазасы"
      }
    ],
    "correctOptionIds": [
      "0eb45ac0-c4ea-42d9-9a93-4d1e583467c8"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "f10a84f1-6f83-41d0-bcca-705be04a47a6",
    "subjectId": "db",
    "text": "Екі фазалы құлыптау хаттамасының (2PL - Two-Phase Locking) мақсаты не?",
    "options": [
      {
        "id": "7257101f-e4a4-4fc0-a835-7df6ebc33ec0",
        "text": "Транзакциялардың сериалдылығын (Serializability) және оқшаулануын қамтамасыз ету"
      },
      {
        "id": "6167f042-bfd9-4691-b85a-3d6e3b6c39e1",
        "text": "Транзакциялардың жылдам орындалуын қамтамасыз ету"
      },
      {
        "id": "52a3861d-a50a-451d-8d44-72fdd7ffe7a0",
        "text": "Дискідегі файлдарды оңтайландыру"
      },
      {
        "id": "d993e04f-5111-45b7-83be-07be5a8063d9",
        "text": "Резервтік көшіруді жеңілдету"
      },
      {
        "id": "8fd92f1d-1a8a-45ff-ab44-19605237dcb4",
        "text": "Транзакциялардың орындалу уақытын қысқарту арқылы жүйе өнімділігін арттыру"
      },
      {
        "id": "4c7c1b3d-b839-413e-b2e0-cd420c74d943",
        "text": "Дерекқордағы деректердің физикалық сақтау көлемін азайту"
      },
      {
        "id": "2c8b3820-3ace-440d-8e61-a5d64a5c32cd",
        "text": "Қолданушыларға деректерге рұқсат етілмеген қатынауды болдырмау"
      },
      {
        "id": "20f33626-bb4e-48cb-b55f-283858cda7b8",
        "text": "Транзакциялардың сәтсіз аяқталған жағдайда автоматты түрде қалпына келуін қамтамасыз ету"
      }
    ],
    "correctOptionIds": [
      "7257101f-e4a4-4fc0-a835-7df6ebc33ec0"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "c86e6b98-1cbe-43f7-b755-1c5a8598458c",
    "subjectId": "db",
    "text": "2PL (Two-Phase Locking) хаттамасының екі фазасы қандай?",
    "options": [
      {
        "id": "d7a4427b-db04-4fe1-a98e-10b5ac643eee",
        "text": "Өсу фазасы (Growing phase — құлыптарды алу) және Қысқару фазасы (Shrinking phase — құлыптарды босату)"
      },
      {
        "id": "08fa1200-4121-4025-8f48-b1c77548b926",
        "text": "Оқу фазасы және Жазу фазасы"
      },
      {
        "id": "cdec3d46-fd70-4692-aee7-b47c9f22b3c6",
        "text": "Бастау фазасы және Commit фазасы"
      },
      {
        "id": "66bf0958-788b-4fcb-801b-8c4465b81457",
        "text": "Қате фазасы және Сәтті фазасы"
      },
      {
        "id": "6765ccbe-531f-4c15-a0f1-615c03248cb8",
        "text": "Белсендіру фазасы (Activation) және Тоқтату фазасы (Deactivation)"
      },
      {
        "id": "f313ae41-f027-44c2-be9c-5cd19d184498",
        "text": "Тексеру фазасы (Validation) және Орындау фазасы (Execution)"
      },
      {
        "id": "a661855f-fa1f-433b-8817-1b1ea096bdb4",
        "text": "Құлыптау фазасы (Locking) және Ашу фазасы (Unlocking)"
      },
      {
        "id": "d8c302cf-2722-4011-859c-6bcc32a3c7eb",
        "text": "Дайындық фазасы (Preparation) және Бекіту фазасы (Confirmation)"
      }
    ],
    "correctOptionIds": [
      "d7a4427b-db04-4fe1-a98e-10b5ac643eee"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "cbb1cfdb-6880-4343-b05d-96413de92b2e",
    "subjectId": "db",
    "text": "\"Cascading Rollback\" (Каскадты кері қайтару) деген не?",
    "options": [
      {
        "id": "cfd44db1-3568-46d8-a21e-e90b7f15509f",
        "text": "Бір транзакцияның тоқтатылуы (rollback) оның commit болмаған деректерін оқыған басқа транзакциялардың да кері қайтарылуына әкелуі"
      },
      {
        "id": "363c559f-a4e4-4e3b-bf57-3454eb17eab1",
        "text": "Кестедегі бағынышты жолдардың автоматты жойылуы"
      },
      {
        "id": "6efb8fc6-44f4-426b-b8c8-ebf3f6ffedff",
        "text": "Сервердегі барлық кестелердің өшірілуі"
      },
      {
        "id": "470c816a-0ae3-40e2-8ddb-3ab948236c6b",
        "text": "Жүйенің толықтай бұзылуы"
      },
      {
        "id": "2ae21daf-9bcb-448d-bcc2-d801203a0ea4",
        "text": "Бір кестеге енгізілген деректердің автоматты түрде басқа байланысқан кестелерге көшірілу процесі"
      },
      {
        "id": "93dc4df6-051a-4525-95e0-4a4fe3d65e0f",
        "text": "Транзакция орындалмаған жағдайда жүйенің алдыңғы сақталған нүктеге (checkpoint) толық қайта жүктелуі"
      },
      {
        "id": "28a0ebc3-9c07-4fe2-925a-2d5472393373",
        "text": "Қате орындалған SQL сұраныстың сервер логтарынан автоматты түрде өшірілу механизмі"
      },
      {
        "id": "e646235d-a6cf-4f14-aadf-e05e89af79cc",
        "text": "Бағынышты кестелердегі сыртқы кілттердің (foreign key) бос мәнге ауысуы арқылы тұтастықты сақтау"
      }
    ],
    "correctOptionIds": [
      "cfd44db1-3568-46d8-a21e-e90b7f15509f"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "f2a46ffa-ca19-4e2b-83c8-37dd698f2d8b",
    "subjectId": "db",
    "text": "Дерекқорда каскадты кері қайтаруды болдырмау үшін қандай хаттама қолданылады?",
    "options": [
      {
        "id": "f903cfaf-6160-4828-bdef-c8583e3a64d4",
        "text": "Қатаң екі фазалы құлыптау хаттамасы (Strict 2PL)"
      },
      {
        "id": "c75cd8fe-0a2e-4075-83c5-7618bc6706c8",
        "text": "Жай 2PL хаттамасы"
      },
      {
        "id": "d57a9313-457a-48a8-bfa1-077bd847fca8",
        "text": "2PC хаттамасы"
      },
      {
        "id": "93d82a2e-a9c9-4159-a37c-540c12fe029c",
        "text": "WAL принципі"
      },
      {
        "id": "a2ea81c5-dc1d-4663-aaa5-21460164713e",
        "text": "Оңтайландырылған уақыт белгілеу хаттамасы"
      },
      {
        "id": "6a49a60d-2d9d-4463-8ebe-24b88fecb325",
        "text": "Көп нұсқалы басқару хаттамасы (MVCC)"
      },
      {
        "id": "1deed8a8-9393-49b1-b445-2417ac5520f7",
        "text": "Ажыратылған деңгейлі құлыптау хаттамасы"
      },
      {
        "id": "b97da1a4-c5c2-4323-beb1-cf7fc3cff4d4",
        "text": "Транзакциялық оқшаулау хаттамасы"
      }
    ],
    "correctOptionIds": [
      "f903cfaf-6160-4828-bdef-c8583e3a64d4"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "d18bc997-d24d-4ce0-bdae-198d322f4a25",
    "subjectId": "db",
    "text": "\"Intent Lock\" (Мысалы, Intent Shared, Intent Exclusive) құлыптары не үшін қажет?",
    "options": [
      {
        "id": "ec816716-4c02-4f00-8877-a1ab965e89ef",
        "text": "Төменгі деңгейдегі құлып бар екенін жоғарғы деңгейде көрсету арқылы кесте деңгейіндегі құлыптауды тиімді ету үшін"
      },
      {
        "id": "152c1413-c709-4cfb-9f33-7c77d5f9f897",
        "text": "Транзакцияларды міндетті түрде өшіру үшін"
      },
      {
        "id": "7726440a-74d2-401d-a489-074232a9fe79",
        "text": "Деректерді жылдам шифрлау үшін"
      },
      {
        "id": "b9c6a2d1-b736-4ee2-af8f-884f7b68f139",
        "text": "Сыртқы кілттерді бұғаттау үшін"
      },
      {
        "id": "4661bfeb-dfdc-49af-b520-09206b3c4d6f",
        "text": "Транзакциялар арасындағы деректерді толықтай шифрлау үшін"
      },
      {
        "id": "1d5e5fad-fe0d-40fb-836c-66bf5d2f5fb6",
        "text": "Жүйедегі барлық құлыптарды бірден босату механизмі ретінде"
      },
      {
        "id": "44e23a20-5636-4966-b523-bb0c793c7310",
        "text": "Дерекқордағы индекстерді автоматты түрде қайта құру үшін"
      },
      {
        "id": "8c705b28-bc2d-4722-a630-3688a68ce49b",
        "text": "Пайдаланушының сұранысын орындау жылдамдығын екі есе арттыру үшін"
      }
    ],
    "correctOptionIds": [
      "ec816716-4c02-4f00-8877-a1ab965e89ef"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "38fe51d6-dd1e-4563-8577-d88b0520c9c7",
    "subjectId": "db",
    "text": "Изоляция деңгейлерінің ішіндегі \"Snapshot Isolation\" (С냅шоттық оқшаулау) қалай жұмыс істейді?",
    "options": [
      {
        "id": "0a398d68-3175-4d8a-a6e3-7040dc806b26",
        "text": "Әр транзакция деректердің өз басталған сәттегі нұсқасын (snapshot) оқиды, бұл оқу және жазу транзакциядарының бір-бірін күтпей орындалуына мүмкіндік береді"
      },
      {
        "id": "19d0b412-5eb7-4bd1-923e-6c0b89b9d127",
        "text": "Деректерді тек PDF түрінде оқиды"
      },
      {
        "id": "1b2dc944-6878-442a-9698-5c424e2d8a98",
        "text": "Кестені толығымен құлыптап тастайды"
      },
      {
        "id": "52d7f782-6f04-40d4-a62d-549d96b0af00",
        "text": "Транзакцияларды кезекпен орындайды"
      },
      {
        "id": "e94aa34d-d9c3-4341-94d6-848eed90cac8",
        "text": "Транзакция аяқталғанша барлық өзгерістерді уақытша кестеге сақтап, тек содан кейін негізгі кестеге жазуды күтеді"
      },
      {
        "id": "6d3060e5-c763-4cd8-915b-f6f03769d337",
        "text": "Оқу операциялары орындалып жатқан кезде жазу операцияларын толығымен бұғаттап, деректердің өзгеруіне жол бермейді"
      },
      {
        "id": "a49a26f2-a002-4ac2-a052-9374b47d19d7",
        "text": "Әрбір оқу сұранысы деректердің ең соңғы коммиттелген нұсқасын міндетті түрде қайта жүктеуді талап етеді"
      },
      {
        "id": "86e35f82-42ce-46b4-8ec2-1b165746b849",
        "text": "Жүйе транзакцияларды орындау ретін автоматты түрде өзгертіп, қақтығыстарды болдырмау үшін кезектілікті қатаң сақтайды"
      }
    ],
    "correctOptionIds": [
      "0a398d68-3175-4d8a-a6e3-7040dc806b26"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "478cc715-0b3e-4dd9-b786-271e6eb2461f",
    "subjectId": "db",
    "text": "Дерекқордағы \"Optimistic Concurrency Control\" (Оптимистік параллельдікті басқару) әдісі қашан қолданылады?",
    "options": [
      {
        "id": "25534991-45b9-4fcb-b6be-a698f00d238f",
        "text": "Транзакциялар арасында қақтығыстар (conflict) өте сирек болады деп болғанда және құлыптарды аз қолдану қажет болғанда"
      },
      {
        "id": "7489bf9e-cd7e-4c8b-921c-f9bc481862fa",
        "text": "Қақтығыстар тым жиі орын алатын жағдайда"
      },
      {
        "id": "c86feb93-2c8d-4805-9e6a-d7b8ddfc75b1",
        "text": "Тек оқу операциялары мүлдем болмағанда"
      },
      {
        "id": "a4772426-2354-46cb-ab5c-6fb56098472d",
        "text": "Дерекқор көлемі кішкентай болғанда"
      },
      {
        "id": "eb083707-8e20-4dc2-9287-8ec4407e4341",
        "text": "Транзакциялар арасындағы қақтығыстар өте жиі орын алатын және деректердің тұтастығын қатаң сақтау міндетті болған жағдайда"
      },
      {
        "id": "56fab120-3a4a-443c-8b6d-289d54035926",
        "text": "Дерекқорға жазу операцияларынан гөрі оқу операциялары басым болмай, тек түзетулер жүргізілетін кезде"
      },
      {
        "id": "d7a157cb-a5a0-4728-8512-3d7aaf3fd48e",
        "text": "Жүйе ресурстары шектеулі болғандықтан, транзакцияларды орындау алдында міндетті түрде құлыптау талап етілгенде"
      },
      {
        "id": "50a617f0-00af-4e00-b6ba-d8a256d3e3a3",
        "text": "Пайдаланушылардың әрекеттері алдын ала белгісіз болғандықтан, әрбір өзгеріс кезінде автоматты түрде блоктау қажет болғанда"
      }
    ],
    "correctOptionIds": [
      "25534991-45b9-4fcb-b6be-a698f00d238f"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "06727cd5-d1c1-4e66-89e4-f46e30b521ec",
    "subjectId": "db",
    "text": "\"Pessimistic Concurrency Control\" (Пессимистік параллельдікті басқару) әдісі қалай жұмыс істейді?",
    "options": [
      {
        "id": "05deb169-5fde-4181-847a-31c5d0d75699",
        "text": "Деректерді оқу немесе өзгерту алдында міндетті түрде құлыптар (locks) қойып, қақтығыстардың алдын алады"
      },
      {
        "id": "a55bb095-e3a8-4332-ad45-f1cd653e9ea3",
        "text": "Транзакция аяқталған соң ғана қақтығыстарды тексереді"
      },
      {
        "id": "4bcc03a7-b5b1-47bf-8e87-033fefcfba1e",
        "text": "Құлыптарды мүлдем қолданбайды"
      },
      {
        "id": "171e0198-85ca-49db-ab20-39fe7d4cf678",
        "text": "Транзакцияларды автоматты түрде өшіреді"
      },
      {
        "id": "4214fe27-7590-4872-a08a-c3e49234f799",
        "text": "Қақтығыс орын алған жағдайда транзакцияны автоматты түрде қайта іске қосады"
      },
      {
        "id": "3a4d8a7d-b5ab-4675-8811-0edc08c9bd87",
        "text": "Деректерді өзгерту кезінде құлыптарды қолданбай, тек нұсқаларды (versioning) салыстырады"
      },
      {
        "id": "99db0c78-6957-4b2d-99c6-f19577562792",
        "text": "Транзакциялардың басымдылығын анықтау үшін уақыт белгілерін (timestamps) ғана пайдаланады"
      },
      {
        "id": "62202100-ea7b-4c07-b2df-fa7f776e02bb",
        "text": "Жүйе қақтығыстарды болжамайды және олар орын алған соң ғана әрекет етеді"
      }
    ],
    "correctOptionIds": [
      "05deb169-5fde-4181-847a-31c5d0d75699"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "3fe525ab-311f-4eab-bb04-7707e0f3ab81",
    "subjectId": "db",
    "text": "Дерекқордағы \"Write-Ahead Logging\" (WAL) ережесі бойынша қандай әрекет бірінші орындалады?",
    "options": [
      {
        "id": "519bcdf6-5d5c-4203-a178-d15e75681aac",
        "text": "Өзгертілген деректер дискідегі дерекқор файлына (.mdf) жазылмас бұрын, олардың журналы дискідегі журнал файлына (.ldf) жазылуы керек"
      },
      {
        "id": "84a92787-bdb0-4321-a95a-348e61b472b4",
        "text": "Өзгерістер бірден дерекқор файлына жазылады, ал журнал кейін толтырылады"
      },
      {
        "id": "3d93dff8-1a7d-417b-9289-a834c892cf50",
        "text": "Деректер тек жедел жадта (RAM) сақталады"
      },
      {
        "id": "456a59c8-b3fe-4f2d-88f9-63f6c134e020",
        "text": "Сервер қайта іске қосылады"
      },
      {
        "id": "0483b2b7-215c-40df-8eae-781babe3d9a1",
        "text": "Журнал файлына жазу тек дерекқор файлы сәтті жаңартылғаннан кейін ғана жүзеге асырылады"
      },
      {
        "id": "ae2dd7cd-9023-44fe-bbff-da0efad00857",
        "text": "Өзгерістер алдымен дерекқор файлына жазылып, содан кейін ғана журналға көшіріледі"
      },
      {
        "id": "f2ac37c6-36a1-4163-b595-f46831eff612",
        "text": "WAL ережесі бойынша журнал файлдары тек жедел жадта сақталып, дискіге жазылмайды"
      },
      {
        "id": "9719cabc-5cd9-4e36-aa30-65fbfe613d40",
        "text": "Деректер мен журнал бір уақытта синхронды түрде дискіге жазылуы шарт"
      }
    ],
    "correctOptionIds": [
      "519bcdf6-5d5c-4203-a178-d15e75681aac"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "98abe413-b942-45e0-a600-c1dbbbd3088d",
    "subjectId": "db",
    "text": "SQL Server-де деректердің тұтастығын қолдайтын \"CHECK\" шектеуіне қайсысы мысал бола алады?",
    "options": [
      {
        "id": "3bfb6be0-6ef7-4746-8674-5a71967eb84a",
        "text": "CONSTRAINT chk_salary CHECK (salary >= 1000)"
      },
      {
        "id": "99efb7d5-a18d-4549-8d3c-6d6720ba3763",
        "text": "CONSTRAINT chk_salary PRIMARY KEY (salary)"
      },
      {
        "id": "103eeff7-f4da-44d6-88ad-571edc20fc91",
        "text": "CONSTRAINT chk_salary FOREIGN KEY REFERENCES dept(id)"
      },
      {
        "id": "a28ba9e7-bb19-4321-9c2f-77c0cbb5a7fe",
        "text": "CONSTRAINT chk_salary DEFAULT 1000"
      },
      {
        "id": "9d1c5aaf-7ece-4237-8fb9-51b579ed9a0f",
        "text": "CONSTRAINT chk_salary UNIQUE (salary)"
      },
      {
        "id": "342efa95-453a-4b92-8819-b2aa6725c11e",
        "text": "CONSTRAINT chk_salary CHECK EXISTS (SELECT * FROM employees)"
      },
      {
        "id": "f0e4c9b5-d326-4a41-aac3-287e507699e9",
        "text": "CONSTRAINT chk_salary NOT NULL (salary)"
      },
      {
        "id": "1d37536f-c0b1-4182-af70-2caedd1a8e71",
        "text": "CONSTRAINT chk_salary CHECK (salary = AVG(salary))"
      }
    ],
    "correctOptionIds": [
      "3bfb6be0-6ef7-4746-8674-5a71967eb84a"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "21995c26-498e-4dd3-9f13-c114d62456f5",
    "subjectId": "db",
    "text": "Дерекқордағы \"Сыртқы кілт\" (Foreign Key) сілтеме жасайтын кестенің жолы жойылғанда, бағынышты кестедегі сыртқы кілт мәнін өзгеріссіз қалдырып, жоюға мүлдем тыйым салатын нұсқау қандай?",
    "options": [
      {
        "id": "97584ac0-b513-4a06-b0c7-d41e90debd64",
        "text": "RESTRICT немесе NO ACTION"
      },
      {
        "id": "7bee0214-bc50-40a6-bf6d-ebe432f2009f",
        "text": "CASCADE"
      },
      {
        "id": "81ba8645-f854-4f1a-a310-5a3ad2c857e4",
        "text": "SET NULL"
      },
      {
        "id": "cd394c50-8093-4fcf-97aa-02b12a9e8b59",
        "text": "SET DEFAULT"
      },
      {
        "id": "14c94e0a-5359-452f-8c24-16ae09f36b7d",
        "text": "IGNORE және SKIP"
      },
      {
        "id": "20fd664b-d29d-4dcf-a361-67672808ed1e",
        "text": "DELETE және UPDATE"
      },
      {
        "id": "d404acce-369a-4e54-a0c1-89549704f5a0",
        "text": "LOCK және BLOCK"
      },
      {
        "id": "d0f2f4e9-7be3-443d-b5fd-680d3144d2ae",
        "text": "FORCE және DENY"
      }
    ],
    "correctOptionIds": [
      "97584ac0-b513-4a06-b0c7-d41e90debd64"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "68f233d1-f9e2-48f1-a701-371eb5593440",
    "subjectId": "db",
    "text": "SQL-де транзакцияны сәтті аяқтау арқылы оның барлық өзгерістерін дерекқорға біржола жазу қай командамен орындалады?",
    "options": [
      {
        "id": "ac61e7be-410f-45d8-986c-6e3fa8a8e544",
        "text": "COMMIT"
      },
      {
        "id": "6e0b6016-e94b-457f-8d2e-7e83edf6df2d",
        "text": "ROLLBACK"
      },
      {
        "id": "b7c3bf52-4cef-4f00-9faa-cc432c82e56d",
        "text": "SAVEPOINT"
      },
      {
        "id": "e5a31a4f-5c5a-4901-8940-357d0b4c1f96",
        "text": "START"
      },
      {
        "id": "985906dc-d47a-4e04-8ea0-108cf54d19fa",
        "text": "EXECUTE"
      },
      {
        "id": "de21d83f-dbcf-477c-b33f-8e216e66a265",
        "text": "FINALIZE"
      },
      {
        "id": "2ddaed8d-9c97-43a8-a6af-cfe51e59867f",
        "text": "CONFIRM"
      },
      {
        "id": "15645109-29b6-4cf8-9812-09f7eeb1ae24",
        "text": "APPLY"
      }
    ],
    "correctOptionIds": [
      "ac61e7be-410f-45d8-986c-6e3fa8a8e544"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "ad3258a9-8de3-4558-85b3-2b8c1e9bac8f",
    "subjectId": "db",
    "text": "SQL-де транзакцияны сәтсіз деп танып, оның басталғаннан бергі барлық өзгерістерін кері қайтару қай командамен орындалады?",
    "options": [
      {
        "id": "143a6ab2-889f-4695-8814-065d611b240c",
        "text": "ROLLBACK"
      },
      {
        "id": "b8e587a9-ee75-4a23-8780-4222c14c6d12",
        "text": "COMMIT"
      },
      {
        "id": "5f7939d5-da37-4ea7-a67f-a98fdaac823a",
        "text": "SAVEPOINT"
      },
      {
        "id": "a0a4419c-478e-439d-8d2f-b2f4925827cf",
        "text": "END"
      },
      {
        "id": "8bc2ba0b-59dd-4917-97cc-a49bbee04629",
        "text": "UNDO"
      },
      {
        "id": "38444e2a-8c1f-434c-af4d-36c37cc02d1e",
        "text": "REVERT"
      },
      {
        "id": "d168a638-9b66-4727-88e9-08b04a95be65",
        "text": "CANCEL"
      },
      {
        "id": "314aa718-e68f-4cbe-a8cf-81d98e34f85f",
        "text": "ABORT"
      }
    ],
    "correctOptionIds": [
      "143a6ab2-889f-4695-8814-065d611b240c"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "01d9f86b-db55-4e02-9db0-f77ec309a777",
    "subjectId": "db",
    "text": "Егер транзакция орындалу барысында жүйеде электр қуаты өшіп қалса, ДҚБЖ қайта қосылғанда бұл транзакциямен не істейді?",
    "options": [
      {
        "id": "0c60dcae-e17d-4483-9b58-ed5fa11df416",
        "text": "Транзакция аяқталмағандықтан, оның барлық әрекеттерін толығымен кері қайтарады (ROLLBACK)"
      },
      {
        "id": "8ca3ed17-5306-45e7-ade5-747cf66e7721",
        "text": "Оны сол тоқтаған жерінен жалғастырады"
      },
      {
        "id": "ee642393-5261-4977-816a-e917ca9975d9",
        "text": "Оны автоматты түрде COMMIT жасайды"
      },
      {
        "id": "465a0506-495e-4766-99d7-ff5f4480b099",
        "text": "Пайдаланушыдан сұрайды"
      },
      {
        "id": "86d57bb3-73f9-4d92-993a-6e63dcfefac3",
        "text": "Транзакцияны уақытша тоқтатылған күйінде сақтап, пайдаланушы қайта қосқанша күтеді"
      },
      {
        "id": "73d32f46-bbf9-4b95-bd1f-4b0c26c15974",
        "text": "Жүйе транзакцияның орындалған бөлігін сақтап қалып, тек аяқталмаған әрекеттерін ғана кері қайтарады"
      },
      {
        "id": "96a355ac-d959-4e6a-b046-7bf665770585",
        "text": "ДҚБЖ транзакцияны автоматты түрде жаңадан басынан бастап қайта орындайды"
      },
      {
        "id": "a9105d11-7fd6-44dd-8d46-6f80715c380a",
        "text": "Транзакция деректер базасында ілулі (pending) күйінде қалады және администратордың қолмен араласуын талап етеді"
      }
    ],
    "correctOptionIds": [
      "0c60dcae-e17d-4483-9b58-ed5fa11df416"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "6392bb73-3b11-417a-8888-db4f6418ef9c",
    "subjectId": "db",
    "text": "ACID бойынша \"Consistency\" (Сәйкестік/Тұтастық) қасиеті бұзылған жағдайды анықтаңыз:",
    "options": [
      {
        "id": "aa044f18-e054-4410-832c-3bebf742b6e7",
        "text": "Банктік аударымда бір шоттан ақша шығып, екінші шотқа түспей қалса"
      },
      {
        "id": "a58badb2-babe-444b-873a-5c29708c3a7e",
        "text": "Екі пайдаланушы бір мезгілде бір деректі оқыса"
      },
      {
        "id": "e39d7307-fa0e-4aad-b113-741ee0a2c923",
        "text": "Деректер дискіге сәтті жазылса"
      },
      {
        "id": "2c1bb81d-594c-425a-96b6-0ff8e5689430",
        "text": "Транзакция өз уақытында аяқталса"
      },
      {
        "id": "4a69b6ff-6642-435e-8e13-f16537d51d8a",
        "text": "Транзакция орындалып жатқанда дерекқорға басқа пайдаланушының қосылуына тыйым салынса"
      },
      {
        "id": "e1a6afa0-9dbb-4a91-862a-d42ca28e8930",
        "text": "Жүйе істен шыққан кезде барлық өзгерістер автоматты түрде кері қайтарылса (rollback)"
      },
      {
        "id": "20b33a5c-fade-48bb-aa69-d862b82a2941",
        "text": "Деректерді жаңарту операциясы дискіге толықтай жазылып үлгерсе"
      },
      {
        "id": "4a2abb60-5a7d-4839-85ff-89a67e2843ca",
        "text": "Екі транзакция бір уақытта орындалып, нәтижесі реттілікке байланысты өзгерсе"
      }
    ],
    "correctOptionIds": [
      "aa044f18-e054-4410-832c-3bebf742b6e7"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "454917c5-36b6-4cb7-bc0f-ee9b9bfb0233",
    "subjectId": "db",
    "text": "ACID қасиетіндегі \"Atomicity\" (Атомарлық) принципін бұзатын жағдай қандай?",
    "options": [
      {
        "id": "2e790bf8-d346-4121-8252-365e7da02316",
        "text": "Транзакциядағы 5 SQL командасының тек 3-еуі ғана орындалып сақталып, қалғандары орындалмай қалса"
      },
      {
        "id": "f71d538a-90da-46b2-9998-d3a98fb96ffd",
        "text": "Барлық командалар толық орындалса"
      },
      {
        "id": "e48adda9-fb05-4ca4-9d59-faa78a2f1123",
        "text": "Ешқандай команда орындалмаса"
      },
      {
        "id": "978c2106-f506-4ff2-8823-1969150261c1",
        "text": "Сұраныс баяу орындалса"
      },
      {
        "id": "abad8717-bd72-4796-a0d2-f4ebc3aaba81",
        "text": "Транзакция орындалып жатқанда басқа пайдаланушы деректерді өзгертсе"
      },
      {
        "id": "2557689e-99d9-49c2-bce0-9f12a1789dcd",
        "text": "Транзакция аяқталған соң сервер кенеттен өшіп қалса"
      },
      {
        "id": "c12f7270-ec38-432d-b528-598d47a6194e",
        "text": "Транзакциядағы командалар дұрыс ретпен орындалмаса"
      },
      {
        "id": "30240d6c-872c-409e-8cd3-efe687069c59",
        "text": "Транзакцияның орындалу уақыты жүйелік шектеуден асып кетсе"
      }
    ],
    "correctOptionIds": [
      "2e790bf8-d346-4121-8252-365e7da02316"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "f5f6d5d5-1eeb-45ae-8c2e-71c7f4ea4c01",
    "subjectId": "db",
    "text": "SQL-де кесте құру кезінде баған мәндерінің тек белгілі бір тізімде болуын (мысалы, 'Male', 'Female') шектеу үшін қай нұсқауды қолданған дұрыс?",
    "options": [
      {
        "id": "b95b1a7d-caa6-49fd-bc19-fcba34328af9",
        "text": "CHECK (gender IN ('Male', 'Female'))"
      },
      {
        "id": "aa4492ae-a582-4607-9239-22fa4ae93a40",
        "text": "UNIQUE (gender)"
      },
      {
        "id": "688b5ed0-8d09-4093-927a-83f217dbf65f",
        "text": "PRIMARY KEY (gender)"
      },
      {
        "id": "a1563041-cf39-47be-b5e3-800369b8430e",
        "text": "DEFAULT 'Male'"
      },
      {
        "id": "ad28f7b3-5a4a-456f-aabf-0b364cf9fa00",
        "text": "CONSTRAINT gender_list VALUES ('Male', 'Female')"
      },
      {
        "id": "7c2c2f18-c049-4ecb-ae96-f729a5de5455",
        "text": "ENUM (gender) = ('Male', 'Female')"
      },
      {
        "id": "618bc2a3-0a16-4bcb-900e-50aadb5f9a31",
        "text": "LIMIT gender TO ('Male', 'Female')"
      },
      {
        "id": "9b23fc4a-d732-4b93-9fcd-81e4f187e25e",
        "text": "VALIDATE gender IN ('Male', 'Female')"
      }
    ],
    "correctOptionIds": [
      "b95b1a7d-caa6-49fd-bc19-fcba34328af9"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "40426c4c-68c2-4b49-be40-c4317436fc02",
    "subjectId": "db",
    "text": "Дерекқордағы \"Dirty Read\" (Лас оқу) мәселесі неліктен қауіпті?",
    "options": [
      {
        "id": "d0aea205-4803-49fd-adce-496e11a14cf0",
        "text": "Өйткені оқылған деректер кейінірек кері қайтарылып (rollback), шын мәнінде дерекқорда мүлдем болмаған болып шығуы мүмкін"
      },
      {
        "id": "ef5e3bf2-911a-41db-97ab-00c9b88f6c48",
        "text": "Сұраныстың жылдамдығын төмендететіндіктен"
      },
      {
        "id": "84eaf37b-b69d-4b04-928a-55a4e8b7f04b",
        "text": "Дерекқордағы кестелерді өшіретіндіктен"
      },
      {
        "id": "5608663c-732b-4084-8397-620c43992909",
        "text": "Жаңа пайдаланушылардың тіркелуіне кедергі жасайтындықтан"
      },
      {
        "id": "ba02e3a4-41e8-4211-b62a-c982d5a2111d",
        "text": "Өйткені ол дерекқор серверінің жадындағы бос орынды толықтай толтырып, жүйені тоқтатады"
      },
      {
        "id": "10f2f3d5-2660-4408-b314-e450f079be6e",
        "text": "Себебі бұл кезде деректер автоматты түрде шифрланып, оқылмайтын форматқа ауысады"
      },
      {
        "id": "ef5e7079-9141-4396-b642-1169d987f817",
        "text": "Өйткені ол бір уақыттағы басқа транзакциялардың барлығын бірден тоқтатуға (abort) мәжбүрлейді"
      },
      {
        "id": "9c672054-5367-48a1-86d7-50c399400e60",
        "text": "Себебі мұндай оқу кезінде дерекқор индекстері тұрақсызданып, іздеу нәтижелері қате шығады"
      }
    ],
    "correctOptionIds": [
      "d0aea205-4803-49fd-adce-496e11a14cf0"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "b1100118-3625-4d6b-a4f0-a92c13e16aa4",
    "subjectId": "db",
    "text": "\"Dirty Write\" (Лас жазу) деген не?",
    "options": [
      {
        "id": "19f78a44-7cad-41c4-8221-8bfb464970d4",
        "text": "Бір транзакцияның commit болмаған өзгерістерін екінші транзакцияның үстінен жазып жіберуі (бұған барлық изоляция деңгейлерінде қатаң тыйым салынады)"
      },
      {
        "id": "2d5bcf88-f0ea-43f8-a96c-471b4789498d",
        "text": "Деректерді қате форматта жазу"
      },
      {
        "id": "bd9fbb92-ece7-45db-a170-6267a2faf8a1",
        "text": "Транзакция журналын дискіге жазбау"
      },
      {
        "id": "694482b0-b764-44fe-b86f-af61a426cefe",
        "text": "Индекстерді жаңарту кезіндегі қате"
      },
      {
        "id": "99a5af3f-0f95-499f-87fd-8450ee5a56e0",
        "text": "Транзакция аяқталғаннан кейін дерекқордағы ескі мәндерді қалпына келтіру процесі"
      },
      {
        "id": "4299bbe5-3866-4f0a-9b58-26d6d5d28cad",
        "text": "Екі транзакцияның бір уақытта бір деректі оқуы нәтижесінде сәйкессіздіктің пайда болуы"
      },
      {
        "id": "962f32c5-c614-4376-b620-a8cb69607af2",
        "text": "Жүйе істен шыққан кезде буфердегі өзгерістердің дискіге толық жазылмауы"
      },
      {
        "id": "8a04c984-5356-4445-97a2-361ba8f33823",
        "text": "Бір транзакцияның екінші транзакция жасаған өзгерісті көрмей, ескі дерекпен жұмыс істеуі"
      }
    ],
    "correctOptionIds": [
      "19f78a44-7cad-41c4-8221-8bfb464970d4"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "b6b7b6ca-8984-4759-b83c-c709af11d5c5",
    "subjectId": "db",
    "text": "Құлыптарды басқарудағы \"Lock Escalation\" (Құлыптарды ірілендіру) деген не?",
    "options": [
      {
        "id": "6ceba65a-2d38-4b8b-84ec-cd2f9c336070",
        "text": "Жеке жолдар деңгейіндегі тым көп құлыптарды жүйе ресурсын үнемдеу үшін автоматты түрде кесте деңгейіндегі бір құлыпқа айналдыруы"
      },
      {
        "id": "086e1f54-631c-44f8-a021-1cf4b40f3f6f",
        "text": "Құлыпты біржола өшіру"
      },
      {
        "id": "68b145ae-a90f-4e78-b5d5-e9e2127fe475",
        "text": "Бірлескен құлыпты ерекше құлыпқа ауыстыру"
      },
      {
        "id": "70b8f1bc-6690-4504-933d-13e53e5e747f",
        "text": "Deadlock-ты қолмен шешу"
      },
      {
        "id": "2b868787-03e3-46c8-b1fd-a563274b167c",
        "text": "Құлыптарды уақытша босату арқылы жүйенің өнімділігін арттыру әдісі"
      },
      {
        "id": "7cab7468-2a47-411a-aadc-6c4e11db7a52",
        "text": "Транзакцияны тоқтатпай, құлыптау деңгейін жолдан бетке (page) дейін төмендету процесі"
      },
      {
        "id": "9d6ba708-a6fa-4b85-8607-c496920dc5fc",
        "text": "Қате орындалған сұраныстарды болдырмау үшін құлыптарды алдын ала резервтеу механизмі"
      },
      {
        "id": "28585943-d220-4489-9954-5d07d644b340",
        "text": "Бірнеше пайдаланушының бір дерекке қол жеткізуін рұқсат ету мақсатында құлыптарды бөлу"
      }
    ],
    "correctOptionIds": [
      "6ceba65a-2d38-4b8b-84ec-cd2f9c336070"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "11fa2a65-a62f-4f8e-a670-1535d5f792f8",
    "subjectId": "db",
    "text": "Дерекқорда транзакцияның изоляция деңгейін орнату үшін SQL-де қандай команда қолданылады?",
    "options": [
      {
        "id": "41ffc245-2f5a-432c-aba2-8d14a46467cf",
        "text": "SET TRANSACTION ISOLATION LEVEL"
      },
      {
        "id": "ce5f6410-d345-4c58-8544-f12f47bf04d0",
        "text": "ALTER TRANSACTION LEVEL"
      },
      {
        "id": "ae0c9939-3d4c-4e2a-8ea7-301cfd6c9ad3",
        "text": "CREATE TRANSACTION LEVEL"
      },
      {
        "id": "2384bdb0-93a0-41f0-86aa-6ecb1cd19422",
        "text": "SET LEVEL ISOLATION"
      },
      {
        "id": "762e1dcc-c310-4081-b3fa-7f8564ad4b2f",
        "text": "CONFIGURE ISOLATION LEVEL"
      },
      {
        "id": "247f985f-9484-4b76-953a-2bc047930c5c",
        "text": "SET TRANSACTION MODE"
      },
      {
        "id": "d11203f4-a147-4eb1-97df-002436dafaff",
        "text": "ALTER SESSION ISOLATION"
      },
      {
        "id": "d90d212d-36c5-49db-9447-422c6c1d32e3",
        "text": "DEFINE TRANSACTION ISOLATION"
      }
    ],
    "correctOptionIds": [
      "41ffc245-2f5a-432c-aba2-8d14a46467cf"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "7683c107-17a2-4384-a9a0-e7e0a7c7724d",
    "subjectId": "db",
    "text": "SQL Server-де әдепкі бойынша қолданылатын транзакциялардың оқшаулау (isolation) деңгейі қандай?",
    "options": [
      {
        "id": "10ca0ce8-5fd2-40de-b062-0c5025b72452",
        "text": "READ COMMITTED"
      },
      {
        "id": "2b249ca2-922c-4508-91f6-424802c9f105",
        "text": "READ UNCOMMITTED"
      },
      {
        "id": "7ceea5f9-181b-4840-918e-5ac43f33c3ad",
        "text": "REPEATABLE READ"
      },
      {
        "id": "6b56de83-d00a-4836-af8c-74290adca666",
        "text": "SERIALIZABLE"
      },
      {
        "id": "f07e03a9-fe65-4a0d-85a1-16faa2bb0342",
        "text": "SNAPSHOT"
      },
      {
        "id": "ec3ba7d4-5e17-437d-bd98-2ad2912f0e3e",
        "text": "READ ONLY"
      },
      {
        "id": "08e209b4-3dc5-4478-a721-27054561db27",
        "text": "COMMITTED READ"
      },
      {
        "id": "b249fa29-030d-4174-85e3-60ff96882fc7",
        "text": "DIRTY READ"
      }
    ],
    "correctOptionIds": [
      "10ca0ce8-5fd2-40de-b062-0c5025b72452"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "ddfe73ef-cd8f-4fa1-80a1-44d96b0a2712",
    "subjectId": "db",
    "text": "PostgreSQL-де әдепкі бойынша қолданылатын транзакциялардың оқшаулау деңгейі қандай?",
    "options": [
      {
        "id": "3e9017d7-81d9-42c6-9ba1-07b850af35cd",
        "text": "READ COMMITTED"
      },
      {
        "id": "effe0daf-5979-4fc1-89ce-4a2391baf0b4",
        "text": "READ UNCOMMITTED"
      },
      {
        "id": "92b0a0e4-e721-4cff-abe3-78e9178b02e7",
        "text": "REPEATABLE READ"
      },
      {
        "id": "cfde5e99-ad1d-4f25-ad49-f3a3548c3b80",
        "text": "SERIALIZABLE"
      },
      {
        "id": "799b2827-9eb6-4813-ade0-bd867b47da54",
        "text": "SNAPSHOT"
      },
      {
        "id": "b3a9b4c3-da9c-4264-bdb6-06bf400bb490",
        "text": "READ ONLY"
      },
      {
        "id": "69790cb9-179b-4cf7-b2db-aeadec0feb39",
        "text": "AUTOCOMMIT"
      },
      {
        "id": "69c90ea3-1db1-4243-9d35-371f1291c35c",
        "text": "WRITE COMMITTED"
      }
    ],
    "correctOptionIds": [
      "3e9017d7-81d9-42c6-9ba1-07b850af35cd"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "3a5dfc1d-f9cb-4b31-ab57-3e5e0b467fd3",
    "subjectId": "db",
    "text": "Транзакцияның \"Durability\" (Тұрақтылық) қасиетін қамтамасыз ететін ДҚБЖ-ның негізгі процесі немесе файлы қандай?",
    "options": [
      {
        "id": "10a73bb9-2fa0-483b-af93-39a56e27945b",
        "text": "Transaction Log (Транзакциялар журналы)"
      },
      {
        "id": "d345d0fc-4565-4036-bdc1-2781f7b810af",
        "text": "Query Optimizer"
      },
      {
        "id": "4679afe1-dc60-41e1-8da0-c76ceda96dca",
        "text": "Metadata Cache"
      },
      {
        "id": "38e68ac7-c33c-4ea3-a92a-2c1533709ba9",
        "text": "System Catalog"
      },
      {
        "id": "a560f105-3d95-492b-9189-51429d0ae62c",
        "text": "Жадтағы буферлер (Buffer Pool)"
      },
      {
        "id": "b0cdb2f0-3339-4d11-9172-b64c37f13005",
        "text": "Өлі жазбаларды тазалаушы процесс (Vacuum)"
      },
      {
        "id": "ffc219e2-3db6-4e40-bf1b-739f629e512b",
        "text": "Сұраныстарды орындау жоспары (Execution Plan)"
      },
      {
        "id": "26c9713b-f883-4ffc-99ec-30d54c0cfc79",
        "text": "Деректерді индекстеу құрылымы (B-Tree Index)"
      }
    ],
    "correctOptionIds": [
      "10a73bb9-2fa0-483b-af93-39a56e27945b"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "1c24a917-8529-4a2b-9b17-85b55604033a",
    "subjectId": "db",
    "text": "Дерекқордағы \"Lock Timeout\" параметрі не үшін қажет?",
    "options": [
      {
        "id": "923aa56a-d453-4ac6-a509-c29c4e3e788e",
        "text": "Транзакция құлыпталған ресурсты шексіз күтіп тұрмай, белгілі бір уақыттан соң қатемен тоқтауы үшін"
      },
      {
        "id": "66bfb7a9-10bb-489f-9316-3828980cc9f4",
        "text": "Сұраныстардың жылдамдығын шектеу үшін"
      },
      {
        "id": "085d523e-4dab-44b8-8d28-e3e53ef2f416",
        "text": "Бастапқы кілтті автоматты түрде жаңарту үшін"
      },
      {
        "id": "e052099b-99af-4cc9-b68e-9298d8f022bc",
        "text": "Пайдаланушының сессиясын жабу үшін"
      },
      {
        "id": "2197f0fb-00d5-491d-a5a5-48810dbcf9a4",
        "text": "Құлыпталған деректерді автоматты түрде көшіру үшін"
      },
      {
        "id": "56279211-a934-487c-8eb6-30b76b1be5f8",
        "text": "Транзакцияның орындалу уақытын жоспарлау үшін"
      },
      {
        "id": "a85ad2b2-3444-4447-9d91-221ccaae4f10",
        "text": "Дерекқорға қосылған пайдаланушылар санын шектеу үшін"
      },
      {
        "id": "cd3479e8-f504-48ea-97dc-ca28f79ec4b1",
        "text": "Құлыптау кезіндегі деректердің көлемін азайту үшін"
      }
    ],
    "correctOptionIds": [
      "923aa56a-d453-4ac6-a509-c29c4e3e788e"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "39eb183b-c411-41eb-be96-2991b26ad24b",
    "subjectId": "db",
    "text": "Дерекқордағы \"Phantom Read\" (Елес оқу) аномалиясы қашан орын алады?",
    "options": [
      {
        "id": "20231b54-8d65-4a8c-8867-78ab428aa2e0",
        "text": "Бір транзакция белгілі бір шарт бойынша бірнеше жолды оқығаннан кейін, екінші транзакция сол шартқа сай жаңа жол қосқанда (INSERT) және бірінші транзакция қайта оқығанда жаңа жолдар пайда болғанда"
      },
      {
        "id": "e88f7b6a-bb7a-42de-80d5-f462277f1d28",
        "text": "Оқылған жолдардың бәрі жойылып кеткенде"
      },
      {
        "id": "01661c1d-4062-48ab-a6dd-980d7c5d2101",
        "text": "Бағанның аты өзгергенде"
      },
      {
        "id": "e7cdde47-6735-4ced-8308-aa5ccd472caa",
        "text": "Транзакция ортасында сервер өшкенде"
      },
      {
        "id": "fb010883-1136-45d6-aafc-265a22a65b24",
        "text": "Бір транзакция жолды оқыған соң, екінші транзакция сол жолдың деректерін өзгерткенде (UPDATE) және бірінші транзакция қайта оқығанда мән басқаша болғанда"
      },
      {
        "id": "2aa3cc1b-6445-4638-8fd7-93104d0b3857",
        "text": "Екі транзакция бір уақытта бірдей жолды жаңартуға (UPDATE) тырысып, біреуінің әрекеті сәтсіз аяқталғанда"
      },
      {
        "id": "886a9d63-17f0-476a-bb23-c451da2844d0",
        "text": "Транзакция ішінде оқылған жолдардың құрылымы (схема) басқа транзакция арқылы өзгертілгенде"
      },
      {
        "id": "07fffe0d-2e40-499d-8a84-a16dfc1fc883",
        "text": "Дерекқор сервері кенеттен өшіп, транзакция толықтай жоғалып кеткенде"
      }
    ],
    "correctOptionIds": [
      "20231b54-8d65-4a8c-8867-78ab428aa2e0"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "bec620c7-d344-4ee0-9912-c63e5534acb5",
    "subjectId": "db",
    "text": "\"Two-Phase Locking\" (2PL) принципі бойынша, егер транзакция бір құлыпты босатса (Shrinking phase басталса), ол жаңа құлып ала ала ма?",
    "options": [
      {
        "id": "c13ea266-8e6b-459d-95c6-c05f7d8231ba",
        "text": "Жоқ, 2PL ережесі бойынша қысқару фазасы басталған соң жаңа құлып алуға мүлдем тыйым салынады"
      },
      {
        "id": "7c24f681-59ae-4471-a519-b10bf52b9c23",
        "text": "Иә, кез келген уақытта ала береді"
      },
      {
        "id": "5f02d924-2a6a-4af0-8acf-64a60142f799",
        "text": "Тек бірлескен (Shared) құлыптарды ғана ала алады"
      },
      {
        "id": "600ab47b-f741-4a58-9cb5-86c03d42a5fc",
        "text": "Тек басты кесте үшін ала алады"
      },
      {
        "id": "3b03d8a2-5fe9-433b-a581-cf6039114aea",
        "text": "Иә, егер жаңа құлып бұрыннан бар құлыпқа қайшы келмесе алуға рұқсат етіледі"
      },
      {
        "id": "e571c892-d78a-47f9-a2c0-0afaf6276cdb",
        "text": "Жоқ, бірақ тек оқу операциялары үшін жаңа құлып алуға болады"
      },
      {
        "id": "0b55eeae-ec37-4a91-a601-a1f99212db7e",
        "text": "Иә, егер транзакция әлі де COMMIT немесе ROLLBACK жасамаса, құлып ала береді"
      },
      {
        "id": "a4dfd68a-a1c9-4cd1-9a33-7f37b4e11f41",
        "text": "Жоқ, тек басқа транзакциялар құлыпты толық босатқаннан кейін ғана жаңа құлып алуға болады"
      }
    ],
    "correctOptionIds": [
      "c13ea266-8e6b-459d-95c6-c05f7d8231ba"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "bb68a649-3780-4d45-9812-6a94a37cda51",
    "subjectId": "db",
    "text": "ACID-тегі \"Consistency\" (Сәйкестік) қасиетін қамтамасыз етуге кім немесе не жауапты?",
    "options": [
      {
        "id": "e3cb8fa3-c4c1-4ec8-9806-84804d7b0fe2",
        "text": "ДҚБЖ (шектеулер арқылы) және қолданбалы бағдарламашы (дұрыс бизнес логика жазу арқылы)"
      },
      {
        "id": "8892f287-40cf-42b6-be92-b2d0989392e1",
        "text": "Тек операциялық жүйе"
      },
      {
        "id": "cdbea19b-3463-4d85-bc12-eb53c416a356",
        "text": "Тек компьютердің жедел жады (RAM)"
      },
      {
        "id": "1c28e947-86f2-4d1a-a4cc-c88a9836ed67",
        "text": "Тек қана дерекқор әкімшісі (DBA)"
      },
      {
        "id": "eb6fd108-a28e-4cf7-b769-92c3bd74fce8",
        "text": "Тек қана желілік протоколдар мен қауіпсіздік брандмауэрлері"
      },
      {
        "id": "e48711c1-8e9d-447b-ad69-461f2be336ee",
        "text": "Автоматты түрде дерекқорды көшіру (репликация) жүйесі"
      },
      {
        "id": "6fb46274-d1ed-4dd6-9037-2dc73ceb326d",
        "text": "Тек транзакциялардың атомарлылығын (Atomicity) қамтамасыз ететін механизм"
      },
      {
        "id": "df38c549-34de-44f9-91ce-12f0149c406d",
        "text": "Дерекқор серверінің аппараттық құрылғыларының жылдамдығы"
      }
    ],
    "correctOptionIds": [
      "e3cb8fa3-c4c1-4ec8-9806-84804d7b0fe2"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "3ba04848-b661-4201-a64e-0a547e80bce5",
    "subjectId": "db",
    "text": "\"Dirty Read\" (Лас оқу) аномалиясы қай оқшаулау деңгейінде мүлдем болмайды?",
    "options": [
      {
        "id": "02b65c3e-d1ee-4bc3-9c8d-8627420133c1",
        "text": "READ COMMITTED және одан жоғары барлық деңгейлерде"
      },
      {
        "id": "b9ec6a5d-a743-499b-8ad2-d8eeaf3f0d33",
        "text": "Тек SERIALIZABLE деңгейінде ғана"
      },
      {
        "id": "3392161f-e489-47da-a7ea-30fb565f87ff",
        "text": "READ UNCOMMITTED деңгейінде"
      },
      {
        "id": "fd815fa1-7424-4a21-93e7-32ddbc69751d",
        "text": "Ешбір деңгейде қорғалмаған"
      },
      {
        "id": "ac49c4d3-7593-4104-8dc8-cd71a54008c6",
        "text": "Тек REPEATABLE READ деңгейінде ғана"
      },
      {
        "id": "01137d71-ae34-4d9f-bf7e-c9754e5c96fe",
        "text": "READ COMMITTED және REPEATABLE READ деңгейлерінде, бірақ SERIALIZABLE-да жоқ"
      },
      {
        "id": "a1428d85-f3ed-4430-804d-147d6b06ffe0",
        "text": "Барлық оқшаулау деңгейлерінде, тіпті READ UNCOMMITTED-те де болмайды"
      },
      {
        "id": "7714485b-8d81-4b24-95fc-3707f86cf7e2",
        "text": "Тек SERIALIZABLE және READ UNCOMMITTED деңгейлерінде"
      }
    ],
    "correctOptionIds": [
      "02b65c3e-d1ee-4bc3-9c8d-8627420133c1"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "72dc0a27-5730-42f8-9bf7-4195fa2153c6",
    "subjectId": "db",
    "text": "Егер екі транзакция бір мезгілде бір деректі өзгертуге (UPDATE) әрекет жасаса, ДҚБЖ олардың қақтығысын қалай реттейді?",
    "options": [
      {
        "id": "15f5a9e2-68a2-4a5a-ba00-822879f99ca5",
        "text": "Бірінші транзакция орындалып жатқанда дерекке Exclusive Lock қояды, ал екінші транзакция біріншісі аяқталғанша күтіп тұрады"
      },
      {
        "id": "14ecccdf-e571-4006-9008-0a0e22dbca5b",
        "text": "Екі өзгерісті де қабылдамай қате шығарады"
      },
      {
        "id": "72874269-ee68-44da-89a5-561b6dacd1ba",
        "text": "Екі өзгерісті де араластырып бірден жазады"
      },
      {
        "id": "08dce274-c25f-4f3f-8e83-9cdb7a1a37ad",
        "text": "Транзакциялардың бірін өшіріп тастайды"
      },
      {
        "id": "cf1878e0-44cc-4085-808c-da8630fddedd",
        "text": "Екі транзакция да деректі бір уақытта өзгерту үшін Shared Lock қолданады"
      },
      {
        "id": "ac883907-031b-405b-8d48-3c60d9276311",
        "text": "ДҚБЖ екі транзакцияны кездейсоқ таңдап, екіншісін автоматты түрде тоқтатады"
      },
      {
        "id": "d3597de3-b326-405c-b599-70ae01510d2b",
        "text": "Транзакциялардың орындалу реті жүйелік уақыт бойынша анықталып, екеуі де кезекпен орындалады"
      },
      {
        "id": "9c7413d2-e8e9-4260-b98d-6b5b983bf9bf",
        "text": "Деректердің тұтастығын сақтау үшін ДҚБЖ екі өзгерісті де жоққа шығарып, деректі бастапқы күйіне қайтарады"
      }
    ],
    "correctOptionIds": [
      "15f5a9e2-68a2-4a5a-ba00-822879f99ca5"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "a99adae5-7988-40cb-9ecf-93e952184259",
    "subjectId": "db",
    "text": "Дерекқордағы \"Inconsistent Read\" (Сәйкессіз оқу) мәселесі нені білдіреді?",
    "options": [
      {
        "id": "74b1a563-361e-4b90-bd19-36103f512645",
        "text": "Бір сұраныс барысында оқылған деректердің басқа параллель транзакциялардың әсерінен әртүрлі уақытта әртүрлі мән көрсетуі"
      },
      {
        "id": "f4058dcf-c12f-4303-8dcd-0d67a6290590",
        "text": "Деректердің қате форматта оқылуы"
      },
      {
        "id": "6d469b5c-4a02-4690-b057-80e40234ee8c",
        "text": "Сұраныстың нәтижесі мүлдем шықпауы"
      },
      {
        "id": "c8bf9668-14dd-46ed-9bf9-1fe05c14d85c",
        "text": "Транзакция журналының оқылмауы"
      },
      {
        "id": "0da2fe05-ab44-4baf-8cf1-2db5c1e7a675",
        "text": "Транзакция орындалып болған соң дерекқорға жазылмаған деректердің жоғалуы"
      },
      {
        "id": "0dddbbf3-17b9-49b9-8ba3-e70eaae3d1ec",
        "text": "Екі параллель транзакцияның бір уақытта бір деректі өзгертуге тырысуы"
      },
      {
        "id": "6c8b9047-76e5-4cd1-8620-85b40cc293a9",
        "text": "Дерекқор серверінің жадысы толып, оқу операциясының тоқтап қалуы"
      },
      {
        "id": "56f7fd84-f1cc-47ee-b921-b0e3250081a9",
        "text": "Бір транзакция ішіндегі есептеулердің дұрыс орындалмауынан нәтиженің қате шығуы"
      }
    ],
    "correctOptionIds": [
      "74b1a563-361e-4b90-bd19-36103f512645"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "d2921f18-b481-48bf-9bc7-ead50974adfe",
    "subjectId": "db",
    "text": "SQL-дегі \"ON DELETE SET DEFAULT\" сыртқы кілт нұсқауы не істейді?",
    "options": [
      {
        "id": "fcd97246-e923-4339-aa52-07aa023dfbb2",
        "text": "Басты кестедегі жол жойылғанда, бағынышты кестедегі сәйкес сыртқы кілттің мәндерін оның әдепкі (DEFAULT) мәніне теңестіреді"
      },
      {
        "id": "429162e9-0c88-40b2-88e7-4a1f5b428ead",
        "text": "Бағынышты кестедегі жолдарды толық жояды"
      },
      {
        "id": "925dc144-78b9-4cc5-afe8-67e416fb32c4",
        "text": "Сыртқы кілт мәнін NULL-ге ауыстырады"
      },
      {
        "id": "3475e005-101c-42bd-a07d-a28e290e9da8",
        "text": "Басты кестедегі жоюды болдырмайды"
      },
      {
        "id": "3c685a0f-dd1d-4710-a608-5910e4134bc3",
        "text": "Басты кестедегі жол жойылғанда, бағынышты кестедегі сәйкес жолдарды автоматты түрде жаңартып, деректерді көшіреді"
      },
      {
        "id": "ca1028b3-575b-49b1-b8f1-a1b329daedb3",
        "text": "Сыртқы кілт мәнін басты кестедегі соңғы жойылған жазбаның идентификаторына ауыстырады"
      },
      {
        "id": "1f2f3b8b-3937-455e-a46c-3ce406eeeb95",
        "text": "Бағынышты кестеге жаңа жол қосып, онда әдепкі мәнмен толтырылған көшірме жасайды"
      },
      {
        "id": "7143bf29-c5a2-4ef6-b65b-1ae1fe45b8de",
        "text": "Жою операциясы орындалғаннан кейін бағынышты кестенің барлық индекстерін қайта құрады"
      }
    ],
    "correctOptionIds": [
      "fcd97246-e923-4339-aa52-07aa023dfbb2"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "2696f967-311a-4777-830a-ad6719988b3e",
    "subjectId": "db",
    "text": "ACID қасиетінің толық атауы қандай?",
    "options": [
      {
        "id": "d6eb96ad-ef08-4d64-bc27-6da4f3aab2ce",
        "text": "Atomicity, Consistency, Isolation, Durability"
      },
      {
        "id": "1fad9291-1f07-4130-ba6b-d617c3258a17",
        "text": "Accuracy, Consistency, Integration, Database"
      },
      {
        "id": "5b8034e1-d7f5-4ff5-af35-e9f26474bc01",
        "text": "Atomicity, Concurrency, Isolation, Distribution"
      },
      {
        "id": "2c3b9ece-7941-424d-88ef-f2116a340ab9",
        "text": "Access, Control, Integrity, Data"
      },
      {
        "id": "cd93b3a7-faad-4ff3-be61-f398478fb7c4",
        "text": "Атомарлылық, Келісімділік, Оқшаулау, Тұрақтылық"
      },
      {
        "id": "61953b47-2260-4541-90a0-c6418992023d",
        "text": "Дәлдік, Сәйкестік, Интеграция, Дерекқор"
      },
      {
        "id": "88cdd042-3a63-4a87-b067-65c1ab753314",
        "text": "Қолжетімділік, Бақылау, Тұтастық, Деректер"
      },
      {
        "id": "d5970411-c157-4c5a-913e-504da23bdc15",
        "text": "Атомарлылық, Параллельдік, Оқшаулау, Бөлу"
      }
    ],
    "correctOptionIds": [
      "d6eb96ad-ef08-4d64-bc27-6da4f3aab2ce"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "35f2c6f6-bf1d-4f12-afcd-15013618409d",
    "subjectId": "db",
    "text": "Дерекқор транзакциясы сәтті аяқталып COMMIT болған соң, жүйе апатқа ұшыраса да (crash) деректердің жоғалмауы қай қасиетке жатады?",
    "options": [
      {
        "id": "02e14d63-abb1-4cc3-b2a6-a50f3f62b2a5",
        "text": "Durability (Тұрақтылық)"
      },
      {
        "id": "e9750dee-eebd-4996-80ec-5a885d05f496",
        "text": "Atomicity"
      },
      {
        "id": "e7e7b400-41ea-4fcb-919c-9a74514b4954",
        "text": "Consistency"
      },
      {
        "id": "74a2d936-847d-4630-b3da-8e3151d34074",
        "text": "Isolation"
      },
      {
        "id": "6cbdf64b-991a-4f4e-85ec-007436d12fe4",
        "text": "Жеделдік (Performance)"
      },
      {
        "id": "79098c27-362f-4a76-80c3-8be7be4a4902",
        "text": "Қайтымдылық (Reversibility)"
      },
      {
        "id": "95b5cca7-b3dc-4364-86cc-f809560a5f0e",
        "text": "Оқшаулау (Isolation)"
      },
      {
        "id": "5b935353-979c-4a3d-b7c8-a373ab602dde",
        "text": "Біртектілік (Uniformity)"
      }
    ],
    "correctOptionIds": [
      "02e14d63-abb1-4cc3-b2a6-a50f3f62b2a5"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "78b7c8b1-6e83-4a89-82c9-98d3a6da1f24",
    "subjectId": "db",
    "text": "Транзакциялардың параллель орындалуын басқарудағы \"Timestamp Ordering\" (Уақыт белгісі бойынша реттеу) әдісі не істейді?",
    "options": [
      {
        "id": "f60d364b-be92-466e-9e9a-c8bd1b3fe772",
        "text": "Әр транзакцияға бірегей уақыт белгісін (timestamp) беріп, оларды осы белгінің өсу ретімен орындайды"
      },
      {
        "id": "1b4c9e39-91c2-4c47-b4f1-5158f94b13bf",
        "text": "Транзакцияларды тек түнде орындайды"
      },
      {
        "id": "ee3af141-a8c2-431d-9511-bc01fc8ce102",
        "text": "Транзакцияларды құлыптар арқылы бұғаттайды"
      },
      {
        "id": "5dad1865-964a-4f95-8316-e9ba028a3ca2",
        "text": "Сұраныстарды тек 5 секунд сайын орындайды"
      },
      {
        "id": "411a44be-9923-46f9-b7da-1ba61ecc8b68",
        "text": "Транзакцияларды орындау ретін анықтау үшін жүйе кездейсоқ сандар генераторын қолданады"
      },
      {
        "id": "7b437d2a-e1e9-4703-a482-14a132e7ac67",
        "text": "Әр транзакцияға басымдық деңгейі беріліп, ең жоғары басымдығы бары бірінші орындалады"
      },
      {
        "id": "9c20407e-4e5d-4485-aba4-e1a6b92eff25",
        "text": "Транзакциялар деректерге өзгеріс енгізген соң ғана уақыт белгісі тағайындалады"
      },
      {
        "id": "159a9723-0f2e-4da7-8ed9-7045264a6ddc",
        "text": "Уақыт белгісі тек оқу операциялары үшін қолданылып, жазу операциялары құлыптау арқылы реттеледі"
      }
    ],
    "correctOptionIds": [
      "f60d364b-be92-466e-9e9a-c8bd1b3fe772"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "ceb9c0b9-00e8-4e7b-8d63-a6eb31e259fc",
    "subjectId": "db",
    "text": "Дерекқордағы \"Locking Protocol\" (Құлыптау хаттамасы) деген не?",
    "options": [
      {
        "id": "bfbf0cfa-355f-4430-a9b9-26985082a356",
        "text": "Транзакциялардың параллель жұмыс істеуі кезінде қақтығыстарды болдырмау үшін құлыптарды алу және босату ережелерінің жиынтығы"
      },
      {
        "id": "a76ab0ff-14c6-470f-aa61-9ef45f19412a",
        "text": "Пайдаланушыларды жүйеге кіргізу хаттамасы"
      },
      {
        "id": "830c4593-0d62-490f-9343-44204a2e9d88",
        "text": "Деректерді желі арқылы жіберу ережелері"
      },
      {
        "id": "1eef3137-468d-42d3-a3bd-6cb0b76b9b2b",
        "text": "Резервтік көшіруді басқаратын программа"
      },
      {
        "id": "36fff37e-539b-4f7b-b87a-ccd54d6d1298",
        "text": "Дерекқорға рұқсат етілмеген кіруді болдырмайтын қауіпсіздік шифрлау алгоритмі"
      },
      {
        "id": "0370a2b8-6d41-4566-91d0-03a4126ac454",
        "text": "Транзакциялар орындалғаннан кейін деректерді тұрақты жадқа сақтау механизмі"
      },
      {
        "id": "3e533186-9487-464a-b7f9-6df98355b003",
        "text": "Дерекқор кестелерінің құрылымын өзгертпей, индекстерді автоматты түрде жаңарту әдісі"
      },
      {
        "id": "4391fea6-d314-43a2-8843-efcf1449e1aa",
        "text": "Жүйе істен шыққан жағдайда транзакцияларды қайта бастау үшін журналды талдау процесі"
      }
    ],
    "correctOptionIds": [
      "bfbf0cfa-355f-4430-a9b9-26985082a356"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "2911ff99-bc11-4606-be4c-8e37ad70fb20",
    "subjectId": "db",
    "text": "Дерекқордағы \"Intention Lock\" (Ниет құлыптары) қандай деңгейде қойылады?",
    "options": [
      {
        "id": "fa5edda7-874e-49d6-8e5c-6060643f38ca",
        "text": "Кесте немесе деректер парағы (Page) деңгейінде"
      },
      {
        "id": "bbe1a502-ebec-4f3a-9b75-fbc8ea38d29a",
        "text": "Тек жеке бағандар деңгейінде"
      },
      {
        "id": "074d4ea2-6e3b-4256-9ed7-69e7111f5c5a",
        "text": "Дерекқордың бүкіл сервері деңгейінде"
      },
      {
        "id": "29129a17-46db-4f9c-8086-6dbf65624ef4",
        "text": "Тек сыртқы кілттер деңгейінде"
      },
      {
        "id": "dc9c93d0-c963-4c60-8ac0-31a52cbd69a3",
        "text": "Тек жеке жолдар (Row) деңгейінде"
      },
      {
        "id": "93faf85c-c9a5-4f9f-b3ae-a3fca76f7f4f",
        "text": "Тек индекстер деңгейінде"
      },
      {
        "id": "b0828b4a-fef8-42dc-820a-baadc490eca2",
        "text": "Транзакция журналы (Log) деңгейінде"
      },
      {
        "id": "5b0b2d6f-5347-4a7f-9f37-e817e1fbfe10",
        "text": "Пайдаланушы сессиясы деңгейінде"
      }
    ],
    "correctOptionIds": [
      "fa5edda7-874e-49d6-8e5c-6060643f38ca"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "64b50008-82ef-4e7c-8d12-f8b43747062b",
    "subjectId": "db",
    "text": "SQL-де транзакцияның орындалуы барысында SAVEPOINT құрылғаннан кейін, оған қайта оралу үшін қандай команда жазылады?",
    "options": [
      {
        "id": "3a7e089a-59c7-480f-a33f-9de3bc3a5ea7",
        "text": "ROLLBACK TO savepoint_name"
      },
      {
        "id": "f768da4c-1574-435d-b837-7bd658ef895b",
        "text": "COMMIT TO savepoint_name"
      },
      {
        "id": "a7b9fb00-21b3-4dce-966a-7a128652e86b",
        "text": "RETURN TO savepoint_name"
      },
      {
        "id": "bef56ff1-8e0a-4702-9199-ed4f8b6836f8",
        "text": "RESET TO savepoint_name"
      },
      {
        "id": "9745b112-2423-45a5-80c2-a99cb153b4f6",
        "text": "SAVE TO savepoint_name"
      },
      {
        "id": "185793da-d1fe-4566-b7c9-afda4c09a4fb",
        "text": "UNDO savepoint_name"
      },
      {
        "id": "d7fc92ab-9cf8-4725-97d5-55bd44c1f3e5",
        "text": "BACK TO savepoint_name"
      },
      {
        "id": "da885fbe-a65f-4ccc-a144-bd6a63f5bd95",
        "text": "REVERT savepoint_name"
      }
    ],
    "correctOptionIds": [
      "3a7e089a-59c7-480f-a33f-9de3bc3a5ea7"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "6293da1c-5ca8-41b0-8cf8-f1ca6f3b2ee4",
    "subjectId": "db",
    "text": "Дерекқордағы \"Write Lock\" (Жазу құлыбы) деп қай құлыпты атайды?",
    "options": [
      {
        "id": "4aa204a2-370c-432b-ac71-eaf4616f2f4c",
        "text": "Exclusive Lock (Ерекше құлып)"
      },
      {
        "id": "e8e33290-5548-4b9a-b00f-07d4d1263254",
        "text": "Shared Lock (Бірлескен құлып)"
      },
      {
        "id": "affb1655-8ed2-471b-82b8-48586c463899",
        "text": "Intent Lock"
      },
      {
        "id": "dbd54faa-5a7c-47ad-ac03-04f7023fcb29",
        "text": "Schema Lock"
      },
      {
        "id": "8aa9df6c-0175-48cb-9e6f-a44b4c178d4b",
        "text": "Оқу құлыбы (Read Lock)"
      },
      {
        "id": "a25d1d22-f101-4530-9079-248771562a6c",
        "text": "Кесте құлыбы (Table Lock)"
      },
      {
        "id": "727652bf-d5a4-41bf-85cf-afc489deb5bc",
        "text": "Жолдық құлып (Row Lock)"
      },
      {
        "id": "5c2e8e78-f3be-4adc-82bb-399e62099d0f",
        "text": "Өзгерту құлыбы (Update Lock)"
      }
    ],
    "correctOptionIds": [
      "4aa204a2-370c-432b-ac71-eaf4616f2f4c"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "93da7145-1d95-43f7-857d-dc6c49dea738",
    "subjectId": "db",
    "text": "Дерекқордағы \"Read Lock\" (Оқу құлыбы) деп қай құлыпты атайды?",
    "options": [
      {
        "id": "df1d095e-f337-45cf-953a-277006e49632",
        "text": "Shared Lock (Бірлескен құлып)"
      },
      {
        "id": "54933d3c-cc65-4306-88f3-0e0152afa959",
        "text": "Exclusive Lock (Ерекше құлып)"
      },
      {
        "id": "33947150-77c1-4758-8a93-46f300c2f48b",
        "text": "Intent Lock"
      },
      {
        "id": "0bc612d5-3f69-4129-9076-703694d7e020",
        "text": "Row Lock"
      },
      {
        "id": "12689796-cd6e-4f84-81a6-1e4a55374553",
        "text": "Жазу құлыбы (Write Lock)"
      },
      {
        "id": "becd9b2d-ffe1-4b3e-ace4-115d1a9ff7fc",
        "text": "Толық құлып (Full Lock)"
      },
      {
        "id": "dca6794a-f20a-4347-bd46-c4f978604e26",
        "text": "Кесте құлыбы (Table Lock)"
      },
      {
        "id": "b30bb594-a073-4c29-81ae-25c993e7aca7",
        "text": "Өзгерту құлыбы (Update Lock)"
      }
    ],
    "correctOptionIds": [
      "df1d095e-f337-45cf-953a-277006e49632"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "449c241b-cba9-4280-a7f4-3f44fc95d184",
    "subjectId": "db",
    "text": "Егер транзакция тек деректерді оқумен ғана айналысса (Read-only), оған қандай изоляция деңгейі ең қауіпсіз әрі жылдам болады?",
    "options": [
      {
        "id": "22561635-a4f4-445f-8a7f-ee8f2d60c7c1",
        "text": "READ COMMITTED немесе READ UNCOMMITTED (егер лас оқу маңызды болмаса)"
      },
      {
        "id": "1631d159-3108-4617-9f55-2763af5483e0",
        "text": "Міндетті түрде SERIALIZABLE"
      },
      {
        "id": "b368ffca-5d4d-4bbe-8802-bb2a3c6a7332",
        "text": "REPEATABLE READ"
      },
      {
        "id": "0d8f9fac-3fe8-4179-bf16-352f62505664",
        "text": "Оқшаулау деңгейін қолданбау керек"
      },
      {
        "id": "11789aa8-5876-4036-81e8-f073031a53ed",
        "text": "Тек SERIALIZABLE деңгейі деректердің толық тұтастығын кепілдендіреді"
      },
      {
        "id": "df3d4e44-3b1a-4b0a-988b-231600a3a3cf",
        "text": "Оқу операциялары үшін ешқандай изоляция деңгейі қажет емес, өйткені деректер өзгермейді"
      },
      {
        "id": "d16074e4-82d9-41c0-8e15-6ff6310cbe3a",
        "text": "READ UNCOMMITTED әрқашан қауіпсіз, себебі ол блоктауды толығымен жояды"
      },
      {
        "id": "3ef7b5cf-5e66-4a00-9aa3-b7dfa1d1ff5d",
        "text": "Ең жылдам нәтиже алу үшін міндетті түрде REPEATABLE READ таңдау керек"
      }
    ],
    "correctOptionIds": [
      "22561635-a4f4-445f-8a7f-ee8f2d60c7c1"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "3a758eff-a238-4289-9aaf-7cc480ad96a8",
    "subjectId": "db",
    "text": "Дерекқордағы \"Deadlock Detection\" (Deadlock-ты анықтау) алгоритмі қалай жұмыс істейді?",
    "options": [
      {
        "id": "a3a89557-e057-47f6-ab05-cf5802b06348",
        "text": "Транзакциялардың күту графынан (Wait-For Graph) циклдарды іздейді"
      },
      {
        "id": "9a222e9a-5ed0-454d-abb7-7c9465e32dd4",
        "text": "Сервердегі бос жад көлемін тексереді"
      },
      {
        "id": "0e4d1ebb-6bd2-4d43-9110-67d607f5a181",
        "text": "SQL сұраныстардың синтаксисін тексереді"
      },
      {
        "id": "9c314ab2-f388-4c8b-82dd-03b1fbac32a4",
        "text": "Пайдаланушылардың санын есептейді"
      },
      {
        "id": "38429bff-dd25-4450-8983-85da13d016c8",
        "text": "Транзакциялардың орындалу уақытына қарай ең ұзақ күткенін автоматты түрде тоқтатады"
      },
      {
        "id": "97fcc01d-2477-4d0d-8af5-45bbc5f9e7b0",
        "text": "Барлық белсенді транзакцияларға кезекпен құлыптау (locking) рұқсатын береді"
      },
      {
        "id": "3f07f995-4db9-4aa2-8659-abbd7240cdf0",
        "text": "Дерекқордағы индекстердің тұтастығын тексеру арқылы қақтығыстарды шешеді"
      },
      {
        "id": "9e3d70cf-8f6d-42c2-a36d-71abc7c50ddc",
        "text": "Жүйелік журналдардан (logs) соңғы өзгерістерді кері қайтару (rollback) арқылы талдайды"
      }
    ],
    "correctOptionIds": [
      "a3a89557-e057-47f6-ab05-cf5802b06348"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "01855b56-a7d8-41e9-bb3f-12d9721780da",
    "subjectId": "db",
    "text": "Дерекқорда Deadlock-тың алдын алудың (Deadlock Prevention) қандай екі негізгі әдісі бар?",
    "options": [
      {
        "id": "777492d8-824b-4501-943c-a2772812c73d",
        "text": "Wait-Die және Wound-Wait әдістері"
      },
      {
        "id": "d3269930-f942-4a60-b0bc-b4304758a7c6",
        "text": "Lock-Unlock және Commit-Rollback әдістері"
      },
      {
        "id": "dcdd4de0-4c63-4978-8cfa-f8a0df8e49e2",
        "text": "Read-Write және Share-Exclusive әдістері"
      },
      {
        "id": "473450c0-b642-4d5a-b833-d3ab5b4e3831",
        "text": "First-In және First-Out әдістері"
      },
      {
        "id": "051cdd10-5632-4343-ac42-0290cc9dc2bf",
        "text": "Timestamp-Ordering және Two-Phase Locking әдістері"
      },
      {
        "id": "e8d00354-64ae-4483-8b34-978fd60e045b",
        "text": "Resource-Holding және Resource-Releasing әдістері"
      },
      {
        "id": "600748f4-0b52-43c7-9db1-bf0cbf8e0726",
        "text": "Priority-Inversion және Starvation-Free әдістері"
      },
      {
        "id": "62a5e360-b075-40ac-9361-0a689624de4a",
        "text": "Serial-Schedule және Concurrent-Access әдістері"
      }
    ],
    "correctOptionIds": [
      "777492d8-824b-4501-943c-a2772812c73d"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "1837ff98-a8c7-4996-b793-2ca712349de3",
    "subjectId": "db",
    "text": "\"Wait-Die\" Deadlock prevention схемасында ескі (жұмыс істеп тұрғанына көп болған) транзакция жаңа транзакция құлыптаған ресурсты сұрағанда не істейді?",
    "options": [
      {
        "id": "9d2d8b68-4dde-4c7e-82d4-1b11c0f91d0b",
        "text": "Ескі транзакция күтеді (Waits)"
      },
      {
        "id": "8156161a-e744-4e82-b3f4-e5cc19b1cbbf",
        "text": "Ескі транзакция бірден өледі (Dies)"
      },
      {
        "id": "528a7d33-d72d-4fc1-aca6-7917475912e8",
        "text": "Жаңа транзакция ROLLBACK жасалады"
      },
      {
        "id": "576029d9-b752-4821-9632-95689e0eab7d",
        "text": "Екі транзакция да бір мезгілде аяқталады"
      },
      {
        "id": "a95cb012-8bae-4d36-ad46-60d1322c944a",
        "text": "Ескі транзакция жаңа транзакцияны күштеп тоқтатады (Abort)"
      },
      {
        "id": "0da039fc-5a36-4e8e-ab13-34e69a237425",
        "text": "Екі транзакция да құлыпты босатып, қайта іске қосылады"
      },
      {
        "id": "53ddf351-5eae-4d18-a708-ee2a05508d5c",
        "text": "Жүйе ескі транзакцияға басымдық беріп, ресурсты мәжбүрлеп алады"
      },
      {
        "id": "8a0a3227-6ff9-4785-82a6-2702ee3122b6",
        "text": "Ескі транзакция уақытша кезекке тұрып, кейін автоматты түрде өледі"
      }
    ],
    "correctOptionIds": [
      "9d2d8b68-4dde-4c7e-82d4-1b11c0f91d0b"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "17d720ff-2eab-45f8-b216-fdaefecf3490",
    "subjectId": "db",
    "text": "\"Wound-Wait\" Deadlock prevention схемасында ескі транзакция жаңа транзакция құлыптаған ресурсты сұраса не істейді?",
    "options": [
      {
        "id": "a0085c03-653e-4ae8-b188-ce341b4234ab",
        "text": "Жаңа транзакцияны тоқтатып кері қайтарады (Wounds/Aborts) немесе оның құлыбын тартып алады"
      },
      {
        "id": "922ead6a-938d-40dd-a582-43c63d287267",
        "text": "Ескі транзакция бірден өледі"
      },
      {
        "id": "41937585-dd80-443c-89cc-d874763d4fa5",
        "text": "Ескі транзакция күтеді"
      },
      {
        "id": "36749290-4da5-46e6-bbd1-ad8e96cbae31",
        "text": "Ешқандай әрекет орындалмайды"
      },
      {
        "id": "12f83be3-51f9-4202-b985-4e6b4c586216",
        "text": "Ескі транзакция ресурсты босатқанша күту режиміне ауысады"
      },
      {
        "id": "9281e50b-650a-4290-85b3-82e1f6c77a75",
        "text": "Жаңа транзакция ескі транзакцияның орындалуын уақытша тоқтата тұрады"
      },
      {
        "id": "e6abe213-2152-49f3-a0a6-a9cc708edbb9",
        "text": "Екі транзакция да бір мезетте кері қайтарылып, қайта іске қосылады"
      },
      {
        "id": "10e2c94f-0df0-4c58-bfa6-f935ebdae577",
        "text": "Ресурс екі транзакцияға бірдей бөлініп, параллель өңдеуге рұқсат етіледі"
      }
    ],
    "correctOptionIds": [
      "a0085c03-653e-4ae8-b188-ce341b4234ab"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "7cfb322f-5021-495d-9261-be2a0c0b5aeb",
    "subjectId": "db",
    "text": "Дерекқордағы \"Two-Phase Commit\" (2PC) хаттамасының бірінші кезеңінде (Prepare phase) координатор барлық қатысушылардан не сұрайды?",
    "options": [
      {
        "id": "936ffea5-ed57-433c-9442-750923f9ebb2",
        "text": "Транзакцияны commit жасауға дайын ба екендігін сұрап, дауыс беруді (Vote) талап етеді"
      },
      {
        "id": "5d08ca0a-9ee1-4361-94af-41c0ccee9d5a",
        "text": "Бірден транзакцияны аяқтауды сұрайды"
      },
      {
        "id": "b28b4e96-9639-4421-ac37-2e2fd0396bf0",
        "text": "Деректерді дискіге жазуды тоқтатуды сұрайды"
      },
      {
        "id": "e1f7a62f-cd3c-4843-8803-e296b9498ac6",
        "text": "Серверлерді қайта қосуды сұрайды"
      },
      {
        "id": "0af9f1f4-7a51-421a-890f-4b4183cf3670",
        "text": "Транзакцияны бірден орындап, нәтижені қайтаруды сұрайды"
      },
      {
        "id": "478ffa83-07aa-4b16-b31a-c95e190d9327",
        "text": "Барлық құлыптарды (locks) босатуды және ресурстарды азат етуді талап етеді"
      },
      {
        "id": "0b06b94c-28fa-4e38-a8f6-007b3cf95763",
        "text": "Жүйедегі барлық деректердің толық көшірмесін (backup) жасауды сұрайды"
      },
      {
        "id": "317fc955-1aa4-4bf8-84d3-f4084f119671",
        "text": "Координаторға транзакцияның орындалу уақытын хабарлауды міндеттейді"
      }
    ],
    "correctOptionIds": [
      "936ffea5-ed57-433c-9442-750923f9ebb2"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "64bc6ad8-7965-4a5a-9639-77202cef4b39",
    "subjectId": "db",
    "text": "Дерекқордағы 2PC хаттамасының екінші кезеңінде (Commit phase), егер барлық қатысушы дайын деп дауыс берсе, Координатор қандай шешім қабылдайды?",
    "options": [
      {
        "id": "262e008d-7d43-4e39-97d0-50405bae482b",
        "text": "Барлық қатысушыға COMMIT командасын орындауды бұйырады"
      },
      {
        "id": "25112a83-61cd-457b-a520-a1167032af4f",
        "text": "ROLLBACK бұйрығын жібереді"
      },
      {
        "id": "55e3e129-15f7-4b10-817e-1c9c2aaecfd4",
        "text": "Транзакцияны уақытша тоқтатады"
      },
      {
        "id": "ead276c9-a0f9-43a6-8124-f3675dce58fa",
        "text": "Қатысушыларды желіден ажыратады"
      },
      {
        "id": "21783e2e-6fe5-4ca4-b777-faa3f9d967d4",
        "text": "Әр қатысушыға өз бетінше шешім қабылдауға рұқсат береді"
      },
      {
        "id": "d4f93c40-e97c-4057-aa38-6716a1fd1fb1",
        "text": "Транзакцияны жартылай орындалған күйде сақтауды талап етеді"
      },
      {
        "id": "31ba735e-e3e3-47ec-bae9-f87c6885c6e0",
        "text": "Барлық қатысушыдан PREPARE сұранысын қайта жіберуді сұрайды"
      },
      {
        "id": "f7366862-9682-46ec-a697-e6d78f04cc82",
        "text": "Координатор транзакцияны автоматты түрде бас тарту (Abort) режиміне ауыстырады"
      }
    ],
    "correctOptionIds": [
      "262e008d-7d43-4e39-97d0-50405bae482b"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "b7a36fcc-3c5e-4b60-9408-71ad9ba766bc",
    "subjectId": "db",
    "text": "2PC хаттамасында кем дегенде бір қатысушы дайын емеспін (Veto/Abort) деп жауап берсе не болады?",
    "options": [
      {
        "id": "c2a033f2-e3e6-4313-ae99-4cf3ab28100d",
        "text": "Координатор барлық қатысушыға ROLLBACK жасауды бұйырады"
      },
      {
        "id": "75cb3cdc-c773-4a76-81c4-1a331b259566",
        "text": "Ол тек дайын серверлерде ғана COMMIT жасайды"
      },
      {
        "id": "e9c60382-06cf-432f-a699-44da6e1f87a7",
        "text": "Транзакцияны күту режиміне қояды"
      },
      {
        "id": "26a8f6ff-d2e8-41cf-96bf-e361a09c9cd2",
        "text": "Қателікті елемей орындай береді"
      },
      {
        "id": "52ac40a9-49bf-40d1-b00f-c332d1a91108",
        "text": "Координатор дауыс беру нәтижесін елемей, транзакцияны күштеп COMMIT жасайды"
      },
      {
        "id": "6a2524fe-53f5-4038-b02d-0904cfc3fa5c",
        "text": "Тек дауыс бермеген қатысушыларға ROLLBACK жасалып, қалғандары COMMIT алады"
      },
      {
        "id": "cc1764c5-6740-4615-8633-ea8141676289",
        "text": "Жүйе автоматты түрде екінші рет дауыс беру раундын бастайды"
      },
      {
        "id": "a7a8794c-e7df-43b6-9709-1c7a4d8542bb",
        "text": "Қатысушы өз бетінше транзакцияны тоқтатып, координаторға хабарлама жібермейді"
      }
    ],
    "correctOptionIds": [
      "c2a033f2-e3e6-4313-ae99-4cf3ab28100d"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "d58e1444-d069-4c38-b02a-7484a7930531",
    "subjectId": "db",
    "text": "Дерекқордағы \"Lost Update\" (Жоғалған жаңарту) мәселесі қашан орын алады?",
    "options": [
      {
        "id": "63753e6f-99d5-46fd-85e1-2d48eacf865e",
        "text": "Екі транзакция бір деректі қатар оқып, бірінен соң бірі өзгерткенде, соңғы өзгерту бірінші өзгертуді үстінен жауып (жойып) жібергенде"
      },
      {
        "id": "91666b4e-df25-4887-90bc-e6fb45427952",
        "text": "Деректі өшіру кезінде қате кеткенде"
      },
      {
        "id": "9826d6fa-1984-4949-8980-d317a4718d86",
        "text": "Сұраныс нәтижесі дискіге жазылмағанда"
      },
      {
        "id": "7da16ea2-2828-4c30-8493-71e9bae79d82",
        "text": "Бастапқы кілт автоматты түрде өзгергенде"
      },
      {
        "id": "8eadb121-895a-4c53-a6fd-78997bb3d093",
        "text": "Транзакция орындалып жатқанда дерекқор сервері кенеттен өшіп қалғанда"
      },
      {
        "id": "e67ccf73-4af5-4c23-8ce8-54cd1577f48a",
        "text": "Екі транзакция бір уақытта жаңа жазба қосуға әрекеттеніп, біреуінің кілті қайталанып кеткенде"
      },
      {
        "id": "953ae220-04b1-4cc7-9c93-227e8c84b448",
        "text": "Пайдаланушы деректі өзгерткен соң, COMMIT командасын орындауды ұмытып кеткенде"
      },
      {
        "id": "cf78d315-1271-4f64-b520-ac8d9e007e34",
        "text": "Бір транзакция екіншісінің әлі аяқталмаған деректерін оқып, дұрыс емес нәтиже алғанда"
      }
    ],
    "correctOptionIds": [
      "63753e6f-99d5-46fd-85e1-2d48eacf865e"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "fce73461-c1c2-4959-bdf3-6aa26f52e351",
    "subjectId": "db",
    "text": "Сұраныс барысында \"Non-repeatable Read\" аномалиясы қай оқшаулау деңгейінде мүлдем болмайды?",
    "options": [
      {
        "id": "df038d9c-c8fd-4c3f-b668-cb5f58551fef",
        "text": "REPEATABLE READ және одан жоғары барлық деңгейлерде"
      },
      {
        "id": "0c823e2c-e83d-4393-a50f-65d95b78968e",
        "text": "READ COMMITTED деңгейінде"
      },
      {
        "id": "0d585072-dfe0-4572-93c9-8145f5f928dc",
        "text": "READ UNCOMMITTED деңгейінде"
      },
      {
        "id": "da896e00-afdb-418e-96da-cb8f1693dd40",
        "text": "Ол ешқандай деңгейде шешілмеген"
      },
      {
        "id": "cf814d98-0990-42a1-bac8-bd6b157776d6",
        "text": "Тек SERIALIZABLE деңгейінде ғана"
      },
      {
        "id": "5ccf807e-9947-4bdf-9ad1-0263e605b5fe",
        "text": "READ UNCOMMITTED және READ COMMITTED деңгейлерінде"
      },
      {
        "id": "44f344c5-f911-4e33-97e0-ce983c09103c",
        "text": "Кез келген оқшаулау деңгейінде болуы мүмкін"
      },
      {
        "id": "971aaa83-dcca-4132-b1ca-ac59e3f6e648",
        "text": "Тек транзакциясыз орындалатын сұраныстарда"
      }
    ],
    "correctOptionIds": [
      "df038d9c-c8fd-4c3f-b668-cb5f58551fef"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "6d56d5e7-2a6a-4d15-9afc-d97038867498",
    "subjectId": "db",
    "text": "Дерекқордағы \"Dirty Read\" мәселесін болдырмау үшін транзакциялар қалай жұмыс істеуі керек?",
    "options": [
      {
        "id": "b5a4b58a-5008-4b38-966f-7ced6cce6f5e",
        "text": "Тек COMMIT болған деректерді ғана оқуы керек (READ COMMITTED изоляциясы қолданылуы тиіс)"
      },
      {
        "id": "566f216e-54ba-4ff5-afe2-9a9f47dcb06a",
        "text": "Кестелерге тек Shared Lock қойылуы керек"
      },
      {
        "id": "ba10f5d6-7c08-4cbd-9564-2b9e83decf83",
        "text": "Транзакцияларды тек кезекпен орындау керек"
      },
      {
        "id": "cc2c37a3-b08c-49ce-ba51-ed7458729925",
        "text": "Деректерді дискіге жазбау керек"
      },
      {
        "id": "68ca318b-4222-431c-b415-5be6b3d7124c",
        "text": "Транзакцияларды мүмкіндігінше ұзақ уақытқа созу керек"
      },
      {
        "id": "1e27c75a-014a-438f-a797-f1736cf6365a",
        "text": "Оқу операциялары үшін Exclusive Lock қолдану жеткілікті"
      },
      {
        "id": "80c202b3-5287-4aaa-af8e-76fc65cd64ac",
        "text": "Деректерді оқу кезінде ешқандай құлыптау механизмін қолданбау керек"
      },
      {
        "id": "21a3f30c-87c5-4326-be11-c3f77e00defc",
        "text": "Барлық транзакцияларды READ UNCOMMITTED деңгейінде орындау қажет"
      }
    ],
    "correctOptionIds": [
      "b5a4b58a-5008-4b38-966f-7ced6cce6f5e"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "c59731b6-a57b-4ddf-84ae-5604f6a04d29",
    "subjectId": "db",
    "text": "\"Phantom Read\" (Елес оқу) мәселесін шешу үшін қандай құлыптау түрі қолданылады?",
    "options": [
      {
        "id": "aa142668-f45d-437f-b3fd-889c6d756dd1",
        "text": "Диапазондық құлыптар (Range Locks) немесе SERIALIZABLE оқшаулау деңгейі"
      },
      {
        "id": "7447af65-95c5-4601-abfa-cdca5a2598b6",
        "text": "Row-level (жол деңгейіндегі) жай құлыптар"
      },
      {
        "id": "3c7077fc-e946-4afb-a723-87abca12e401",
        "text": "Кестені толық бұғаттау (Table lock)"
      },
      {
        "id": "5e94c1c0-6432-4043-b955-09b4cc0ca0f3",
        "text": "Жүйені тоқтату"
      },
      {
        "id": "6764f5c8-5734-4225-a1e9-4dc1d6a61324",
        "text": "Жол деңгейіндегі бөлісу құлыптары (Shared Row Locks)"
      },
      {
        "id": "dcb59528-0434-480c-98c3-50c1cd4f67e6",
        "text": "Уақытша кестелерді қолдану (Temporary Tables)"
      },
      {
        "id": "0c235f5b-b084-4ba4-9ab4-bca64ea83bc1",
        "text": "Транзакцияны автоматты түрде қайтару (Automatic Rollback)"
      },
      {
        "id": "a6d61f58-286d-407b-a2f2-5aae6a592b5a",
        "text": "Оптимистік құлыптау әдісі (Optimistic Locking)"
      }
    ],
    "correctOptionIds": [
      "aa142668-f45d-437f-b3fd-889c6d756dd1"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "4644c3cd-a4cd-4c5b-81ab-034ebd4910d3",
    "subjectId": "db",
    "text": "ACID қасиеттерін толық және тиімді қамтамасыз ету үшін ДҚБЖ қай екі негізгі жүйені бірге қолданады?",
    "options": [
      {
        "id": "70ab4879-738d-4481-9003-70bc5a4aa6e6",
        "text": "Параллельдікті басқару жүйесі (Lock Manager) және Қалпына келтіру жүйесі (Log Manager)"
      },
      {
        "id": "0ab314ad-29c7-4ddb-8232-901d42dd1494",
        "text": "Пайдаланушы интерфейсі және SQL компиляторы"
      },
      {
        "id": "04cf6171-0386-4f3a-9b5a-ce9fa4a8ba56",
        "text": "Секциялау жүйесі және индекстеу жүйесі"
      },
      {
        "id": "03795d15-2541-478e-a400-774a22f8d7ea",
        "text": "Файлдық жүйе және желілік хаттамалар"
      },
      {
        "id": "4555ded6-49ef-460c-a649-5700f9ac3b45",
        "text": "Транзакциялар мониторы және Кэш басқару жүйесі"
      },
      {
        "id": "bd1dca4f-3a71-4ded-abf5-b6c14aba1bdc",
        "text": "Оптимизатор жүйесі және Буферлік пул менеджері"
      },
      {
        "id": "ebbac2f0-9d22-4a95-bd51-65af08c08f98",
        "text": "Аутентификация модулі және Рұқсат беру жүйесі"
      },
      {
        "id": "d7060b7a-7a1f-49a1-8050-922b6a435502",
        "text": "Деректерді қысу алгоритмі және Шифрлау қозғалтқышы"
      }
    ],
    "correctOptionIds": [
      "70ab4879-738d-4481-9003-70bc5a4aa6e6"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  },
  {
    "id": "8b32b602-5d03-4943-a09b-2904d7027e49",
    "subjectId": "db",
    "text": "SQL-де \"ON DELETE SET NULL\" шектеуі қолданылғанда, басты кестедегі жол өшірілсе не болады?",
    "options": [
      {
        "id": "9d141bf6-04a9-4c65-8b9c-a8d7a2e66e2a",
        "text": "Бағынышты кестедегі сәйкес сыртқы кілттің мәндері NULL-ге теңестіріледі"
      },
      {
        "id": "bc401c72-6d7f-4c2a-8bd9-88eab9a92c25",
        "text": "Бағынышты кестедегі жолдар толығымен өшіріледі"
      },
      {
        "id": "a4af70cf-81e8-4bf1-9ea0-79f8da4c043d",
        "text": "Басты кестедегі өшіруге рұқсат берілмейді"
      },
      {
        "id": "9ad37477-fe3a-4505-bf5e-4db99cf45db5",
        "text": "Дерекқор қатемен жұмысын тоқтатады"
      },
      {
        "id": "ad1c10b8-3209-409d-9afe-2f2832d458da",
        "text": "Бағынышты кестедегі сәйкес жолдар автоматты түрде жаңартылып, басты кестеден көшіріледі"
      },
      {
        "id": "8e7d8035-16b1-49cd-b449-416b68fc0d1e",
        "text": "Басты кестедегі өшірілген жол қалпына келтіріліп, дерекқор өзгеріссіз қалады"
      },
      {
        "id": "73058e4e-beaf-4f3a-83df-3ba420e5e35b",
        "text": "Бағынышты кестедегі сыртқы кілт мәндері нөлге (0) теңестіріледі"
      },
      {
        "id": "8a7e965c-8443-4b53-be8f-39dcb91d5d98",
        "text": "Бағынышты кестедегі барлық жолдар толығымен тазартылып, кесте бос қалады"
      }
    ],
    "correctOptionIds": [
      "9d141bf6-04a9-4c65-8b9c-a8d7a2e66e2a"
    ],
    "type": "MULTIPLE",
    "topic": "Деректердің тұтастығы",
    "difficulty": "medium"
  }
] as Question[];
