import { Question } from '../../../../types';

// db / Ішкі және байланысқан SQL
export const db8SubqueriesQuestions = [
  {
    "id": "4af678ff-0f2e-4709-927d-e837d25c5dcd",
    "subjectId": "db",
    "text": "SQL-де ішкі сұраныс (subquery) дегеніміз не?",
    "options": [
      {
        "id": "01824b22-ed74-422e-8783-44fe55a8b948",
        "text": "Басқа SQL сұранысының ішіне кірістірілген сұраныс"
      },
      {
        "id": "53f56298-a3df-40c8-b795-e44ea5ec4c67",
        "text": "Дерекқордың резервтік көшірмесі"
      },
      {
        "id": "3a0bc5ba-fabb-426e-bb91-594d4afc2780",
        "text": "Кестедегі индекс атауы"
      },
      {
        "id": "4433e96e-0c8d-474b-97fa-8bfe48dce85c",
        "text": "Қателер журналы"
      },
      {
        "id": "13f68b7b-e2b9-43f6-862d-2ffa53ae865f",
        "text": "TRUE қайтарады, барлық жолдар сәйкес келеді"
      },
      {
        "id": "e08e0568-a98b-4a8d-8e14-e6467a9f24cd",
        "text": "Иә, әрқашан рұқсат етіледі және міндетті болып табылады"
      },
      {
        "id": "197301d1-0fc1-444c-bb0d-dd5591aba3a2",
        "text": "Тек PostgreSQL-де ғана рұқсат етілген"
      },
      {
        "id": "550374bd-e46d-493d-8541-59f2a34e32a5",
        "text": "IN операторы тек сандармен жұмыс істейді"
      }
    ],
    "correctOptionIds": [
      "01824b22-ed74-422e-8783-44fe55a8b948"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "d75f62cd-6fe8-4dde-b667-065d04bb979f",
    "subjectId": "db",
    "text": "Байланысқан ішкі сұраныс (correlated subquery) деген не?",
    "options": [
      {
        "id": "45bb23e8-a193-4740-a841-531cdf33a618",
        "text": "Сыртқы сұраныстың әрбір жолы үшін орындалатын және сыртқы сұраныс мәндеріне тәуелді ішкі сұраныс"
      },
      {
        "id": "ad94625e-5ebd-4a93-a051-1ddeadfde923",
        "text": "Тәуелсіз орындалатын және тек бір рет есептелетін ішкі сұраныс"
      },
      {
        "id": "350edfbe-cd2e-4371-b865-3659d257606c",
        "text": "Басқа сервердегі кестені оқитын сұраныс"
      },
      {
        "id": "b3b469ab-b3ca-4788-850d-537ccb86880a",
        "text": "Тек агрегаттық функцияларды қолданатын сұраныс"
      },
      {
        "id": "d91008b4-9296-44dd-8be9-f3593f4ecccf",
        "text": "Жаңартылатын жолдардың санын шектеу үшін"
      },
      {
        "id": "15956a75-6879-4c82-aed2-90a0bbec3e0e",
        "text": "Екі кестенің жартылай бірігуін"
      },
      {
        "id": "9e1576a8-3e7a-4447-8335-cdc4761fec30",
        "text": "Сыртқы сұраныстың әрбір жолы үшін жеке-жеке"
      },
      {
        "id": "b11cc818-5826-472a-b899-18bc9131c87c",
        "text": "Ол кестенің барлық жолдарын қайтаруы тиіс"
      }
    ],
    "correctOptionIds": [
      "45bb23e8-a193-4740-a841-531cdf33a618"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "hard"
  },
  {
    "id": "ee250fe4-7c67-48f1-9dd2-5e396c654502",
    "subjectId": "db",
    "text": "Ішкі сұраныста ең болмағанда бір жолдың бар екенін тексеру үшін қандай оператор қолданылады?",
    "options": [
      {
        "id": "ad594741-0f3b-4f70-8fe2-7487b9d0e1e1",
        "text": "EXISTS"
      },
      {
        "id": "7238408e-e39d-4e36-ba84-ce253d08c949",
        "text": "IN"
      },
      {
        "id": "96ea7a6c-241a-42ce-b58e-767f48b64b3b",
        "text": "LIKE"
      },
      {
        "id": "5d6f08a3-30a7-442b-a92b-fdac669fd72b",
        "text": "BETWEEN"
      },
      {
        "id": "5b08b930-fb26-42a5-82ec-ef2a1a6ae818",
        "text": "Сыртқы сұраныстың әрбір жолына тәуелді және сыртқы кестенің бағандарын сілтеме ретінде қолданатын ішкі сұраныс"
      },
      {
        "id": "89a16d83-44b4-4cda-94d1-439f09541bc7",
        "text": "Уақытша кесте"
      },
      {
        "id": "d5d06719-53da-4c2a-a7a7-6f08cdcb83bd",
        "text": "=, <, >"
      },
      {
        "id": "aed406b4-06f3-4511-ac2f-bbc9a1c10504",
        "text": "NULL қайтарғанда"
      }
    ],
    "correctOptionIds": [
      "ad594741-0f3b-4f70-8fe2-7487b9d0e1e1"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "af76aa0c-662a-4092-8793-95f270fff452",
    "subjectId": "db",
    "text": "Егер ішкі сұраныс бірнеше мәнді қайтарса, онымен салыстыру үшін сыртқы сұраныста қандай операторлар қолданылуы мүмкін?",
    "options": [
      {
        "id": "f83505ce-cfb6-49d6-98b7-ad127116c6da",
        "text": "IN, ANY, ALL"
      },
      {
        "id": "18217cbf-ded0-4fc5-a590-9468c747831c",
        "text": "=, <, >"
      },
      {
        "id": "844b6a10-c477-4344-9504-939c299f4901",
        "text": "LIKE, BETWEEN"
      },
      {
        "id": "a06d68c0-45cd-4171-ab3a-d8d4e5157b0f",
        "text": "IS NULL, IS NOT NULL"
      },
      {
        "id": "bc7cc776-dbe3-40b0-9e3b-f961f9e9f4ee",
        "text": "Тек байланысқан ішкі сұраныстар ғана жылдамырақ"
      },
      {
        "id": "64e1a5e7-0974-4e70-bcd6-e9646c90f12a",
        "text": "Барлық мәндермен орындалса ғана true қайтарады"
      },
      {
        "id": "17a91b55-2c60-491f-8da7-415f45e8f596",
        "text": "ДҚБЖ-ның ішкі сұранысты жазық JOIN құрылымына автоматты түрде өзгерту процесі"
      },
      {
        "id": "a7786bbd-5e96-41df-ac5d-de8f1dab897d",
        "text": "FALSE қайтарады, ешқандай жол сәйкес келмейді"
      }
    ],
    "correctOptionIds": [
      "f83505ce-cfb6-49d6-98b7-ad127116c6da"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "ce4c3820-5d05-44dc-9176-17cefedbfe22",
    "subjectId": "db",
    "text": "SQL-де ішкі сұраныс қай жерлерде жазылуы мүмкін?",
    "options": [
      {
        "id": "0b99deb6-72fd-4126-aaf0-83de2105233f",
        "text": "SELECT, FROM, WHERE және HAVING сөйлемдерінде"
      },
      {
        "id": "dfa1a165-9384-49e5-a8e0-6f79ba749a50",
        "text": "Тек WHERE сөйлемінде"
      },
      {
        "id": "83041ffa-1ef7-4e14-9ae1-a568359eb182",
        "text": "Тек FROM сөйлемінде"
      },
      {
        "id": "6546b80c-0468-4159-8a3f-49631dc33844",
        "text": "Тек SELECT сөйлемінде"
      },
      {
        "id": "5acad0de-cfc9-452f-a1c3-8c589f4e93fb",
        "text": "Дерекқордың орын жетпеуінен қысылуы"
      },
      {
        "id": "4a1c0e55-2ffa-404a-b449-4bf6f22bb875",
        "text": "NULL қайтарғанда"
      },
      {
        "id": "80abcc32-9839-4bdf-ad89-d4776d83af26",
        "text": "Әрбір студент жолының жанында барлық тесттердің ең жоғары балын қайталайды"
      },
      {
        "id": "808d86e6-4681-41b7-bcbc-338b699903f0",
        "text": "Тізімдегі мәндердің ешқайсысына тең емес (NOT IN баламасы)"
      }
    ],
    "correctOptionIds": [
      "0b99deb6-72fd-4126-aaf0-83de2105233f"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "07b70ced-2f8e-44e4-8d6a-200cdb5b2188",
    "subjectId": "db",
    "text": "FROM сөйлемінде қолданылатын ішкі сұраныс қалай аталады?",
    "options": [
      {
        "id": "0ee277e0-fa01-409a-8615-da2b53a2b21d",
        "text": "Туынды кесте (Derived Table) немесе Inline View"
      },
      {
        "id": "4f525f0d-a27c-443f-bf1b-43f5857319ed",
        "text": "Байланысқан сұраныс"
      },
      {
        "id": "f2b365bd-b914-496f-88ad-35625227e426",
        "text": "Скалярлық сұраныс"
      },
      {
        "id": "09b4c9ea-ad30-47cb-9479-af963e6ac46e",
        "text": "Екілік сұраныс"
      },
      {
        "id": "247fbaab-ad5f-497d-a582-30e0e5cacb24",
        "text": "Әдетте мағынасы жоқ және SQL Server сияқты кейбір жүйелерде тікелей қате береді"
      },
      {
        "id": "4f3d980f-7394-4fb8-8e3b-a4ef948a850e",
        "text": "Тек бірінші баған ғана сақталады"
      },
      {
        "id": "9d40e04d-53ac-4e2d-a2d2-4105670d16c6",
        "text": "Кірістірілген сұраныстар санын шектеу"
      },
      {
        "id": "744727b8-5bfc-408c-ace9-af5221aa088c",
        "text": "Иә, оларды тізбектей байланыстыруға болады"
      }
    ],
    "correctOptionIds": [
      "0ee277e0-fa01-409a-8615-da2b53a2b21d"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "d2acf380-72da-4081-b02e-ab15fe42bde5",
    "subjectId": "db",
    "text": "Тек бір жол және бір бағаннан тұратын жалғыз мәнді қайтаратын ішкі сұраныс қалай аталады?",
    "options": [
      {
        "id": "f0ce1531-ce54-4c6b-8e18-668b9188b72a",
        "text": "Скалярлық ішкі сұраныс (Scalar subquery)"
      },
      {
        "id": "07224da3-5740-4558-81e8-428b625c2786",
        "text": "Көпмәнді сұраныс"
      },
      {
        "id": "bbaf72ba-e866-4db5-8f8b-4cec9eadd452",
        "text": "Кестелік сұраныс"
      },
      {
        "id": "7bb6843f-b698-43b2-b184-56ba2b43e358",
        "text": "Кортеждік сұраныс"
      },
      {
        "id": "a226f7c0-2198-4930-8386-9980f54b16ab",
        "text": "Ішкі сұраныс әрқашан жылдамырақ"
      },
      {
        "id": "678a22ac-075c-4400-93b8-310835c016d5",
        "text": "Қателік (Error) шығарады"
      },
      {
        "id": "de85775a-9108-4b26-bd86-77a9bcd0d90d",
        "text": "Скалярлық ішкі сұранысты"
      },
      {
        "id": "61da5ecf-53fc-4520-88c9-50254a7c725b",
        "text": "ANY"
      }
    ],
    "correctOptionIds": [
      "f0ce1531-ce54-4c6b-8e18-668b9188b72a"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "ebac782a-04c2-495a-b302-8252956ff18d",
    "subjectId": "db",
    "text": "Сыртқы сұраныс мәндерін мүлдем қолданбайтын және дербес орындала алатын ішкі сұраныс қалай аталады?",
    "options": [
      {
        "id": "eda04d2e-81bf-4624-9a41-3b005102bd93",
        "text": "Тәуелсіз немесе қарапайым ішкі сұраныс (Non-correlated subquery)"
      },
      {
        "id": "d22a0c67-8c2d-47fa-a7a9-a0ced8ebad3c",
        "text": "Байланысқан сұраныс"
      },
      {
        "id": "9dae8afd-de46-46dd-86c7-2ca90850001d",
        "text": "Корреляцияланған сұраныс"
      },
      {
        "id": "8cd00831-7824-4a97-b300-cdf627c6a376",
        "text": "Ішкі кесте"
      },
      {
        "id": "ec6fd57a-977d-4bf3-88e1-ecf74d19f775",
        "text": "Әр санаттағы ең қымбат тауарларды табады"
      },
      {
        "id": "e8eda4b2-9336-4972-a279-4b66b1bc1b93",
        "text": "Көпмәнді сұраныс"
      },
      {
        "id": "f6c0a373-272f-491f-a2ae-3c329283f12c",
        "text": "Әрқашан TRUE қайтарады"
      },
      {
        "id": "df15d4d5-a13e-4456-8d9f-19f5e5224340",
        "text": "Қателер журналы"
      }
    ],
    "correctOptionIds": [
      "eda04d2e-81bf-4624-9a41-3b005102bd93"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "73c42fbc-8c01-4033-92a0-124f5e1d8de3",
    "subjectId": "db",
    "text": "ANY операторы ішкі сұраныспен қалай жұмыс істейді?",
    "options": [
      {
        "id": "986d8820-a358-4f03-81ad-9cc2d68dcd4c",
        "text": "Ішкі сұраныс қайтарған мәндердің ең болмағанда біреуімен шарт орындалса true қайтарады"
      },
      {
        "id": "42c30658-22c3-43e4-a616-bd786664a919",
        "text": "Барлық мәндермен орындалса ғана true қайтарады"
      },
      {
        "id": "16a55b4b-9df5-47ad-8de9-a632b2de0697",
        "text": "Тек NULL мәндер болса орындалады"
      },
      {
        "id": "852826da-a0b9-40c7-acb9-7ae190a1ce8e",
        "text": "Ешқашан орындалмайды"
      },
      {
        "id": "4cf219bf-ae98-4449-b1d5-6e273011e485",
        "text": "Тек бірінші жол қайтарылады"
      },
      {
        "id": "5cbc45aa-0540-49d5-8065-011756d50cb9",
        "text": "EXISTS"
      },
      {
        "id": "ac01ce69-eb7f-4c35-98e5-a14eddcf81cc",
        "text": "Ішкі сұраныстан кем дегенде бір жол қайтарылса"
      },
      {
        "id": "ff4f6f72-538b-4b6d-bf1a-0983fe5e6717",
        "text": "EXISTS операторының"
      }
    ],
    "correctOptionIds": [
      "986d8820-a358-4f03-81ad-9cc2d68dcd4c"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "74706384-663a-44d5-9d23-e85d1e687100",
    "subjectId": "db",
    "text": "ALL операторы ішкі сұраныспен қалай жұмыс істейді?",
    "options": [
      {
        "id": "8d17f57a-0a6c-4197-8889-75feaa4a29c1",
        "text": "Ішкі сұраныс қайтарған барлық мәндермен шарт орындалса ғана true қайтарады"
      },
      {
        "id": "83e3a506-4480-46de-8cdd-30e26c4798a5",
        "text": "Ең болмағанда біреуімен орындалса true қайтарады"
      },
      {
        "id": "17f0a2a8-5e0f-43cb-bf14-7c40641675b0",
        "text": "Тек бірінші мәнмен салыстырады"
      },
      {
        "id": "25e92156-e812-45ca-bce8-5f22767fef02",
        "text": "Деректерді біріктіреді"
      },
      {
        "id": "e3a547b8-5f6c-480c-8f14-5ec4db47c441",
        "text": "IT департаментіндегі қызметкерлердің жалақысын 10%-ға өсіреді"
      },
      {
        "id": "b737468f-8e3c-4351-9e05-870b673ea6f6",
        "text": "Орташа жалақы дұрыс есептелмегендіктен"
      },
      {
        "id": "144d52ad-f071-40db-ae60-6f088495b1ee",
        "text": "Ешқандай санатқа жатпайтын тауарларды табады"
      },
      {
        "id": "fdd2e59d-dc79-49d5-aef4-6d4df914d204",
        "text": "DROP сұраныстарында"
      }
    ],
    "correctOptionIds": [
      "8d17f57a-0a6c-4197-8889-75feaa4a29c1"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "a6ee3ad0-6a7c-4c74-813e-1fe1ab14924d",
    "subjectId": "db",
    "text": "Ішкі сұраныста IN операторының орнына балама ретінде қандай операторды қолдануға болады?",
    "options": [
      {
        "id": "cb031069-c7a9-4a59-b64a-0a20c248f9bd",
        "text": "= ANY"
      },
      {
        "id": "07125d65-cb19-4422-9f4d-1d68b62380ee",
        "text": "= ALL"
      },
      {
        "id": "a1dd7c3d-3127-48df-a9f3-46b9bddeb5e0",
        "text": "LIKE"
      },
      {
        "id": "777faace-f157-4bc9-ba89-0c3a9f512579",
        "text": "EXISTS"
      },
      {
        "id": "f6505adf-9709-40c1-8e82-22bdd3937833",
        "text": "Деректердің қауіпсіздік ережелерін орнату"
      },
      {
        "id": "104e6ffc-234d-497e-97e4-ea890303a5b2",
        "text": "Жүйелік каталог"
      },
      {
        "id": "d4154f67-dca2-4aff-a17d-162fdaedfa9f",
        "text": "Егер 5-ші департаментте бірден көп қызметкер жұмыс істесе, скалярлық емес салыстыру қатесін береді"
      },
      {
        "id": "5e6fa86d-a748-4418-8b58-40c176553e87",
        "text": "Бос мәтін"
      }
    ],
    "correctOptionIds": [
      "cb031069-c7a9-4a59-b64a-0a20c248f9bd"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "d306b1b5-7dec-400b-9e63-6088b04af89a",
    "subjectId": "db",
    "text": "Байланысқан ішкі сұраныстың өнімділігі қарапайым ішкі сұранысқа қарағанда неліктен төмен болуы мүмкін?",
    "options": [
      {
        "id": "15b7b245-3c82-473d-af1f-ce6c320da6c2",
        "text": "Ол сыртқы сұраныстың әрбір жолы үшін қайта-қайта орындалатындықтан"
      },
      {
        "id": "2f12a6d0-14dd-4d1b-8aea-7d612e589258",
        "text": "Ол тек бір рет есептелетіндіктен"
      },
      {
        "id": "3594186c-fb7c-42ef-98df-3df8cc30ca99",
        "text": "Оған индекстер әсер етпейтіндіктен"
      },
      {
        "id": "b6295ba8-58eb-4677-8284-1ae88634bd87",
        "text": "Ол тек басқа серверде орындалатындықтан"
      },
      {
        "id": "73f6abd9-e659-465b-bd3f-c5ae72d940e1",
        "text": "Тек оң жақтағы кестенің сәйкес емес жолдарын қайтаруды"
      },
      {
        "id": "3f7597a0-e036-4d12-b154-07660b6c05db",
        "text": "Ең қымбат тауарды табады"
      },
      {
        "id": "fd389313-c921-453e-b2fe-cf0a911abab5",
        "text": "INTERSECT"
      },
      {
        "id": "4bf5e742-1e5a-4391-80f0-efded368097c",
        "text": "Сыртқы сұраныс мәнінің ішкі сұраныстан қайтқан жиынтықтың (тізімнің) ішінде болуын"
      }
    ],
    "correctOptionIds": [
      "15b7b245-3c82-473d-af1f-ce6c320da6c2"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "22f8c002-2c5a-47c1-aac9-a20fb37c23c0",
    "subjectId": "db",
    "text": "SQL-де ішкі сұраныс нәтижесінде қайтарылған мәндердің арасында белгілі бір мәннің жоқ екенін тексеру үшін қандай оператор қолданылады?",
    "options": [
      {
        "id": "5d99cf32-22a4-4b50-9480-8afad4bfd2b3",
        "text": "NOT IN"
      },
      {
        "id": "68a6fde8-21e0-40f0-8174-bfecc11aa4a1",
        "text": "IN"
      },
      {
        "id": "d62510c3-b323-4f57-a6f9-46ef925675ea",
        "text": "EXCEPT"
      },
      {
        "id": "8371a722-a8d3-4598-bb59-acc9b97f7e23",
        "text": "NOT EXISTS"
      },
      {
        "id": "3ecfb7bb-5d27-4cd1-8362-93081082c851",
        "text": "Қызметкері жоқ департаменттерді"
      },
      {
        "id": "13ed346b-106e-46b1-b373-cf316674dcfe",
        "text": "Common Table Expression (Ортақ кестелік өрнек)"
      },
      {
        "id": "e2a0b120-498f-42d5-9861-b4ea1a5bdf9a",
        "text": "Қате тудырады"
      },
      {
        "id": "d4d02473-ee59-45f2-aeb6-b933a0139fdb",
        "text": "Скалярлық ішкі сұранысты"
      }
    ],
    "correctOptionIds": [
      "5d99cf32-22a4-4b50-9480-8afad4bfd2b3"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "3fd6cb9f-d6e8-4f86-9384-c2ecf06d094d",
    "subjectId": "db",
    "text": "Егер ішкі сұраныс бос нәтиже (NULL немесе бос жиын) қайтарса, NOT IN операторы қолданылған сұраныс нәтижесі қандай болады?",
    "options": [
      {
        "id": "1e705cb6-87cd-4275-8f00-35152efd4636",
        "text": "Сұраныс бос нәтиже қайтарады, өйткені NULL-мен салыстыру белгісіз мәнді береді"
      },
      {
        "id": "e289aab2-09d9-4d8c-a195-d0ab1d349aee",
        "text": "Сұраныс барлық нәтижелерді қайтарады"
      },
      {
        "id": "7b428a0a-695b-477e-a76c-a9f355adf4a0",
        "text": "Сұраныс қатемен тоқтайды"
      },
      {
        "id": "357bb6d3-1a55-4324-9184-d27a14b37ffc",
        "text": "Тек бірінші жол қайтарылады"
      },
      {
        "id": "e28be525-cd79-404f-9708-d3df527c5042",
        "text": "Кестедегі индекс атауы"
      },
      {
        "id": "bb26ff08-13cd-4689-987b-68e2c7581379",
        "text": "Тек сандар үшін рұқсат етіледі"
      },
      {
        "id": "999c7c85-ce73-4998-bf85-9a327a6d0748",
        "text": "Тек бірінші жол ғана көрсетіледі"
      },
      {
        "id": "7ecb24f4-daea-44c3-9735-658f98ef7d80",
        "text": "Әдетте мағынасы жоқ және SQL Server сияқты кейбір жүйелерде тікелей қате береді"
      }
    ],
    "correctOptionIds": [
      "1e705cb6-87cd-4275-8f00-35152efd4636"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "b333ce78-1068-4724-a1a7-8a8868281a82",
    "subjectId": "db",
    "text": "SELECT тізіміндегі скалярлық ішкі сұраныс үшін қандай ереже сақталуы тиіс?",
    "options": [
      {
        "id": "80a9c0be-06be-4714-99ae-14209b746e09",
        "text": "Ол тек бір баған және ең көп дегенде бір жол (жалғыз мән) қайтаруы керек"
      },
      {
        "id": "a1715d73-fb5d-4937-9afd-e9f84e8ac02f",
        "text": "Ол бірнеше бағанды қайтара алады"
      },
      {
        "id": "a74157be-7b76-4398-8bce-216c8d3fb2e9",
        "text": "Ол кестенің барлық жолдарын қайтаруы тиіс"
      },
      {
        "id": "8f568ca0-9d88-4c53-93c5-0cc03cb72c1b",
        "text": "Ол ешқандай ережеге бағынбайды"
      },
      {
        "id": "3d071082-404d-44c9-ac88-4c7b19e86229",
        "text": "Ішкі сұраныстардың қателікке ұшырап тоқтауы"
      },
      {
        "id": "8dab1317-524a-4bf7-a647-b362580cc7f7",
        "text": "Тек бірінші жол ғана көрсетіледі"
      },
      {
        "id": "0ff0c01c-c1c9-4b63-a8fa-cd32971d5d20",
        "text": "Скалярлық ішкі сұраныс (Scalar subquery)"
      },
      {
        "id": "221d6c80-0edc-45e9-9bd3-f3c75e8ce881",
        "text": "Тек скалярлық ішкі сұраныстарда болады"
      }
    ],
    "correctOptionIds": [
      "80a9c0be-06be-4714-99ae-14209b746e09"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "0c8eaac4-facf-4199-8df1-56b25eaf0a38",
    "subjectId": "db",
    "text": "SQL-де ішкі сұраныс нәтижесін басқа мәндермен салыстырғанда \"кем дегенде біреуінен үлкен\" шартын қалай жазады?",
    "options": [
      {
        "id": "2302917b-d2ba-4d7e-a807-569f088a0b21",
        "text": "> ANY"
      },
      {
        "id": "9f522fc8-8a3a-4f20-a8fe-c6abbf0a4849",
        "text": "> ALL"
      },
      {
        "id": "13c5871f-21dd-4951-bfcc-5634e939bc33",
        "text": "= ANY"
      },
      {
        "id": "928e8cf8-82f7-4917-b6ac-6531c6ef6dab",
        "text": "> EXISTS"
      },
      {
        "id": "58f1fe05-c319-4f9f-bc37-c1287b3d970b",
        "text": "Жаңартылатын жолдардың санын шектеу үшін"
      },
      {
        "id": "5183c0b4-14d3-410f-b58e-adca82d88330",
        "text": "Ішкі сұранысты алып тастау"
      },
      {
        "id": "de4d4b9b-1753-4660-83dc-b0677aaceb36",
        "text": "Сыртқы кестенің Тек ішкі кестеде сәйкестігі бар жолдарын ғана қайтаратын операция (EXISTS немесе IN арқылы жасалады)"
      },
      {
        "id": "ba031395-6449-4d86-9bde-ec19c36e27e7",
        "text": "Қате шығады (Subquery returns more than 1 row)"
      }
    ],
    "correctOptionIds": [
      "2302917b-d2ba-4d7e-a807-569f088a0b21"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "a6a80dcf-71f3-4696-8f95-0ba22b14a9a9",
    "subjectId": "db",
    "text": "SQL-де ішкі сұраныс нәтижесін басқа мәндермен салыстырғанда \"барлығынан кіші\" шартын қалай жазады?",
    "options": [
      {
        "id": "89e64646-0608-4029-9991-14c323226b88",
        "text": "< ALL"
      },
      {
        "id": "d1fa9449-2b0e-4adb-a009-a8f5c7cb0ccb",
        "text": "< ANY"
      },
      {
        "id": "4f57b433-b2ac-4306-a168-35bd98949ee6",
        "text": "<= ANY"
      },
      {
        "id": "b14ef9ce-68e0-4f2b-9b79-a81b7c12512e",
        "text": "= ALL"
      },
      {
        "id": "346d7725-2a7b-4e4d-ac23-705689c5beff",
        "text": "NOT EXISTS"
      },
      {
        "id": "25d72ffc-9376-4110-a29d-149876a1689e",
        "text": "Бір ішкі сұраныстың ішінде тағы бір ішкі сұраныстың орналасуы"
      },
      {
        "id": "726da572-2841-4a93-be9a-1e4320cb7065",
        "text": "Бір сұраныс ішіндегі бірнеше параллель сұраныстар"
      },
      {
        "id": "d371a7c5-8c55-44bd-846f-3227af3b5034",
        "text": "Correlated Subquery (Байланысқан сұраныс)"
      }
    ],
    "correctOptionIds": [
      "89e64646-0608-4029-9991-14c323226b88"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "40f12bae-f6ee-4e0f-af5d-bf7624770f8b",
    "subjectId": "db",
    "text": "Байланысқан ішкі сұранысты (correlated subquery) жылдамдатудың ең тиімді жолы қандай?",
    "options": [
      {
        "id": "f81f1653-bad6-4d25-9311-86444ef30600",
        "text": "Сәйкес бағандарға индекстер (indexes) құру немесе оны JOIN-мен алмастыру"
      },
      {
        "id": "c235a6d6-2157-4619-b2e5-a4bde40ab929",
        "text": "Кестені толық жою"
      },
      {
        "id": "cd43e6fb-15e0-473a-8a74-4599bebc5a75",
        "text": "Ішкі сұранысты алып тастау"
      },
      {
        "id": "c493ff21-0c0c-47d1-87d0-277db3b76451",
        "text": "Оны тек DDL деңгейінде орындау"
      },
      {
        "id": "b5b65fae-2f3e-4c7e-bff1-682169a72487",
        "text": "Ең болмағанда біреуімен орындалса true қайтарады"
      },
      {
        "id": "d5e4c011-4bf7-4261-b512-31ff535d7097",
        "text": "Тек скалярлық емес сұраныстарда көрінеді"
      },
      {
        "id": "acb2f7cb-5497-4adc-9f0e-cd3b712adfe4",
        "text": "Орташа жалақы есептелмегендіктен"
      },
      {
        "id": "a8631a45-06bc-4853-a626-fa4ee71fb118",
        "text": "Кестеден тек бағанды өшіру"
      }
    ],
    "correctOptionIds": [
      "f81f1653-bad6-4d25-9311-86444ef30600"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "338d6c46-8a4c-4d49-92ed-ff48cbf89c00",
    "subjectId": "db",
    "text": "Сыртқы сұранысқа мүлдем тәуелсіз ішкі сұраныс орындалғанда неше рет есептеледі?",
    "options": [
      {
        "id": "d51b5423-19fd-4876-9299-3820eb83de2b",
        "text": "Тек 1 рет орындалып, оның нәтижесі сыртқы сұраныста біржола қолданылады"
      },
      {
        "id": "ea5668aa-2731-41aa-b734-bcad5a42f0b3",
        "text": "Сыртқы сұраныстың әрбір жолы үшін жеке-жеке"
      },
      {
        "id": "879868c0-5158-4607-9189-6d310cdb6661",
        "text": "Екі рет"
      },
      {
        "id": "fa0175d3-7d5f-4903-8cf0-9351509b8cb5",
        "text": "Жүктеме тым ауыр болғандықтан орындалмайды"
      },
      {
        "id": "eca7a443-8f3d-4c84-a159-2bc1121cbf8d",
        "text": "Тізімде тек NULL емес мәндер бар екенін білдіреді"
      },
      {
        "id": "73e1834d-0e94-4f64-b6a8-7d31f8dbe060",
        "text": "Ешқандай санатқа жатпайтын тауарларды табады"
      },
      {
        "id": "2fc7134f-b8e8-4198-b8e3-9e03b513440e",
        "text": "Тек бірінші жол қайтарылады"
      },
      {
        "id": "7f0654de-0ded-46d4-ac5c-1b109a9e0869",
        "text": "Көпмәнді сұраныс"
      }
    ],
    "correctOptionIds": [
      "d51b5423-19fd-4876-9299-3820eb83de2b"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "7ba6df60-95bf-4328-9993-a46965aaa0e9",
    "subjectId": "db",
    "text": "EXISTS операторы ішкі сұраныстан не қайтарғанда true болады?",
    "options": [
      {
        "id": "2140d8a0-2fe0-4c95-af5d-ef30f7c8ce7c",
        "text": "Ішкі сұраныс ең болмағанда бір жолды қайтарған кезде"
      },
      {
        "id": "43b5da0b-ec8f-4922-9461-761cc590d92f",
        "text": "Ішкі сұраныс бос нәтиже қайтарғанда"
      },
      {
        "id": "218ceeed-0c53-4c89-9a51-19bbdb520810",
        "text": "Ішкі сұраныста тек оң сандар болғанда"
      },
      {
        "id": "b575d818-739e-4301-b9b2-02e06ee0743f",
        "text": "NULL қайтарғанда"
      },
      {
        "id": "13d0d4dc-f3c1-4333-81e9-efd0b248f7ff",
        "text": "Бастапқы кілттерді автоматты түрде өзгерту үшін"
      },
      {
        "id": "b192c01b-11cf-4a3e-a304-4829f0702f1f",
        "text": "Иә, тек SELECT 1 жазылуы тиіс, әйтпесе қате шығады"
      },
      {
        "id": "2b04f894-d0e9-4e4c-9d29-9a94dd220169",
        "text": "ДҚБЖ-ның ішкі сұранысты жазық JOIN құрылымына автоматты түрде өзгерту процесі"
      },
      {
        "id": "e7a98f23-8c0a-44a8-b1b1-f3c67252534f",
        "text": "Тек оң жағында ғана орналасуы тиіс"
      }
    ],
    "correctOptionIds": [
      "2140d8a0-2fe0-4c95-af5d-ef30f7c8ce7c"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "365529ee-36cc-44e9-97b9-efd9075f143a",
    "subjectId": "db",
    "text": "Байланысқан ішкі сұраныс (Correlated Subquery) деген не?",
    "options": [
      {
        "id": "82160651-a18f-4519-977c-b2e41b3c23dc",
        "text": "Сыртқы сұраныстың әрбір жолына тәуелді және сыртқы кестенің бағандарын сілтеме ретінде қолданатын ішкі сұраныс"
      },
      {
        "id": "25b4b6da-6a21-4234-8f32-b283a850a32e",
        "text": "Ешқашан орындалмайтын сұраныс"
      },
      {
        "id": "a59388cc-ba5c-4ef6-ae12-43bb5f85836e",
        "text": "Тек DDL деңгейінде жұмыс істейтін сұраныс"
      },
      {
        "id": "9d29ddc7-7a83-4732-8d82-a93ecead75af",
        "text": "Тек бір мән қайтаратын жай ішкі сұраныс"
      },
      {
        "id": "36e4074c-465b-4ae2-abee-dc0e11e19cb7",
        "text": "> EXISTS"
      },
      {
        "id": "80487c75-d5d6-4745-9e0e-362043ad93f8",
        "text": "Егер 5-ші департаментте бірден көп қызметкер жұмыс істесе, скалярлық емес салыстыру қатесін береді"
      },
      {
        "id": "71ffe4db-a45c-4695-bfb8-50deccff9680",
        "text": "Дерекқордың файлдық өлшемін кішірейту"
      },
      {
        "id": "cc8288be-0617-4f38-834e-b09a8115fcc8",
        "text": "Байланысқан сұраныс"
      }
    ],
    "correctOptionIds": [
      "82160651-a18f-4519-977c-b2e41b3c23dc"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "df054e1e-99b1-41a8-975e-5df9083bc8d3",
    "subjectId": "db",
    "text": "SQL-де ішкі сұраныс бір ғана мәнді (жол мен баған қиылысын) қайтарса, ол қалай аталады?",
    "options": [
      {
        "id": "1cc0370d-431d-4f14-a362-4c286f1688db",
        "text": "Скалярлық ішкі сұраныс (Scalar Subquery)"
      },
      {
        "id": "481647ea-e654-42c6-8674-7fb64b6e5b00",
        "text": "Көпмәнді ішкі сұраныс"
      },
      {
        "id": "b56c60f2-1464-4fd9-9de8-1a4f79a57481",
        "text": "Байланысқан сұраныс"
      },
      {
        "id": "90c6698b-5e94-4c16-9862-217a16b2c6ff",
        "text": "Уақытша сұраныс"
      },
      {
        "id": "83c207cb-b231-4583-8a5e-5b7a6acb8527",
        "text": "Кестедегі индекс атауы"
      },
      {
        "id": "8bf6e2d8-389d-4776-9558-895a16eb84c8",
        "text": "EXISTS сұраныс нәтижесін жадыда кэштейді"
      },
      {
        "id": "0328a89b-7b1e-4efd-aa87-f08e856e9cdf",
        "text": "NULL"
      },
      {
        "id": "844b0116-f385-487c-a8ef-5a90479b2dfa",
        "text": "Кем дегенде бір қызметкері бар барлық департаменттерді"
      }
    ],
    "correctOptionIds": [
      "1cc0370d-431d-4f14-a362-4c286f1688db"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "c886d2fc-8030-4a4d-830b-106dc3dd0da8",
    "subjectId": "db",
    "text": "SQL-де IN операторы ішкі сұраныспен қолданылғанда не тексереді?",
    "options": [
      {
        "id": "8215a590-e334-4f64-a2a7-8889e0d3035e",
        "text": "Сыртқы сұраныс мәнінің ішкі сұраныстан қайтқан жиынтықтың (тізімнің) ішінде болуын"
      },
      {
        "id": "804a13d9-c9f4-43f7-91cc-12dfdab4b017",
        "text": "Мәндердің бір-бірінен үлкен болуын"
      },
      {
        "id": "da981351-c4ff-4158-859b-d41a08b27212",
        "text": "Ішкі сұраныстың бос болуын"
      },
      {
        "id": "3ba9d1af-eb55-473c-9397-dbb5063877bf",
        "text": "Жолдар санының теңдігін"
      },
      {
        "id": "d7d84fe3-54b6-488d-a992-79a0c5c0d6a1",
        "text": "Ішкі сұраныс және сыртқы сұраныс"
      },
      {
        "id": "1789b4ad-a041-45e2-81c5-d661491fbdc5",
        "text": "Дерекқордың файлдық өлшемін кішірейту"
      },
      {
        "id": "40a85e09-78d3-45fb-af61-125813538cf3",
        "text": "Тек сандық бағандар болса ғана міндетті"
      },
      {
        "id": "b72ff965-d7bb-470a-b7de-a5d75af57004",
        "text": "Көпмәнді сұраныс"
      }
    ],
    "correctOptionIds": [
      "8215a590-e334-4f64-a2a7-8889e0d3035e"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "5823fa87-b7d2-4fbf-9697-a2fdf6154bbd",
    "subjectId": "db",
    "text": "ALL операторы (мысалы, > ALL) ішкі сұраныстан оралған тізім бос болған жағдайда қандай мән қайтарады?",
    "options": [
      {
        "id": "88779e8b-afb0-48f3-906c-28d57f24c70e",
        "text": "Әрқашан TRUE қайтарады"
      },
      {
        "id": "c91a27dc-39ca-49b5-8631-dd8aea1a1f45",
        "text": "Әрқашан FALSE қайтарады"
      },
      {
        "id": "2acacd3f-55bf-4774-9233-6ec5b4d38b88",
        "text": "NULL қайтарады"
      },
      {
        "id": "e07fa91d-5af5-48ce-8105-bc25b696770e",
        "text": "Қателік (Error) шығарады"
      },
      {
        "id": "77b27a4f-ae60-4194-959e-0759ca862524",
        "text": "Бастапқы кілті бар индексті"
      },
      {
        "id": "354bf59d-66af-41c8-b8b9-0a38525192e8",
        "text": "Ішкі сұраныс ең болмағанда бір жолды қайтарған кезде"
      },
      {
        "id": "b57f3c16-5c5b-48a1-b092-08e3619dc091",
        "text": "Сыртқы кілттерді өшіретін команданы"
      },
      {
        "id": "e444290c-b3cb-4404-a282-b51bf40ad98a",
        "text": "DROP сұраныстарында"
      }
    ],
    "correctOptionIds": [
      "88779e8b-afb0-48f3-906c-28d57f24c70e"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "7839ffd8-77db-4418-a241-02f49bbb29f6",
    "subjectId": "db",
    "text": "Ішкі сұранысты SELECT бағандарының ішінде қолданғанда қандай шектеу қойылады?",
    "options": [
      {
        "id": "370f3537-481b-450b-a4da-4eb8e9de061f",
        "text": "Ішкі сұраныс тек бір жол және бір бағаннан тұратын скалярлық мән қайтаруы тиіс"
      },
      {
        "id": "b43c5a72-fe5d-48d8-812f-500719ee4926",
        "text": "Ішкі сұраныста WHERE шарттары болмауы керек"
      },
      {
        "id": "d73d3ef4-2b00-4a75-aa4a-5bdd019357f6",
        "text": "Ол тек сандық мән қайтаруы тиіс"
      },
      {
        "id": "9bd915f6-5b17-49aa-b160-6684b5b2bf6a",
        "text": "Ешқандай шектеу қойылмайды"
      },
      {
        "id": "00feedca-c657-4bfe-a421-313062c1f5ce",
        "text": "Жоқ, сыртқы сұранысқа ішкі сұраныстың бағандары тікелей көрінбейді"
      },
      {
        "id": "924be9e2-150f-4bd4-bb23-f3662f62470d",
        "text": "Қате шығарады, себебі скалярлық сұранысты SELECT-те қолдануға болмайды"
      },
      {
        "id": "7fcb19d2-efd1-45ac-9f3c-59ea74ff1e5a",
        "text": "Тек оң жағында ғана орналасуы тиіс"
      },
      {
        "id": "a22a4a59-ad62-44eb-a9de-9446ce33016f",
        "text": "Қызметкері жоқ департаменттерді"
      }
    ],
    "correctOptionIds": [
      "370f3537-481b-450b-a4da-4eb8e9de061f"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "c552d7b8-26ca-4392-b1e2-8513327c8c23",
    "subjectId": "db",
    "text": "FROM нұсқауының ішінде жазылған ішкі сұраныс (Subquery in FROM) SQL-де қалай аталады?",
    "options": [
      {
        "id": "cdd1cf68-994a-4070-a210-02c96ea9a95d",
        "text": "Туынды кесте (Derived Table) немесе Inline View"
      },
      {
        "id": "0c728d86-356d-40ec-bba4-ed49bbe6586f",
        "text": "Байланысқан сұраныс"
      },
      {
        "id": "59fcde8b-1153-4efc-b669-da2dd07ed060",
        "text": "Уақытша кесте"
      },
      {
        "id": "b48591d8-c32e-4fdf-9c1c-97fe169448d7",
        "text": "Жүйелік каталог"
      },
      {
        "id": "bc37ef5c-7639-4875-b4ea-ead096cb1592",
        "text": "O(N + M)"
      },
      {
        "id": "983703e3-651d-4806-b3ee-207928c1ff8b",
        "text": "SELECT сұраныстарында"
      },
      {
        "id": "b8a58f46-d236-452e-a98b-90dea2e6c462",
        "text": "Кестелік сұраныс"
      },
      {
        "id": "57752a22-5f63-403e-90bb-fe8f30a925d4",
        "text": "Тек UPDATE сұраныстарында ғана рұқсат етіледі"
      }
    ],
    "correctOptionIds": [
      "cdd1cf68-994a-4070-a210-02c96ea9a95d"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "61ecf042-db94-4491-87a3-5c57f591dd02",
    "subjectId": "db",
    "text": "ANY операторы (мысалы, = ANY) қай оператордың баламасы болып табылады?",
    "options": [
      {
        "id": "3e77551b-2fa6-4ecd-b1ab-6d751172335a",
        "text": "IN операторының"
      },
      {
        "id": "d1a40696-a7de-4d2e-94b6-f0f78d439a8b",
        "text": "NOT IN операторының"
      },
      {
        "id": "8f98eca9-9315-4676-9820-0477709f5d7f",
        "text": "EXISTS операторының"
      },
      {
        "id": "9babb05b-593f-4259-9601-081e217a3244",
        "text": "BETWEEN операторының"
      },
      {
        "id": "7a3211ca-b44b-4f56-bf9c-ce9701adf4e5",
        "text": "> ANY"
      },
      {
        "id": "457aff06-2403-4c8a-94d2-bd5b45b1cfb7",
        "text": "Бағанның деректер типін өзгерту керек"
      },
      {
        "id": "22fabc24-3e74-404c-a0ca-3fae08f1eb6a",
        "text": "Сыртқы сұраныстың әрбір жолы үшін жеке-жеке"
      },
      {
        "id": "83a0768a-6950-460c-ae8c-cf8e4a768f59",
        "text": "Қате шығарады, себебі скалярлық сұранысты SELECT-те қолдануға болмайды"
      }
    ],
    "correctOptionIds": [
      "3e77551b-2fa6-4ecd-b1ab-6d751172335a"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "1ca5833f-93c8-473a-bf11-fb0e008ff1ee",
    "subjectId": "db",
    "text": "SQL-де NOT EXISTS операторы қашан TRUE қайтарады?",
    "options": [
      {
        "id": "d469de4e-1af9-47c6-a020-56e3c983e8ab",
        "text": "Ішкі сұраныс орындалғанда бірде-бір жол табылмаса (бос жиын болса)"
      },
      {
        "id": "fa14d249-fdec-4bf6-91f6-bb168d03d725",
        "text": "Ішкі сұраныста тек NULL мәндер болса"
      },
      {
        "id": "4455a372-b07c-4f59-8f52-9429298cd5f3",
        "text": "Сыртқы сұраныс қатемен аяқталса"
      },
      {
        "id": "e2673190-68ee-4267-8349-fbd73e83c985",
        "text": "Ішкі сұраныстан кем дегенде бір жол қайтарылса"
      },
      {
        "id": "9fef5ff9-c5d8-4ea0-8dd7-df656e5b5c9d",
        "text": "Қателік туындамауы үшін кестелердің бірін жою керек"
      },
      {
        "id": "d8dcec0a-4f85-4c5a-9235-1b0063053903",
        "text": "Деректерді жылдам өшіру үшін"
      },
      {
        "id": "a093e179-5b3e-4871-ad45-f9ba182d522f",
        "text": "Тек скалярлық емес сұраныстарға ғана рұқсат етіледі"
      },
      {
        "id": "3b2c0e2c-b385-4369-ab13-d28b71efd4a7",
        "text": "Дерекқордың резервтік көшірмесін өшіру"
      }
    ],
    "correctOptionIds": [
      "d469de4e-1af9-47c6-a020-56e3c983e8ab"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "e832b0de-5645-4f85-b118-7cc907d369ef",
    "subjectId": "db",
    "text": "CTE (Common Table Expressions) дегеніміз не және ол ішкі сұраныстарға қандай балама болып табылады?",
    "options": [
      {
        "id": "3c436988-466e-4942-b865-d9af623e864b",
        "text": "WITH кілтсөзі арқылы анықталатын, сұраныс ішіндегі уақытша нәтижелік жиын"
      },
      {
        "id": "dd8cf42f-b78c-40e2-808f-05900e59a29f",
        "text": "Дерекқордың физикалық индексі"
      },
      {
        "id": "b134afbc-5ed7-488f-8a94-09ec2ee4f8b8",
        "text": "Серверде сақталатын процедура түрі"
      },
      {
        "id": "ac1584fa-cea9-48ab-b93f-47676e1b75ba",
        "text": "Кесте арасындағы сілтемелік шектеу"
      },
      {
        "id": "acc5fb34-2ece-4e34-8949-511b2e5f83f6",
        "text": "FALSE"
      },
      {
        "id": "b0d8a6a8-6e7e-4356-abab-0528ef9b26b6",
        "text": "Тізімдегі ешбір мәнге тең емес екенін тексереді"
      },
      {
        "id": "cdfea97b-7ff4-4747-a61e-1eb62aa8d757",
        "text": "Ең көп қызметкері бар департаментті"
      },
      {
        "id": "65d693e2-c0c2-4635-8923-13c4f1078cd3",
        "text": "Ішкі сұраныстардың қателікке ұшырап тоқтауы"
      }
    ],
    "correctOptionIds": [
      "3c436988-466e-4942-b865-d9af623e864b"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "61963ecb-56a6-49d3-805d-fe76fac557ed",
    "subjectId": "db",
    "text": "CTE (Common Table Expression) құру үшін қандай кілттік сөз қолданылады?",
    "options": [
      {
        "id": "5d43912e-51bb-47a4-9fb7-5107dba57bb0",
        "text": "WITH"
      },
      {
        "id": "f4b0d0a3-004f-48c6-a878-008df189e0f4",
        "text": "USING"
      },
      {
        "id": "7008f162-8517-46f3-baf9-92b9a9037815",
        "text": "CTE"
      },
      {
        "id": "38bed107-14b4-4c78-aa86-0a226cda3b36",
        "text": "DECLARE"
      },
      {
        "id": "ef7e87c5-fb73-4fb4-bb0a-7a0c14b915dd",
        "text": "Студенттерді балдары бойынша сұрыптайды"
      },
      {
        "id": "99ff8d71-ee9c-40d7-945e-b61f5ec2b585",
        "text": "Ішкі сұраныстан кем дегенде бір жол қайтарылса"
      },
      {
        "id": "dd7ddedb-f060-4049-88a9-6053b196b284",
        "text": "Кортеждік сұраныс"
      },
      {
        "id": "78f95f34-b3c5-45fa-8ee6-cef15b6b34fc",
        "text": "Жүктеме тым ауыр болғандықтан орындалмайды"
      }
    ],
    "correctOptionIds": [
      "5d43912e-51bb-47a4-9fb7-5107dba57bb0"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "5bd73d7f-fa61-4ed6-a300-93332fb49b8f",
    "subjectId": "db",
    "text": "Рекурсивті CTE-ні (Recursive CTE) құру үшін қандай қосымша кілтсөз қолданылады?",
    "options": [
      {
        "id": "ce0b1f59-a7cf-4cb5-b4a6-b802378cb24e",
        "text": "RECURSIVE"
      },
      {
        "id": "97fb2acd-1728-4339-bc49-766a02a54323",
        "text": "LOOP"
      },
      {
        "id": "bf491760-852d-4728-8158-8f83d2ce897a",
        "text": "REPEAT"
      },
      {
        "id": "ccdfffc3-ba16-4045-aa72-9c3a9587ba8e",
        "text": "ITERATE"
      },
      {
        "id": "df6a69f1-8c3f-4f3c-9de9-78523f94de43",
        "text": "Тек FROM сөйлемінде"
      },
      {
        "id": "bfc7f2db-282c-4c52-a17c-1b6f831b87d6",
        "text": "UNKNOWN мәнін қайтарады"
      },
      {
        "id": "77caaec1-d1b9-4b24-bd38-fed6e056699b",
        "text": "Ішкі сұраныста ешқандай WHERE шарты болмауы тиіс"
      },
      {
        "id": "ec0ef928-c886-4401-95ac-11ae10c8f110",
        "text": "Декорреляция немесе Subquery Unnesting"
      }
    ],
    "correctOptionIds": [
      "ce0b1f59-a7cf-4cb5-b4a6-b802378cb24e"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "99664340-d859-4ca8-af98-0b69d2e520f3",
    "subjectId": "db",
    "text": "Бірнеше рет қайталанатын күрделі ішкі сұраныстарды оңайлату және оқылуын жақсарту үшін қайсысын қолданған дұрыс?",
    "options": [
      {
        "id": "8edc50e2-df9f-4dbf-ac33-70d6c43dc0e2",
        "text": "CTE (Common Table Expression)"
      },
      {
        "id": "ef11e0e8-054f-4ebb-b650-82200cc09ff7",
        "text": "Derived Table (туынды кесте)"
      },
      {
        "id": "ad5a07c4-a10f-43d0-90d7-d15d722dd0b3",
        "text": "Correlated Subquery (байланысқан сұраныс)"
      },
      {
        "id": "54af79d7-efa4-4373-8879-9fe9c9a22db3",
        "text": "NATURAL JOIN"
      },
      {
        "id": "fcb50d16-ca5f-4ed5-984e-aa1a2d5190bc",
        "text": "Тек WHERE сөйлемінде"
      },
      {
        "id": "de32a3d1-934a-4bdf-8333-0960c58e8052",
        "text": "IT департаментін жабады"
      },
      {
        "id": "38e37f2e-9842-414c-8aed-3b24b5d7388f",
        "text": "SELECT сұраныстарында"
      },
      {
        "id": "eabadf5f-cbdd-4600-bb40-74367c5703e3",
        "text": "Бір сұраныс ішіндегі бірнеше параллель сұраныстар"
      }
    ],
    "correctOptionIds": [
      "8edc50e2-df9f-4dbf-ac33-70d6c43dc0e2"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "43553da2-602f-411c-aa1f-fe4fe482ea80",
    "subjectId": "db",
    "text": "CTE мен Derived Table (туынды кесте) арасындағы басты айырмашылық қандай?",
    "options": [
      {
        "id": "ef3dff9e-1462-4fb1-8c57-3980bbaedfb8",
        "text": "CTE-ні бір сұраныс ішінде бірнеше рет сілтеме жасап қолдануға болады, ал Derived Table тек анықталған FROM сөйлемінде ғана қолжетімді"
      },
      {
        "id": "774cf975-fb53-4e1d-8dd8-9cd4b72dc128",
        "text": "Derived Table өнімділігі әрқашан екі есе жоғары болады"
      },
      {
        "id": "42a7fa6f-4645-4e5d-874c-7438d4835b21",
        "text": "CTE-де сұрыптау жасауға болмайды"
      },
      {
        "id": "4437bfb7-5ab2-49e7-9e30-0e90ee0c2784",
        "text": "Ешқандай айырмашылығы жоқ"
      },
      {
        "id": "a1f25fe0-2a2b-454d-9868-c150c039cca0",
        "text": "Екі рет"
      },
      {
        "id": "1cbc973a-a7e3-4dfe-a2a1-df6d0af7a8d1",
        "text": "REPEAT"
      },
      {
        "id": "2fc1e1a5-8b25-4173-bf09-3fab6d20a30b",
        "text": "UNKNOWN"
      },
      {
        "id": "dd491109-0f5e-4dce-b823-6a13215681b1",
        "text": "FALSE береді, себебі мәні NULL"
      }
    ],
    "correctOptionIds": [
      "ef3dff9e-1462-4fb1-8c57-3980bbaedfb8"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "1db25278-c749-4728-b039-514519e1258f",
    "subjectId": "db",
    "text": "SQL-де \"Inline View\" деп жиі нені атайды?",
    "options": [
      {
        "id": "b17cd744-b937-42aa-be1f-a94595b0ac80",
        "text": "FROM сөйлеміндегі ішкі сұранысты (Derived Table)"
      },
      {
        "id": "5a6822e6-d024-455c-a95a-f2c8d528d23f",
        "text": "Дерекқордағы тұрақты көріністі (View)"
      },
      {
        "id": "d54beffc-cb10-40ce-bd37-e0eb00d00219",
        "text": "Бастапқы кілті бар индексті"
      },
      {
        "id": "59287653-ea3d-406e-afd8-9d920aa4c5ae",
        "text": "Скалярлық ішкі сұранысты"
      },
      {
        "id": "ef3504d4-d620-4a4b-b5b6-a72439165759",
        "text": "TRUE береді, өйткені жолдың өзі бар (бос жиын емес)"
      },
      {
        "id": "f8894dd4-f551-4cc1-b282-1fdb0206e691",
        "text": "FALSE береді, себебі мәні NULL"
      },
      {
        "id": "82994b0c-d41d-487a-91f0-cbddfe2bc323",
        "text": "Иә, міндетті, әйтпесе көптеген ДҚБЖ-да синтаксистік қате туындайды"
      },
      {
        "id": "85159f5d-3656-42d6-839b-6051e24c4539",
        "text": "Тек бағандардың құрылымы қайтарылады"
      }
    ],
    "correctOptionIds": [
      "b17cd744-b937-42aa-be1f-a94595b0ac80"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "d6cc0342-b791-481c-9cbe-66e75ee7347f",
    "subjectId": "db",
    "text": "Ішкі сұраныс пен JOIN-ның өнімділігін салыстырғанда қайсысы көбіне тиімдірек орындалады?",
    "options": [
      {
        "id": "5217bb0d-b441-496d-9398-9f95babc2e7b",
        "text": "JOIN тиімдірек, себебі ДҚБЖ оны оңтайлырақ жоспарлайды"
      },
      {
        "id": "70c46ad4-742f-4a8b-a31a-06fbe7129f1f",
        "text": "Ішкі сұраныс әрқашан жылдамырақ"
      },
      {
        "id": "adbbd2b9-7a9d-4258-abe5-d71d4c2a62dd",
        "text": "Екеуінің орындалу жылдамдығы бірдей"
      },
      {
        "id": "57230f55-00f2-453f-93e7-c81a64643464",
        "text": "Тек байланысқан ішкі сұраныстар ғана жылдамырақ"
      },
      {
        "id": "3ec8f92b-5f1e-481d-87e1-cd6491d1826c",
        "text": "Иә, бұл жағдайда жолдардың белгілі бір бөлігін (мысалы, ең үлкен 5 мәнді) алу үшін қажет"
      },
      {
        "id": "ba3d98ac-4b9e-49f0-b9bd-deb1a92b3417",
        "text": "Дерекқордың файлдық өлшемін кішірейту"
      },
      {
        "id": "cddb9c5c-3edb-456e-9ee1-09cbc7c8877f",
        "text": "Әрқашан TRUE қайтарады"
      },
      {
        "id": "76fb65a3-e2ba-4c3b-982c-7b16ff4be4bc",
        "text": "Оған индекстер әсер етпейтіндіктен"
      }
    ],
    "correctOptionIds": [
      "5217bb0d-b441-496d-9398-9f95babc2e7b"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "1beb10e6-363e-4616-a756-c23ec75dd738",
    "subjectId": "db",
    "text": "Ішкі сұранысты JOIN-мен алмастыру процесі сұранысты оңтайландыруда қалай аталады?",
    "options": [
      {
        "id": "dc2b938b-31e6-4c7f-9afd-e5db4f5be5cc",
        "text": "Декорреляция немесе Subquery Unnesting"
      },
      {
        "id": "c0a7879c-4cd2-48ca-aad1-8e69458d8ced",
        "text": "Рекурсия"
      },
      {
        "id": "459efab6-1e2e-46d6-a6e4-6d08a6f02aeb",
        "text": "Нормализация"
      },
      {
        "id": "b435066b-ba39-4f77-a5d0-d5b09be17fed",
        "text": "Транзакциялау"
      },
      {
        "id": "b19185f7-2d36-40f2-ae58-9488202d5cd7",
        "text": "Уақытша кесте"
      },
      {
        "id": "f3396eb0-f7b6-42fa-888c-d1ba646ad771",
        "text": "Тек бастапқы кілттер ғана қайтарылады"
      },
      {
        "id": "423d9c49-40a6-4fda-a9d7-c4960859bd2a",
        "text": "NATURAL JOIN"
      },
      {
        "id": "c4cd9e81-de00-4337-83b5-3f87b3223be8",
        "text": "Жоқ, бір сұраныста тек бір ғана CTE анықтауға рұқсат етілген"
      }
    ],
    "correctOptionIds": [
      "dc2b938b-31e6-4c7f-9afd-e5db4f5be5cc"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "bcba1695-e0e9-4969-bc4e-10d326a441b4",
    "subjectId": "db",
    "text": "Скалярлық ішкі сұраныс (Scalar Subquery) сыртқы шартқа сәйкес бірде-бір жол таппаса не қайтарады?",
    "options": [
      {
        "id": "a878c306-7293-47cb-bc0f-b4a32ee51e15",
        "text": "NULL"
      },
      {
        "id": "c64c7dfe-452d-4fe5-a885-6c0b80caecb6",
        "text": "Нөл (0)"
      },
      {
        "id": "78155e36-7d45-43aa-bcbd-517de1950b1c",
        "text": "Қате (Error)"
      },
      {
        "id": "08402290-7386-47bc-b449-55baf98d6527",
        "text": "Бос мәтін"
      },
      {
        "id": "e19cc507-a531-48c6-a5d4-34af6bf6e3f3",
        "text": "Кестенің құрылымын өзгерту үшін"
      },
      {
        "id": "5001b9de-4f58-4a5f-af2c-3b88f928cb09",
        "text": "TRUE қайтарады, барлық жолдар сәйкес келеді"
      },
      {
        "id": "70275acc-3528-4265-8622-3055a33ccef2",
        "text": "ДҚБЖ оларды автоматты түрде нөмірлейді"
      },
      {
        "id": "adb92854-563d-40b5-8027-148a5d36bbd7",
        "text": "Тек бірінші баған ғана сақталады"
      }
    ],
    "correctOptionIds": [
      "a878c306-7293-47cb-bc0f-b4a32ee51e15"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "ca655f6b-7cb5-4591-8942-0097243d2973",
    "subjectId": "db",
    "text": "SELECT бағанында қолданылатын ішкі сұраныс бірнеше жол қайтарса, нәтижесі қандай болады?",
    "options": [
      {
        "id": "39fd0728-2ff3-497b-9612-10ca8a3b8b5b",
        "text": "Қате шығады (Subquery returns more than 1 row)"
      },
      {
        "id": "90a95410-6593-472b-b616-2d3100c17f51",
        "text": "Тек бірінші жол ғана көрсетіледі"
      },
      {
        "id": "ebfe1c90-87b4-4cb8-828e-ab108c2416d7",
        "text": "Барлық жолдар үтір арқылы біріктіріледі"
      },
      {
        "id": "33502bd9-afff-42c3-80b3-0746675f15f9",
        "text": "NULL мәні қайтарылады"
      },
      {
        "id": "d74bfb11-6317-4c88-93d5-706eae0d8423",
        "text": "Тек бастапқы кілттер ғана қайтарылады"
      },
      {
        "id": "f8a15ee8-95eb-457b-9d79-288457cfae2b",
        "text": "Ішкі сұраныста WHERE шарттары болмауы керек"
      },
      {
        "id": "8d01e64f-3bbc-4203-a28b-9215dd49f69f",
        "text": "Ішкі сұранысты тиімді JOIN операциясына айналдыруға тырысады (query rewriting)"
      },
      {
        "id": "fa9f3ab5-4d66-463b-a7ca-e221faebe9da",
        "text": "Тек сандық бағандар болса ғана міндетті"
      }
    ],
    "correctOptionIds": [
      "39fd0728-2ff3-497b-9612-10ca8a3b8b5b"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "47871707-ce17-42f8-afd6-4c959d020251",
    "subjectId": "db",
    "text": "EXISTS операторы неліктен IN операторына қарағанда байланысқан сұраныстарда тиімдірек болуы мүмкін?",
    "options": [
      {
        "id": "1ccc86eb-bccb-490a-b24f-360109459eaa",
        "text": "EXISTS алғашқы сәйкестікті тапқан бойда іздеуді тоқтатады (short-circuit), ал IN толық тізімді тексереді"
      },
      {
        "id": "483b0a88-2bf9-45d2-97c4-605d15c582c2",
        "text": "EXISTS индекстерді қолданбайды"
      },
      {
        "id": "762ec7a9-b93c-4c2b-859f-02782550b8a7",
        "text": "IN операторы тек сандармен жұмыс істейді"
      },
      {
        "id": "69495e9a-446a-4ba5-bb35-863ca8af2ada",
        "text": "EXISTS сұраныс нәтижесін жадыда кэштейді"
      },
      {
        "id": "71dc0cae-7d9c-4cb6-bd63-0b5e81f98b2c",
        "text": "IT департаментіндегі қызметкерлердің жалақысын 1.1 теңгеге өсіреді"
      },
      {
        "id": "c6457450-f3c2-4e97-a2de-336a38ff27c1",
        "text": "DECLARE"
      },
      {
        "id": "c4cf7130-ce33-4fe0-ae43-b8d071b06aa9",
        "text": "Хэш-кесте (Hash Table) немесе индекс арқылы іздеуге оңтайландырады"
      },
      {
        "id": "fd90a605-ba92-4ab7-a2ba-b3520ff3cede",
        "text": "Тек NULL мәндер болса орындалады"
      }
    ],
    "correctOptionIds": [
      "1ccc86eb-bccb-490a-b24f-360109459eaa"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "96fb40b9-bfe5-48c5-bdc5-0bdb80c7081b",
    "subjectId": "db",
    "text": "EXISTS операторымен жұмыс істегенде ішкі сұраныстың SELECT тізімінде (мысалы, SELECT * немесе SELECT 1) не жазылғаны маңызды ма?",
    "options": [
      {
        "id": "b5be871a-3c26-4743-98cb-4402e3e6ca25",
        "text": "Жоқ, маңызды емес, себебі тек жолдың бар-жоғы ғана тексеріледі"
      },
      {
        "id": "a4d2f806-fd96-439e-96ec-8b4735884a2f",
        "text": "Иә, тек SELECT 1 жазылуы тиіс, әйтпесе қате шығады"
      },
      {
        "id": "73861694-3678-499e-84ce-e6a2ff66fcfa",
        "text": "Иә, тек нақты бағандардың аттары жазылуы тиіс"
      },
      {
        "id": "70735b47-8799-4398-85d0-fe48a1a38e9f",
        "text": "Иә, тек SELECT * жазылуы тиіс"
      },
      {
        "id": "c4a00b99-f674-45b8-803e-33708a78eb23",
        "text": "Derived Table"
      },
      {
        "id": "a143ac69-e24b-4965-9ead-b5c0cb8441d0",
        "text": "Әр студенттің жеке ең жоғары балын табады"
      },
      {
        "id": "d9d72d3a-00a8-4b18-a54c-66051fba49cf",
        "text": "Иә, олар бір-бірінен кейін үтір арқылы жазыла береді"
      },
      {
        "id": "01955e36-20df-422e-b771-5bf88a4961ff",
        "text": "Хэш-кесте (Hash Table) немесе индекс арқылы іздеуге оңтайландырады"
      }
    ],
    "correctOptionIds": [
      "b5be871a-3c26-4743-98cb-4402e3e6ca25"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "14e447d0-3513-424b-883b-c673ecfcd84d",
    "subjectId": "db",
    "text": "SQL-де \"Semi-Join\" деп нені атайды?",
    "options": [
      {
        "id": "29615477-fcdf-447f-8b0c-e558bbafe8f1",
        "text": "Сыртқы кестенің Тек ішкі кестеде сәйкестігі бар жолдарын ғана қайтаратын операция (EXISTS немесе IN арқылы жасалады)"
      },
      {
        "id": "97f0a2be-7ee9-4477-bac7-3cc7cb6586e4",
        "text": "Екі кестенің жартылай бірігуін"
      },
      {
        "id": "deaed62b-31af-4656-91ec-84f1e27980ab",
        "text": "Тек оң жақтағы кестенің сәйкес емес жолдарын қайтаруды"
      },
      {
        "id": "798d8a7b-206f-4ace-8b81-27d99f2b29fa",
        "text": "Кестенің өз-өзіне қосылуын"
      },
      {
        "id": "692fa21f-f6df-41f7-955c-7e6d7fa184bb",
        "text": "Жүйелік каталог"
      },
      {
        "id": "e4bede66-a5dd-4f84-b27c-cdbf041a037b",
        "text": "Басқа кестедегі мәндерге сүйене отырып баған мәндерін жаңарту үшін"
      },
      {
        "id": "09dd609c-547b-40f4-8f48-712a6c2e3995",
        "text": "ANY"
      },
      {
        "id": "c002d4f9-37b9-40f3-8da9-7e91fb11692a",
        "text": "Тек сандар үшін рұқсат етіледі"
      }
    ],
    "correctOptionIds": [
      "29615477-fcdf-447f-8b0c-e558bbafe8f1"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "9dc89758-7c1a-477e-82f8-8f73ae0e9f64",
    "subjectId": "db",
    "text": "SQL-де \"Anti-Join\" деп нені атайды?",
    "options": [
      {
        "id": "992c0b56-6e2c-4b02-acb6-092e954f4826",
        "text": "Сыртқы кестенің ішкі кестеде сәйкестігі ЖОҚ жолдарын ғана қайтаратын операция (NOT EXISTS немесе NOT IN арқылы жасалады)"
      },
      {
        "id": "0db77962-a040-4870-8899-5eb3cb1e7e58",
        "text": "Екі кестенің толық бірікпеуін"
      },
      {
        "id": "168c8c90-6ad1-4ef5-a8df-f16688955c65",
        "text": "Сыртқы кілттерді өшіретін команданы"
      },
      {
        "id": "a78caff1-e486-4f9d-86ea-25a335738f5d",
        "text": "Транзакциядан бас тартуды"
      },
      {
        "id": "98b19af9-854e-4ef1-8df6-717ecbd73ed2",
        "text": "Көпмәнді сұраныс"
      },
      {
        "id": "71aed65f-2393-49e4-bbe9-82189775c8a2",
        "text": "Кестеден тек бағанды өшіру"
      },
      {
        "id": "d566e441-5831-40d2-ae47-3c37df79832d",
        "text": "Анкерлік мүше (Anchor member) және рекурсивтік мүше (Recursive member)"
      },
      {
        "id": "bba16e9c-12d1-4797-a8c3-6cb7d507968b",
        "text": "Басқа сервердегі кестені оқитын сұраныс"
      }
    ],
    "correctOptionIds": [
      "992c0b56-6e2c-4b02-acb6-092e954f4826"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "dd5af803-2640-4c16-a91b-60894b6e361b",
    "subjectId": "db",
    "text": "NOT EXISTS операторы мен NOT IN операторының NULL мәндері бар бағандардағы айырмашылығы қандай?",
    "options": [
      {
        "id": "d1ccc667-eba3-4b44-b67d-42a65463293f",
        "text": "NOT IN ішкі сұраныстан NULL қайтса ешқандай жол таппайды, ал NOT EXISTS NULL мәнін қарапайым жол ретінде қарастырып, дұрыс жұмыс істей береді"
      },
      {
        "id": "c927fb8b-9300-4432-881f-31a4853bbf2a",
        "text": "NOT EXISTS NULL-ді қабылдамай қате тудырады"
      },
      {
        "id": "acb06b00-878e-4ae4-a2f6-aa6ee40f6a99",
        "text": "NOT IN өнімділігі NULL мәндері бар кестелерде жоғарырақ"
      },
      {
        "id": "e28a2af2-5840-45bd-bac9-18da0fddfdee",
        "text": "Ешқандай айырмашылығы жоқ"
      },
      {
        "id": "a79404d4-f3de-4851-b403-2101fd8db566",
        "text": "O(1)"
      },
      {
        "id": "9ba3167c-c866-4455-af3e-8cd7bc6ff0ee",
        "text": "Ішкі сұраныстардың қателікке ұшырап тоқтауы"
      },
      {
        "id": "43b76894-94cf-4661-85ae-05f85fa67244",
        "text": "Барлық қызметкерлердің жалақысын IT департаментінің бюджетіне теңейді"
      },
      {
        "id": "553ee464-99bb-4970-8874-d9df5719fe12",
        "text": "Әр студенттің жеке ең жоғары балын табады"
      }
    ],
    "correctOptionIds": [
      "d1ccc667-eba3-4b44-b67d-42a65463293f"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "a714481e-041c-487d-bd0e-2e9f2f3164a8",
    "subjectId": "db",
    "text": "HAVING сөйлемінің ішінде ішкі сұранысты қолдануға болады ма?",
    "options": [
      {
        "id": "de4e55fb-e105-42d0-b76f-97525a1226ce",
        "text": "Иә, топтық мәндерді басқа жиынтық мәндермен салыстыру үшін"
      },
      {
        "id": "7271180a-50d6-4090-a4cd-2e9dae6b23fa",
        "text": "Жоқ, HAVING ішінде тек қарапайым шарттар ғана жазылады"
      },
      {
        "id": "6134cc0f-195c-4daa-8574-85b9aee7ff03",
        "text": "Тек скалярлық емес сұраныстарға ғана рұқсат етіледі"
      },
      {
        "id": "cb51a69c-f99a-412c-b236-0dc9c295b660",
        "text": "Тек UPDATE сұраныстарында ғана рұқсат етіледі"
      },
      {
        "id": "f9862ab6-1cdb-4c86-b373-166960665873",
        "text": "Иә, тек SELECT * жазылуы тиіс"
      },
      {
        "id": "b10936f5-e53c-4c40-abfe-e063c211d341",
        "text": "Тек бірінші жол қайтарылады"
      },
      {
        "id": "8327a92e-c225-4a53-be78-091f139043de",
        "text": "Рекурсивті сұраныс"
      },
      {
        "id": "a44be798-0014-476f-b283-0662d57c8959",
        "text": "NOT IN операторының"
      }
    ],
    "correctOptionIds": [
      "de4e55fb-e105-42d0-b76f-97525a1226ce"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "2e2b74ff-5754-4d75-a02a-04ab1e25e3dc",
    "subjectId": "db",
    "text": "UPDATE командасында ішкі сұранысты қолдану мақсаты не?",
    "options": [
      {
        "id": "c94f6485-7616-46fb-a426-67f11e606408",
        "text": "Басқа кестедегі мәндерге сүйене отырып баған мәндерін жаңарту үшін"
      },
      {
        "id": "ad1b18c3-af55-4462-b257-f7f07ce877eb",
        "text": "Кестенің құрылымын өзгерту үшін"
      },
      {
        "id": "838c711b-cff2-41c8-9904-3ffb9a1ce57b",
        "text": "Жаңартылатын жолдардың санын шектеу үшін"
      },
      {
        "id": "89736579-9a82-4dd7-8fb3-05cd39d4ce13",
        "text": "Жаңа кесте құру үшін"
      },
      {
        "id": "f678176c-99b3-4622-a4db-4862f9d7e29d",
        "text": "Сұрыптаушы мүше және сүзгілеуші мүше"
      },
      {
        "id": "26d59d5e-47a7-4781-b01e-c5ae56c1cd2f",
        "text": "Cached Transaction Engine"
      },
      {
        "id": "81d4ba49-b59e-4d17-ad4d-c4b5a64a8925",
        "text": "Қате тудырады"
      },
      {
        "id": "475b3920-47d1-4bac-8465-b5f8cd173289",
        "text": "IN операторы тек сандармен жұмыс істейді"
      }
    ],
    "correctOptionIds": [
      "c94f6485-7616-46fb-a426-67f11e606408"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "fc53619f-6453-4463-9808-60ab3a37d6d0",
    "subjectId": "db",
    "text": "DELETE командасында ішкі сұранысты қолдану мысалы қандай?",
    "options": [
      {
        "id": "05d6b39b-2a62-4673-a3f8-cbc9750b4a0a",
        "text": "Белгілі бір шартқа сәйкес келетін тәуелді объектілері бар жолдарды басқа кестедегі мәндер арқылы тауып өшіру"
      },
      {
        "id": "523cc00c-2ff8-4c8e-bc8c-95fd0fb8a12c",
        "text": "Кестеден тек бағанды өшіру"
      },
      {
        "id": "13bc1f1c-9d61-49e7-a5d2-5b247223286e",
        "text": "Кестені толығымен тазарту (TRUNCATE)"
      },
      {
        "id": "de94d5e6-fc5c-470f-8236-54ff42fb0c6d",
        "text": "Дерекқордың резервтік көшірмесін өшіру"
      },
      {
        "id": "40400282-4b39-44b8-a861-193cd7d301aa",
        "text": "Екі кестенің жартылай бірігуін"
      },
      {
        "id": "daf2a3a6-5a42-4301-85da-a42f20f3266e",
        "text": "Сұрыптаушы мүше және сүзгілеуші мүше"
      },
      {
        "id": "68f167eb-4ea7-40ca-b425-ea3a0d9efdc9",
        "text": "> EXISTS"
      },
      {
        "id": "4865ed49-3390-4789-90cc-b3ee455a5fe1",
        "text": "Сыртқы кестенің Тек ішкі кестеде сәйкестігі бар жолдарын ғана қайтаратын операция (EXISTS немесе IN арқылы жасалады)"
      }
    ],
    "correctOptionIds": [
      "05d6b39b-2a62-4673-a3f8-cbc9750b4a0a"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "897829ea-ca93-4b16-9108-09dca5761368",
    "subjectId": "db",
    "text": "INSERT INTO ... SELECT ... құрылымы не істейді?",
    "options": [
      {
        "id": "7d810c00-d2ca-4158-86de-9e565fba049e",
        "text": "Ішкі сұраныс (SELECT) қайтарған нәтижелерді бірден жаңа кестеге қосады (INSERT)"
      },
      {
        "id": "ceab4b67-bda1-4546-ab9a-d960fc428522",
        "text": "Деректерді тексереді және егер олар кестеде болса қате шығарады"
      },
      {
        "id": "72e95a9f-9fb1-48f5-bbb3-9a0a2f107808",
        "text": "Деректерді басқа кестеге уақытша көшіреді"
      },
      {
        "id": "3492f604-fdb4-43c1-9bbe-06ee8dc0c0d0",
        "text": "Деректерді көрсетпейді, тек санын қайтарады"
      },
      {
        "id": "d0817a40-07dd-4924-b8ff-612c953157c6",
        "text": "Туынды кесте (Derived Table) немесе Inline View"
      },
      {
        "id": "caeaea84-90c1-4f68-9ae5-5b90f01be03c",
        "text": "Ешқашан орындалмайтын сұраныс"
      },
      {
        "id": "e79599b6-73cc-4924-8e8c-4a599b3d1dcf",
        "text": "REPEAT"
      },
      {
        "id": "cce4738c-9c62-454f-af27-1f9d7f715437",
        "text": "Иә, ішкі сұраныстан сыртқы сұраныс бағандары көрінеді (scope visibility)"
      }
    ],
    "correctOptionIds": [
      "7d810c00-d2ca-4158-86de-9e565fba049e"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "5a51397e-66eb-4d2d-b130-2bc4de82d1b7",
    "subjectId": "db",
    "text": "Ішкі сұраныстардың максималды кірістірілу тереңдігі (nesting limit) бар ма?",
    "options": [
      {
        "id": "63ac9f2c-1262-496e-8f24-d1647447ad1f",
        "text": "ДҚБЖ түріне байланысты белгілі бір шектеулер болады (мысалы, SQL Server-де 32 деңгей)"
      },
      {
        "id": "4cae54b8-206c-46d7-950b-469469dcb466",
        "text": "Жоқ, кез келген ДҚБЖ шексіз тереңдікті қолдайды"
      },
      {
        "id": "0d9fe5e0-e985-428e-a92d-c4561d23e504",
        "text": "Тек 2 деңгеймен шектеледі"
      },
      {
        "id": "69a1f089-2222-49ad-9cfb-bc33d653c740",
        "text": "Тек 100 деңгеймен шектеледі"
      },
      {
        "id": "ddddc0be-ea5c-40be-982f-30c5ad129eac",
        "text": "Бастапқы кілттерді автоматты түрде өзгерту үшін"
      },
      {
        "id": "c29c1fdf-78be-4cc4-a626-8f4155b433e4",
        "text": "Декорреляция немесе Subquery Unnesting"
      },
      {
        "id": "77e5c9ab-76a1-4bdc-891a-56f6b6adb4b7",
        "text": "NULL мәні қайтарылады"
      },
      {
        "id": "22c3e510-273f-4047-8806-02bc74d03517",
        "text": "Егер 5-ші департаментте бірден көп қызметкер жұмыс істесе, скалярлық емес салыстыру қатесін береді"
      }
    ],
    "correctOptionIds": [
      "63ac9f2c-1262-496e-8f24-d1647447ad1f"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "8185e5fb-344c-4c8e-963c-8e2dd59e6f7a",
    "subjectId": "db",
    "text": "Байланысқан ішкі сұраныстың сыртқы сұраныстың әрбір жолы үшін орындалуына байланысты, оның орташа алгоритмдік күрделілігі қандай?",
    "options": [
      {
        "id": "0fd7fab5-27e9-4997-b1b1-aceb25e5dda5",
        "text": "O(N * M), мұнда N - сыртқы жолдар, M - ішкі жолдар саны"
      },
      {
        "id": "68785fee-053b-49e4-8de3-60487d107c42",
        "text": "O(1)"
      },
      {
        "id": "8e65d6ba-7bad-4ea0-8f92-85fc521f14b3",
        "text": "O(log N)"
      },
      {
        "id": "a3f6162f-2fdd-42b9-b0c5-eef47d3838f7",
        "text": "O(N + M)"
      },
      {
        "id": "603d7a67-6015-4767-87ca-7492518fbe18",
        "text": "Тек олардың аттары бірдей болса ғана рұқсат"
      },
      {
        "id": "166a687f-36ea-4785-a3a8-1a0a3f882566",
        "text": "Ең жоғары жалақы алатын қызметкерді табады"
      },
      {
        "id": "26d9b18d-55e7-4f17-9187-32ce5f70fae6",
        "text": "Сыртқы кестеге алиас (атау) беріп, бағанды сол алиас арқылы нақты көрсету керек (мысалы, outer_table.column_name)"
      },
      {
        "id": "d6302272-3870-4d03-9436-73445e06c0b6",
        "text": "Тек INNER JOIN қолдануға рұқсат етіледі"
      }
    ],
    "correctOptionIds": [
      "0fd7fab5-27e9-4997-b1b1-aceb25e5dda5"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "8936bcbd-8e04-4bbc-8754-af0a8853d153",
    "subjectId": "db",
    "text": "SQL-де SOME операторы қандай оператормен толық мағыналас?",
    "options": [
      {
        "id": "053a8cb1-b176-49ab-aa1b-794f8222804e",
        "text": "ANY"
      },
      {
        "id": "dcc8ca77-d8a1-41ce-a86d-52f5ee163b0f",
        "text": "ALL"
      },
      {
        "id": "b3dd57da-5a28-45c4-b6e3-ef7a27ebb355",
        "text": "EXISTS"
      },
      {
        "id": "0527c7e5-77b5-4425-ade6-a87ae26fa622",
        "text": "IN"
      },
      {
        "id": "f3785190-8bef-4de8-ad89-3e6ab70e8fbf",
        "text": "Дерекқордың орын жетпеуінен қысылуы"
      },
      {
        "id": "9008a68a-a153-4bf9-b668-642ee3c607aa",
        "text": "Әрқашан байланысқан сұраныс ретінде орындайды"
      },
      {
        "id": "56c913e1-9484-4111-9ec4-613d4e329980",
        "text": "Иә, кез келген уақытта қолдануға рұқсат етілген"
      },
      {
        "id": "daa19f46-4ae7-4440-ba09-287cb90db8c3",
        "text": "Correlated Subquery (Байланысқан сұраныс)"
      }
    ],
    "correctOptionIds": [
      "053a8cb1-b176-49ab-aa1b-794f8222804e"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "7c56655c-67a2-4505-8276-4b55a0112721",
    "subjectId": "db",
    "text": "<> ANY (тең емес ANY) операторы не істейді?",
    "options": [
      {
        "id": "7901c72c-c9b3-4910-80e3-b05d36d82563",
        "text": "Егер мән ішкі сұраныс қайтарған тізімдегі кем дегенде бір мәнге тең болмаса, TRUE қайтарады"
      },
      {
        "id": "f4c882c0-cb5d-4e42-8437-5688e65c5e92",
        "text": "Тізімдегі ешбір мәнге тең емес екенін тексереді"
      },
      {
        "id": "e8735dac-f3bf-4760-8f62-6a2d0bdd5b68",
        "text": "Тізім бос болса ғана TRUE қайтарады"
      },
      {
        "id": "993b00e9-144f-4a05-931a-651bddbd0908",
        "text": "Тізімдегі барлық мәнге тең емес екенін тексереді"
      },
      {
        "id": "67cc8367-1b71-4055-b461-fb15a76516de",
        "text": "Әр санаттағы екінші ең қымбат тауардан арзан тауарларды табады"
      },
      {
        "id": "ae8ebb41-46da-4ebf-aa2f-ad7fa6423fbd",
        "text": "Derived Table (Туынды кесте)"
      },
      {
        "id": "3afa127c-6803-412c-bff0-fadd6a65866c",
        "text": "Қателер журналы"
      },
      {
        "id": "3f4af580-8f83-41e9-aaed-3f0c57fe0187",
        "text": "IT департаментіндегі қызметкерлердің жалақысын 1.1 теңгеге өсіреді"
      }
    ],
    "correctOptionIds": [
      "7901c72c-c9b3-4910-80e3-b05d36d82563"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "e7b5563c-3d35-4d44-934e-959eebd894cf",
    "subjectId": "db",
    "text": "<> ALL (тең емес ALL) операторы нені білдіреді?",
    "options": [
      {
        "id": "19cebc78-1605-4bac-a720-1c780af5e68a",
        "text": "Тізімдегі мәндердің ешқайсысына тең емес (NOT IN баламасы)"
      },
      {
        "id": "abddcf9a-f205-40d9-882b-69e8a5405202",
        "text": "Тізімдегі кем дегенде бір мәнге тең емес"
      },
      {
        "id": "29fcda1d-4b29-48bd-b24c-fdb8c1ff318f",
        "text": "Тізімде тек NULL емес мәндер бар екенін білдіреді"
      },
      {
        "id": "1d06acb4-8fad-4f78-97f5-954f83442745",
        "text": "Тізімдегі барлық мәндерге тең"
      },
      {
        "id": "8a3212b7-4c97-4d89-94ae-2b5c91eac710",
        "text": "Тек JOIN операторымен қолданғанда міндетті"
      },
      {
        "id": "6ecf2a88-a589-4656-b794-749732e2917e",
        "text": "Ешқандай қате туындамайды"
      },
      {
        "id": "fbecd6d3-65b8-440d-89c8-9a126f61264e",
        "text": "Тек сандық бағандар болса ғана міндетті"
      },
      {
        "id": "0d7d763a-3f44-498a-9a34-99e46f749512",
        "text": "Оны тек DDL деңгейінде орындау"
      }
    ],
    "correctOptionIds": [
      "19cebc78-1605-4bac-a720-1c780af5e68a"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "06e04aac-1174-409b-9456-5fd3985dcd8f",
    "subjectId": "db",
    "text": "Ұялы ішкі сұраныстар (nested subqueries) деген не?",
    "options": [
      {
        "id": "e8cbc6bd-0366-436b-be4d-dbff0b24d66d",
        "text": "Бір ішкі сұраныстың ішінде тағы бір ішкі сұраныстың орналасуы"
      },
      {
        "id": "f47ac570-3d0f-4b9c-b733-3435d94284ea",
        "text": "Бір сұраныс ішіндегі бірнеше параллель сұраныстар"
      },
      {
        "id": "787004ed-b79a-419f-b3fc-4ba7a9957ece",
        "text": "Бастапқы кілттерді қосатын сұраныстар"
      },
      {
        "id": "3ed2b685-84b9-4297-b6c6-c3ed2b46b53f",
        "text": "Серверлер арасындағы сұраныстар"
      },
      {
        "id": "adc64d46-9610-41be-ba7d-f7b631eb976b",
        "text": "Деректерді біріктіреді"
      },
      {
        "id": "a0be1fbd-4938-4528-aae5-5f503bc907e1",
        "text": "Тәуелсіз (Non-correlated) ішкі сұраныс"
      },
      {
        "id": "fc7d7e3e-3bd4-4450-9810-eacf5e0626fa",
        "text": "Жаңа кесте құру үшін"
      },
      {
        "id": "b71f6399-25cd-4b12-a133-ad600d4241b5",
        "text": "FOREIGN KEY (Сыртқы кілт) құру"
      }
    ],
    "correctOptionIds": [
      "e8cbc6bd-0366-436b-be4d-dbff0b24d66d"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "bd0c70ef-4d16-4f21-aa7b-06a26505efa5",
    "subjectId": "db",
    "text": "SELECT * FROM Employees WHERE Salary > (SELECT AVG(Salary) FROM Employees); сұранысы не істейді?",
    "options": [
      {
        "id": "66247915-8f7b-4e59-bce9-ddac966f59d4",
        "text": "Жалақысы орташа жалақыдан жоғары барлық қызметкерлерді табады"
      },
      {
        "id": "134fe58e-3155-4ece-bafc-29fb9e68d365",
        "text": "Ең жоғары жалақы алатын қызметкерді табады"
      },
      {
        "id": "82d445df-f4e7-4858-b8bc-dea625d477e6",
        "text": "Орташа жалақының мөлшерін есептейді"
      },
      {
        "id": "1326bc7d-3343-49a8-b2c7-9afd3ebd1be5",
        "text": "Қызметкерлердің жалақысын орташа шамаға теңестіреді"
      },
      {
        "id": "6110ca7a-29c4-4993-9fc9-3ac0c8bfbabb",
        "text": "Жолдар санының теңдігін"
      },
      {
        "id": "62e96759-ffbc-44c6-8573-1e62c4f67ac2",
        "text": "INNER JOIN"
      },
      {
        "id": "71c2a57d-6cbf-415c-9536-f512be279b06",
        "text": "Бір сұраныс ішіндегі бірнеше параллель сұраныстар"
      },
      {
        "id": "adaf39d1-f92e-4a9f-914c-d03bb445a6ff",
        "text": "Тек рекурсивті CTE ішінде ғана рұқсат етіледі"
      }
    ],
    "correctOptionIds": [
      "66247915-8f7b-4e59-bce9-ddac966f59d4"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "f19c70f7-ef9e-4046-9bb1-53f9844fe9a0",
    "subjectId": "db",
    "text": "Salary > (SELECT AVG(Salary) FROM Employees) ішкі сұранысы қандай сұраныс түріне жатады?",
    "options": [
      {
        "id": "0692860e-bd86-4728-bb8b-5d938e926670",
        "text": "Тәуелсіз (Non-correlated) ішкі сұраныс"
      },
      {
        "id": "882e4eea-8215-4aac-9872-0d57488acdc6",
        "text": "Байланысқан (Correlated) ішкі сұраныс"
      },
      {
        "id": "49fdcbb3-7b03-48e7-9613-d7968cec023b",
        "text": "Рекурсивті сұраныс"
      },
      {
        "id": "4c1d52e2-409e-42cb-8d3b-3b58ecff76df",
        "text": "Derived Table"
      },
      {
        "id": "7512f6f5-53c4-430a-8d46-50316fae359e",
        "text": "Жүктеме тым ауыр болғандықтан орындалмайды"
      },
      {
        "id": "a1aac3a9-c2dc-4fb1-b0bd-0405ddf4e208",
        "text": "Мәндердің бір-бірінен үлкен болуын"
      },
      {
        "id": "6294ff0c-694c-421a-ba81-4cac7b8d182b",
        "text": "Тек JOIN операторымен қолданғанда міндетті"
      },
      {
        "id": "f6424cb5-7f94-42e9-a4a7-06a1e304162b",
        "text": "Транзакциядан бас тартуды"
      }
    ],
    "correctOptionIds": [
      "0692860e-bd86-4728-bb8b-5d938e926670"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "c8fad0cc-e682-4680-b2bd-fa58877a3524",
    "subjectId": "db",
    "text": "SELECT * FROM Departments d WHERE EXISTS (SELECT 1 FROM Employees e WHERE e.DeptID = d.ID); сұранысы қандай департаменттерді табады?",
    "options": [
      {
        "id": "8b3c9fbc-13cb-4a4e-b186-0b0138e66955",
        "text": "Кем дегенде бір қызметкері бар барлық департаменттерді"
      },
      {
        "id": "fe811bc7-ae62-4d98-bbf4-c546e0016ec5",
        "text": "Қызметкері жоқ департаменттерді"
      },
      {
        "id": "1f3c8f99-ccdb-417b-bccc-1e8f616c2381",
        "text": "Ең көп қызметкері бар департаментті"
      },
      {
        "id": "1d36ad21-3c16-4107-99f8-80da85aae96e",
        "text": "Жаңадан ашылған департаменттерді"
      },
      {
        "id": "439926d8-1f1b-4032-aa9d-2f223860c4de",
        "text": "CTE (Common Table Expression)"
      },
      {
        "id": "6970e9ca-f1b5-4a68-b6df-37b2e1f69609",
        "text": "REPEAT"
      },
      {
        "id": "71a2db6a-37e3-4d5c-bebc-7f2fbe833fd3",
        "text": "Сұранысты уақытша кестеге өзгертеді"
      },
      {
        "id": "fc6c5532-cbff-4bac-afd5-4634b83df4f8",
        "text": "Уақытша сұраныс"
      }
    ],
    "correctOptionIds": [
      "8b3c9fbc-13cb-4a4e-b186-0b0138e66955"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "96fbef15-1a63-4cb3-b4a4-d5303c8750ed",
    "subjectId": "db",
    "text": "WHERE EXISTS (SELECT 1 FROM Employees e WHERE e.DeptID = d.ID) ішкі сұранысы қандай сұраныс түріне жатады?",
    "options": [
      {
        "id": "a36567d9-b57f-4221-b5bc-5bca8ac4873f",
        "text": "Байланысқан (Correlated) ішкі сұраныс"
      },
      {
        "id": "9cad3ff5-b6fd-47a1-8935-0c4bc6317822",
        "text": "Тәуелсіз (Non-correlated) ішкі сұраныс"
      },
      {
        "id": "3ca33374-1f0d-4aa0-8bb3-640f5bb99bc0",
        "text": "Скалярлық сұраныс"
      },
      {
        "id": "e5b36404-305f-4ee7-90fa-419dbeb2876b",
        "text": "Common Table Expression"
      },
      {
        "id": "045cc996-a5e4-4b18-ae7b-f3bba052bd82",
        "text": "Тек мәтіндік деректер үшін рұқсат етіледі"
      },
      {
        "id": "ef7be588-eb0d-462e-a0bb-9f5562e75503",
        "text": "Иә, ішкі сұраныстың барлық жолдары сыртқы сұранысқа беріледі"
      },
      {
        "id": "d633fa1e-e332-4c56-a0f1-e22e25fdead8",
        "text": "Әдетте мағынасы жоқ және SQL Server сияқты кейбір жүйелерде тікелей қате береді"
      },
      {
        "id": "cc68dad0-68b1-4cec-8637-c1e14553cea9",
        "text": "Қызметкерлердің жалақысын орташа шамаға теңестіреді"
      }
    ],
    "correctOptionIds": [
      "a36567d9-b57f-4221-b5bc-5bca8ac4873f"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "fa868eb5-7e23-4f62-a47e-822aa5025714",
    "subjectId": "db",
    "text": "Туынды кестелерді (Derived Tables) қолданғанда оларға балама атау (alias) беру міндетті ме?",
    "options": [
      {
        "id": "0f146c47-458f-41bc-acba-03298f521fac",
        "text": "Иә, міндетті, әйтпесе көптеген ДҚБЖ-да синтаксистік қате туындайды"
      },
      {
        "id": "649d6d5a-2480-48b6-b7ae-dc2f84e4e2ba",
        "text": "Жоқ, міндетті емес, тек өз еркімен беріледі"
      },
      {
        "id": "5ae2f497-f90c-4d19-b09b-c38908a98849",
        "text": "Тек сандық бағандар болса ғана міндетті"
      },
      {
        "id": "59f0fa42-7570-4aca-a186-35ab51bd94e4",
        "text": "Тек JOIN операторымен қолданғанда міндетті"
      },
      {
        "id": "e3d2323e-cdf1-44b1-800e-47c30518212b",
        "text": "IN операторының"
      },
      {
        "id": "72a7e8bb-586d-4c81-bf73-0e74cc767a4b",
        "text": "UNION немесе UNION ALL"
      },
      {
        "id": "4a64c7d8-d4e2-408d-b1b8-7b24c141ae98",
        "text": "UNKNOWN"
      },
      {
        "id": "8846c889-405c-4332-8c0d-24571ff22f17",
        "text": "ITERATE"
      }
    ],
    "correctOptionIds": [
      "0f146c47-458f-41bc-acba-03298f521fac"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "467b958f-edfe-44f1-8a48-4a95e8384e12",
    "subjectId": "db",
    "text": "Derived Table-де баған аттары қайталанса не болады?",
    "options": [
      {
        "id": "e2f2ea5c-395e-46b1-98ce-96a88ea52b8d",
        "text": "Қате туындайды, туынды кесте бағандарының аттары бірегей болуы керек"
      },
      {
        "id": "b6256eb5-a754-4fa1-bfaf-6ca1048a28d1",
        "text": "ДҚБЖ оларды автоматты түрде нөмірлейді"
      },
      {
        "id": "21461ff3-013e-41d4-9881-5ab061aa4f64",
        "text": "Тек бірінші баған ғана сақталады"
      },
      {
        "id": "6ba825a8-104b-4416-8048-7083d2c21973",
        "text": "Соңғы баған алдыңғыларын алмастырады"
      },
      {
        "id": "94c783e7-d84d-4298-84a0-f054e0ec9ecc",
        "text": "Тек бірінші жолды өшіреді"
      },
      {
        "id": "219eef4f-8973-4dba-89f9-c3c28c9ea4cb",
        "text": "Оны тек рекурсивті түрде орындайды"
      },
      {
        "id": "082c8cd9-adf5-4cd5-bab5-da1e8f2a6118",
        "text": "Барлық тауарларды табады"
      },
      {
        "id": "353bd2f2-36fc-4b89-9f47-d1a37ddfaa6a",
        "text": "Екеуі де NULL мәндерді елемейді"
      }
    ],
    "correctOptionIds": [
      "e2f2ea5c-395e-46b1-98ce-96a88ea52b8d"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "e94e0ba4-654a-4609-9c87-37afee1fbae6",
    "subjectId": "db",
    "text": "SQL-де бір WITH сөйлемінде анықталған CTE ішінде одан бұрын анықталған басқа CTE-лерге сілтеме жасауға болады ма?",
    "options": [
      {
        "id": "037f8311-076b-479d-bd69-b73c1ceef85a",
        "text": "Иә, оларды тізбектей байланыстыруға болады"
      },
      {
        "id": "d662ee83-f18f-4fb2-a22c-09ce2e1f491b",
        "text": "Жоқ, CTE-лер тек дербес жұмыс істеуі тиіс"
      },
      {
        "id": "a8493acd-013b-4d0c-9bbf-64f348e909ba",
        "text": "Тек рекурсивті CTE ішінде ғана рұқсат етіледі"
      },
      {
        "id": "de7976ed-aae2-4566-8d83-6e7a1305ccc2",
        "text": "Ол үшін арнайы JOIN жазылуы керек"
      },
      {
        "id": "69365cff-2d13-47ff-b3e5-fdecd78a9698",
        "text": "Тек байланысқан ішкі сұраныстар ғана жылдамырақ"
      },
      {
        "id": "3a697c76-5fd9-402d-b56b-50daacc35f0b",
        "text": "EXISTS"
      },
      {
        "id": "9f0568bd-9466-46d4-95ac-f23008520051",
        "text": "ANY (немесе SOME)"
      },
      {
        "id": "cb4a304f-b7ab-422f-858d-ebadb7c216d8",
        "text": "Бір сұраныс ішіндегі бірнеше параллель сұраныстар"
      }
    ],
    "correctOptionIds": [
      "037f8311-076b-479d-bd69-b73c1ceef85a"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "79a5f0b6-46bc-4013-9162-460bc4e5045b",
    "subjectId": "db",
    "text": "Дерекқор оңтайландырғышы (Query Optimizer) ішкі сұраныстарды талдау кезінде қандай әрекет жасайды?",
    "options": [
      {
        "id": "21f17b59-fec8-48bc-ab80-fce5942af593",
        "text": "Ішкі сұранысты тиімді JOIN операциясына айналдыруға тырысады (query rewriting)"
      },
      {
        "id": "dad2f26f-4e01-418a-8d58-21b5ec900e7b",
        "text": "Оларды орындамай тастап кетеді"
      },
      {
        "id": "de8edd24-6f53-40f4-b359-7b5de58eeb04",
        "text": "Әрқашан байланысқан сұраныс ретінде орындайды"
      },
      {
        "id": "f22acde2-abc4-49d3-a2da-2b0f504b292c",
        "text": "Сұранысты уақытша кестеге өзгертеді"
      },
      {
        "id": "07d8a3a0-27ae-42f3-95dc-453286927ab1",
        "text": "Тек бірінші жолды өшіреді"
      },
      {
        "id": "8b5c8cde-b49f-49a1-af88-6db9ffdb16fe",
        "text": "Екеуі де бірдей қауіпті"
      },
      {
        "id": "3c11cb45-5435-4d1d-b48e-320da0128c4e",
        "text": "Қате шығады (Subquery returns more than 1 row)"
      },
      {
        "id": "e948f800-dc46-43e4-800e-0c0357615ece",
        "text": "Орташа жалақының мөлшерін есептейді"
      }
    ],
    "correctOptionIds": [
      "21f17b59-fec8-48bc-ab80-fce5942af593"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "e3d7440b-f574-4a80-82ee-84e29de3efc7",
    "subjectId": "db",
    "text": "SQL-де \"Subquery Collapse\" немесе \"Subquery Flattening\" деген не?",
    "options": [
      {
        "id": "7d5b8108-3a09-438e-9d02-c872e339bf40",
        "text": "ДҚБЖ-ның ішкі сұранысты жазық JOIN құрылымына автоматты түрде өзгерту процесі"
      },
      {
        "id": "08d33186-77f2-4439-9a11-acececced9a9",
        "text": "Ішкі сұраныстардың қателікке ұшырап тоқтауы"
      },
      {
        "id": "b822ea3e-d7d5-483d-a3ce-70b034775475",
        "text": "Кірістірілген сұраныстар санын шектеу"
      },
      {
        "id": "8d0c1230-a115-4cf9-b208-b9463c2d1a88",
        "text": "Дерекқордың орын жетпеуінен қысылуы"
      },
      {
        "id": "b89bc1a2-4e91-4222-9232-0daf4efc6406",
        "text": "UNKNOWN"
      },
      {
        "id": "2999afcb-c420-44f6-a4ce-1e7520fcd736",
        "text": "Ішкі сұранысты тиімді JOIN операциясына айналдыруға тырысады (query rewriting)"
      },
      {
        "id": "e1b5f54d-8c17-446c-88d1-87cf7cb3de0c",
        "text": "RECURSIVE"
      },
      {
        "id": "cd703e3e-266a-4e25-b9d5-5329161ef44d",
        "text": "Қате (Error)"
      }
    ],
    "correctOptionIds": [
      "7d5b8108-3a09-438e-9d02-c872e339bf40"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "6562478f-1a6d-4356-b19e-9e40d2d2dea0",
    "subjectId": "db",
    "text": "IN операторының ішінде бос жиын (мысалы, сәйкес келетін жолы жоқ ішкі сұраныс) болса, сұраныс нәтижесі қандай болады?",
    "options": [
      {
        "id": "c16778a2-cd3c-4bc3-83d0-940672451f98",
        "text": "FALSE қайтарады, ешқандай жол таңдалмайды"
      },
      {
        "id": "bff57e7c-19a9-4c01-8c37-acba72bf8241",
        "text": "TRUE қайтарады, барлық жолдар таңдалады"
      },
      {
        "id": "f3ce03bf-363c-4403-a0e2-c23a24592259",
        "text": "NULL қайтарады"
      },
      {
        "id": "1305776b-dd11-4887-a35a-256b74e8d0f2",
        "text": "Қате шығады"
      },
      {
        "id": "68f50f26-efdc-4498-b041-c1af9c7e254d",
        "text": "Орташа жалақы дұрыс есептелмегендіктен"
      },
      {
        "id": "15dabcef-d3ec-45b5-817e-c941af8eb37f",
        "text": "O(log N)"
      },
      {
        "id": "f3990277-7cb8-4ebc-9f63-fef964cc84f9",
        "text": "Кестенің құрылымын өзгерту үшін"
      },
      {
        "id": "0a52966c-336f-44e2-8745-a1b1b8d0f502",
        "text": "REPEAT"
      }
    ],
    "correctOptionIds": [
      "c16778a2-cd3c-4bc3-83d0-940672451f98"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "27d772e8-0cb6-417d-8141-87d0a9cac481",
    "subjectId": "db",
    "text": "NOT IN операторының ішінде бос жиын болса, ол қандай мән қайтарады?",
    "options": [
      {
        "id": "c7686ab8-006a-4b8f-99fa-27984daaa138",
        "text": "TRUE қайтарады, барлық жолдар сәйкес келеді"
      },
      {
        "id": "487df462-7b00-4aca-bc89-94b126d2cc2e",
        "text": "FALSE қайтарады, ешқандай жол сәйкес келмейді"
      },
      {
        "id": "ef0df2e6-82c9-444c-9ffe-ba39b1425113",
        "text": "NULL қайтарады"
      },
      {
        "id": "7e468eb8-c90e-4713-aad6-bfa91f075ab3",
        "text": "Қате шығады"
      },
      {
        "id": "bec38e82-6be6-4aab-bd16-564f940a4104",
        "text": "Қызметкері жоқ департаменттерді"
      },
      {
        "id": "2b575afd-ace2-4486-8c3d-307218f5c320",
        "text": "Жоқ, сыртқы сұранысқа ішкі сұраныстың бағандары тікелей көрінбейді"
      },
      {
        "id": "78061727-1d82-47c3-b5f1-1310b268d245",
        "text": "Иә, ішкі сұраныстан сыртқы сұраныс бағандары көрінеді (scope visibility)"
      },
      {
        "id": "31917ee4-c410-4c8b-a67f-edbf80695c69",
        "text": "FOREIGN KEY (Сыртқы кілт) құру"
      }
    ],
    "correctOptionIds": [
      "c7686ab8-006a-4b8f-99fa-27984daaa138"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "319d11a7-94d5-4e34-a492-d595e7db9299",
    "subjectId": "db",
    "text": "Қарапайым скалярлық немесе WHERE ішіндегі ішкі сұраныста LIMIT немесе TOP қолданылмаса, ORDER BY операторын жазуға рұқсат етіледі ме?",
    "options": [
      {
        "id": "e4a85228-8a6f-4f24-87cf-c1fed51c5eb7",
        "text": "Әдетте мағынасы жоқ және SQL Server сияқты кейбір жүйелерде тікелей қате береді"
      },
      {
        "id": "d52be9d4-e345-4c2d-9944-f97187daef41",
        "text": "Иә, әрқашан рұқсат етіледі және міндетті болып табылады"
      },
      {
        "id": "8a4aa683-62de-4ae8-94aa-2343dca5662f",
        "text": "Тек сандар үшін рұқсат етіледі"
      },
      {
        "id": "2f15d18d-dcad-4848-a8bd-287faae743f3",
        "text": "Тек мәтіндік деректер үшін рұқсат етіледі"
      },
      {
        "id": "a4782d25-506e-40d1-b887-91e4c9d0ea00",
        "text": "Ішкі сұраныстан кем дегенде бір жол қайтарылса"
      },
      {
        "id": "ca9b2edf-7ca6-442b-b884-9db9d3e8ec1f",
        "text": "Декорреляция немесе Subquery Unnesting"
      },
      {
        "id": "806999b2-8fdb-46cd-a97b-f723a7469924",
        "text": "Барлық мәндермен орындалса ғана true қайтарады"
      },
      {
        "id": "3e24ad2d-3208-47e9-aa23-9fc103614400",
        "text": "Ішкі сұраныста DISTINCT қолданылмауы тиіс"
      }
    ],
    "correctOptionIds": [
      "e4a85228-8a6f-4f24-87cf-c1fed51c5eb7"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "3622f835-fd98-48fe-b3e3-7c22b13712c3",
    "subjectId": "db",
    "text": "SELECT Name, (SELECT Max(Score) FROM Tests) FROM Students; сұранысы қалай орындалады?",
    "options": [
      {
        "id": "a03c7fb9-7494-4df4-a985-230ffb17f453",
        "text": "Әрбір студент жолының жанында барлық тесттердің ең жоғары балын қайталайды"
      },
      {
        "id": "582295d9-c9fc-4c38-9765-0b47702968c9",
        "text": "Әр студенттің жеке ең жоғары балын табады"
      },
      {
        "id": "69cbfe90-51fa-4970-836a-6c944c07d7c9",
        "text": "Студенттерді балдары бойынша сұрыптайды"
      },
      {
        "id": "2b5058ee-c66d-4261-9641-f156b49f7941",
        "text": "Қате шығарады, себебі скалярлық сұранысты SELECT-те қолдануға болмайды"
      },
      {
        "id": "80556e9a-a477-464a-802b-f2ade4db3334",
        "text": "Индекс"
      },
      {
        "id": "7ce19059-4595-4c4f-ae77-6ef126020b44",
        "text": "Иә, әрқашан рұқсат етіледі және міндетті болып табылады"
      },
      {
        "id": "e8b6f8ac-d207-4b72-be54-a5b5c9c9fe63",
        "text": "Сұранысты уақытша кестеге өзгертеді"
      },
      {
        "id": "e39602d4-458d-49e8-a7a7-5786272a6867",
        "text": "Common Table Expression"
      }
    ],
    "correctOptionIds": [
      "a03c7fb9-7494-4df4-a985-230ffb17f453"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "b975e2ef-4798-4551-a5de-23e0fd9acb42",
    "subjectId": "db",
    "text": "Төмендегілердің қайсысы ішкі сұраныспен байланысты операция немесе ұғым ЕМЕС?",
    "options": [
      {
        "id": "fcf17325-698e-452b-98a0-8521e1d6f84e",
        "text": "FOREIGN KEY (Сыртқы кілт) құру"
      },
      {
        "id": "d49ced8f-6877-4928-b6b3-937d1d88ef0b",
        "text": "Derived Table (Туынды кесте)"
      },
      {
        "id": "dec1d6f5-1b4a-47d9-9ca6-50fa35157da2",
        "text": "Correlated Subquery (Байланысқан сұраныс)"
      },
      {
        "id": "01114f0a-7710-4d90-bb77-28d69a2497c2",
        "text": "Scalar Subquery (Скалярлық сұраныс)"
      },
      {
        "id": "fcf6a1a7-9599-44d1-a45c-b4db5603cfd3",
        "text": "Тек DDL деңгейінде жұмыс істейтін сұраныс"
      },
      {
        "id": "5d878feb-fd81-451a-8f75-d0910370b67e",
        "text": "Әрбір студент жолының жанында барлық тесттердің ең жоғары балын қайталайды"
      },
      {
        "id": "e086dc59-9359-427b-889f-855481f3d7c3",
        "text": "Иә, тек SELECT * жазылуы тиіс"
      },
      {
        "id": "04143c7a-b0a0-4451-b532-b8493e1363d1",
        "text": "<= ANY"
      }
    ],
    "correctOptionIds": [
      "fcf17325-698e-452b-98a0-8521e1d6f84e"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "032099c2-295c-465d-93a7-c3b5b7f78fc7",
    "subjectId": "db",
    "text": "Ішкі сұранысты сұрыптау үшін TOP немесе LIMIT қолданылса, оған ORDER BY жазуға болады ма?",
    "options": [
      {
        "id": "d31f8a19-6ae5-445b-a4fd-ced1f495872f",
        "text": "Иә, бұл жағдайда жолдардың белгілі бір бөлігін (мысалы, ең үлкен 5 мәнді) алу үшін қажет"
      },
      {
        "id": "ffdf5585-055c-48e7-8d2a-06e7dbb6bd99",
        "text": "Жоқ, кез келген жағдайда ішкі сұраныста ORDER BY қолдануға тыйым салынған"
      },
      {
        "id": "29da691b-d277-468e-93a7-c06465c0b49a",
        "text": "Тек PostgreSQL-де ғана рұқсат етілген"
      },
      {
        "id": "cf071ba2-7ffb-44d9-a47b-ec5c734487ed",
        "text": "Тек FROM ішіндегі сұраныстарда ғана рұқсат етілген"
      },
      {
        "id": "588ec7dc-dbc2-491e-b702-84fb2af1dd75",
        "text": "Кесте құрылымын автоматты түрде өзгерту"
      },
      {
        "id": "a4f97cb6-32fe-4fa5-9605-049c41b0a1f4",
        "text": "Анкерлік мүше (Anchor member) және рекурсивтік мүше (Recursive member)"
      },
      {
        "id": "89926666-0513-4f8a-bdb5-1d68c1780e4c",
        "text": "Жоқ, маңызды емес, себебі тек жолдың бар-жоғы ғана тексеріледі"
      },
      {
        "id": "7604ea89-ef46-4a1c-8df8-849d76d3ee08",
        "text": "RECURSIVE"
      }
    ],
    "correctOptionIds": [
      "d31f8a19-6ae5-445b-a4fd-ced1f495872f"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "ddf26e06-00df-471a-af6d-b6fde48dc88b",
    "subjectId": "db",
    "text": "EXISTS операторының орнына IN операторын қолданғанда, ішкі сұранысқа қандай шектеу қойылады?",
    "options": [
      {
        "id": "07d42728-cb3c-4729-90dc-2fd53b9e76c7",
        "text": "Ішкі сұраныс тек бір бағанды қайтаруы тиіс"
      },
      {
        "id": "631e5e73-1964-4aef-b29f-350eabca804e",
        "text": "Ішкі сұраныста ешқандай WHERE шарты болмауы тиіс"
      },
      {
        "id": "10a2439c-f664-41a3-84c1-2db56f6232b1",
        "text": "Ішкі сұраныс тек бір жол қайтаруы тиіс"
      },
      {
        "id": "3810fe93-347f-45c3-8548-0b937ec3a57f",
        "text": "Ішкі сұраныста DISTINCT қолданылмауы тиіс"
      },
      {
        "id": "be4a6d6a-8e42-495d-8917-fde1183ca9a5",
        "text": "Ішкі кесте"
      },
      {
        "id": "4db19de4-c0f6-4c5d-a806-1cb276f2011f",
        "text": "Сыртқы сұраныстың әрбір жолына тәуелді және сыртқы кестенің бағандарын сілтеме ретінде қолданатын ішкі сұраныс"
      },
      {
        "id": "182d7389-7c1b-453d-8889-722a1865315c",
        "text": "Тек оң жақтағы кестенің сәйкес емес жолдарын қайтаруды"
      },
      {
        "id": "b0e55412-dff9-4a92-b8b2-8b7609ead0c6",
        "text": "Индекс"
      }
    ],
    "correctOptionIds": [
      "07d42728-cb3c-4729-90dc-2fd53b9e76c7"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "ee294a82-35d9-4707-a878-2d19b819b877",
    "subjectId": "db",
    "text": "EXISTS операторы ішкі сұраныстан NULL мәні бар жалғыз жол қайтқанда қандай нәтиже береді?",
    "options": [
      {
        "id": "9d311e24-d8d0-4d68-a04c-5fea6d54ae6f",
        "text": "TRUE береді, өйткені жолдың өзі бар (бос жиын емес)"
      },
      {
        "id": "b985a427-7a1c-492a-ac8e-a1ef0bdaf18c",
        "text": "FALSE береді, себебі мәні NULL"
      },
      {
        "id": "b7ee5908-67fd-49e2-8424-2c727f04cf77",
        "text": "NULL береді"
      },
      {
        "id": "31039e0f-510e-4ebc-909a-9ab4ede3284b",
        "text": "UNKNOWN мәнін қайтарады"
      },
      {
        "id": "51f1529a-d677-4cec-b017-86b75a841cb7",
        "text": "Екеуі де бірдей қауіпті"
      },
      {
        "id": "19611f72-14ea-4fa0-ab05-a3fa7eaf4a61",
        "text": "Анкерлік мүше (Anchor member) және рекурсивтік мүше (Recursive member)"
      },
      {
        "id": "ab95a0f0-310a-42ec-96a3-fb35c39acb2f",
        "text": "Иә, ішкі сұраныстың барлық жолдары сыртқы сұранысқа беріледі"
      },
      {
        "id": "6d50e2bb-52dc-4084-9725-2114bfae6f71",
        "text": "Тәуелсіз немесе қарапайым ішкі сұраныс (Non-correlated subquery)"
      }
    ],
    "correctOptionIds": [
      "9d311e24-d8d0-4d68-a04c-5fea6d54ae6f"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "2de1ab9f-951e-4d93-89b9-0cfbdd33ecc3",
    "subjectId": "db",
    "text": "WITH CTE AS (SELECT * FROM Users) SELECT * FROM CTE; сұранысындағы CTE ұғымы нені білдіреді?",
    "options": [
      {
        "id": "f96c3ea1-6cc1-438f-9ba2-c63d16d5eec0",
        "text": "Common Table Expression (Ортақ кестелік өрнек)"
      },
      {
        "id": "8e11bf93-5f3e-4c4d-a4f4-1a3a0f5ff541",
        "text": "Correlated Table Execution"
      },
      {
        "id": "7989a364-1c94-4298-a399-91ca1c484e01",
        "text": "Constraint Type Enforcement"
      },
      {
        "id": "290d53ca-4cb4-459e-9f30-c5de969e3637",
        "text": "Cached Transaction Engine"
      },
      {
        "id": "f56013cf-2f21-4ec4-9902-83dc3130babd",
        "text": "Тек PostgreSQL-де ғана рұқсат етілген"
      },
      {
        "id": "1dcb5a97-332d-4793-8484-b80dbcf0552d",
        "text": "Басқа SQL сұранысының ішіне кірістірілген сұраныс"
      },
      {
        "id": "858bfa21-94b9-4ff6-9773-0c04625ff45e",
        "text": "Correlated Subquery (Байланысқан сұраныс)"
      },
      {
        "id": "e33c83f7-c59f-4679-9424-16f396f86fff",
        "text": "Сыртқы сұраныстың әрбір жолы үшін орындалатын және сыртқы сұраныс мәндеріне тәуелді ішкі сұраныс"
      }
    ],
    "correctOptionIds": [
      "f96c3ea1-6cc1-438f-9ba2-c63d16d5eec0"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "f77302cb-102b-4147-b3d9-34d11b09b9ad",
    "subjectId": "db",
    "text": "CTE-лерді бірнеше рет үтір арқылы бөліп бір WITH сөйлемінде анықтауға болады ма?",
    "options": [
      {
        "id": "00fc7293-b908-4329-8176-21c89048f026",
        "text": "Иә, олар бір-бірінен кейін үтір арқылы жазыла береді"
      },
      {
        "id": "174b6d32-922e-4a9d-b8e8-212630785ec2",
        "text": "Жоқ, бір сұраныста тек бір ғана CTE анықтауға рұқсат етілген"
      },
      {
        "id": "52ac97f1-778e-44bf-9ebd-3aae91baa1f8",
        "text": "Тек олардың аттары бірдей болса ғана рұқсат"
      },
      {
        "id": "6ae16ecf-fe6e-47e6-ac7f-122e2bfe61ed",
        "text": "Тек SQL Server дерекқорында ғана рұқсат етілген"
      },
      {
        "id": "2ea95eb1-f92f-4efb-ac5f-78fba449f502",
        "text": "Тек FROM сөйлемінде"
      },
      {
        "id": "595e95cc-822a-4f41-9461-07ebc5c6bca5",
        "text": "Тізімде тек NULL емес мәндер бар екенін білдіреді"
      },
      {
        "id": "9585321b-9846-46d7-b292-75205fa8eba9",
        "text": "Тек PostgreSQL-де ғана рұқсат етілген"
      },
      {
        "id": "cbd8412f-737c-4b9a-8986-e5ea8f822503",
        "text": "Екі кестенің жартылай бірігуін"
      }
    ],
    "correctOptionIds": [
      "00fc7293-b908-4329-8176-21c89048f026"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "a9790891-91dc-496b-ae43-3efb8c32fdd2",
    "subjectId": "db",
    "text": "Рекурсивті CTE-де (Recursive CTE) қандай екі негізгі бөлік болады?",
    "options": [
      {
        "id": "eef9cb97-0f74-4caa-8734-d6ef439c0d18",
        "text": "Анкерлік мүше (Anchor member) және рекурсивтік мүше (Recursive member)"
      },
      {
        "id": "e1e4d105-78b1-4ebd-8c83-82efb326b61b",
        "text": "Бастапқы кесте және соңғы кесте"
      },
      {
        "id": "cc573707-61dd-4579-b9d0-6168ff78f209",
        "text": "Ішкі сұраныс және сыртқы сұраныс"
      },
      {
        "id": "17c4b44a-d0ff-4318-a3fa-fdca04162ec4",
        "text": "Сұрыптаушы мүше және сүзгілеуші мүше"
      },
      {
        "id": "05036e0b-40d3-4133-aae9-40af7e740bfb",
        "text": "Тек SQL Server дерекқорында ғана рұқсат етілген"
      },
      {
        "id": "4c0a7697-0ad2-4797-afee-e5d0fb25b2f8",
        "text": "Тізім бос болса ғана TRUE қайтарады"
      },
      {
        "id": "4a58f80e-66ce-47f4-b25a-b80290fe1f4a",
        "text": "Барлық жолдарды бірден өшіреді"
      },
      {
        "id": "f44d7056-4121-4597-9009-bacbbee866cb",
        "text": "NULL мәні қайтарылады"
      }
    ],
    "correctOptionIds": [
      "eef9cb97-0f74-4caa-8734-d6ef439c0d18"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "98aaa17d-ae5c-44cd-8517-57a872aafc4a",
    "subjectId": "db",
    "text": "Рекурсивті CTE-нің екі бөлігі бір-бірімен қандай оператор арқылы біріктіріледі?",
    "options": [
      {
        "id": "af01962e-fa0e-476d-8d0c-bf0cb93f5688",
        "text": "UNION немесе UNION ALL"
      },
      {
        "id": "24b95889-f3c3-4dc3-9fb1-01fb277a8acf",
        "text": "INNER JOIN"
      },
      {
        "id": "302e396e-d8a2-429c-8d31-2a4ccd8778f4",
        "text": "INTERSECT"
      },
      {
        "id": "c0824c2f-6e80-4afe-9688-cd67508a3ec6",
        "text": "EXCEPT"
      },
      {
        "id": "8690d291-957d-4ab9-b1dd-9cf9326801b0",
        "text": "Жаңа бастапқы кілт"
      },
      {
        "id": "afd695dd-a833-4a3a-80ba-1d123769f55b",
        "text": "Орташа жалақының мөлшерін есептейді"
      },
      {
        "id": "1f86e09c-a233-44d4-bd8a-9fb2c4e93bb4",
        "text": "Жоқ, HAVING ішінде тек қарапайым шарттар ғана жазылады"
      },
      {
        "id": "4ba62630-8458-4cdc-ace1-a87925029e74",
        "text": "Барлық тауарларды табады"
      }
    ],
    "correctOptionIds": [
      "af01962e-fa0e-476d-8d0c-bf0cb93f5688"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "84fce4ef-d31c-41e4-bde9-0692381ae11c",
    "subjectId": "db",
    "text": "Рекурсивті CTE дерекқорда не үшін жиі қолданылады?",
    "options": [
      {
        "id": "4652d75a-00a9-4145-8fbb-6329ff3a5f7d",
        "text": "Иерархиялық құрылымдарды (мысалы, ағаш тәрізді қызметкерлер тізімін, графтарды) өңдеу үшін"
      },
      {
        "id": "3c37c5b5-c8ca-4888-b840-85cc39f2085e",
        "text": "Деректерді жылдам өшіру үшін"
      },
      {
        "id": "c73e39e2-11b1-405d-9f0c-8fa35b24a89e",
        "text": "Кестелердің сақтық көшірмесін жасау үшін"
      },
      {
        "id": "3c361a2a-9ec8-4a34-9649-b775684f748b",
        "text": "Бастапқы кілттерді автоматты түрде өзгерту үшін"
      },
      {
        "id": "f2b210ff-807e-4f21-a2b4-2937dd6b975f",
        "text": "Әр студенттің жеке ең жоғары балын табады"
      },
      {
        "id": "9f82220c-1ffe-4f09-8cdb-7925c8b05a4c",
        "text": "NULL"
      },
      {
        "id": "9dd20ed6-b047-48cf-8840-630d60b8f76f",
        "text": "Байланысқан сұраныс"
      },
      {
        "id": "bc9bc61a-edac-4b25-b244-a10f207cd622",
        "text": "Сұраныстың жылдамдығын төмендетеді"
      }
    ],
    "correctOptionIds": [
      "4652d75a-00a9-4145-8fbb-6329ff3a5f7d"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "3c50caa4-810a-4be3-8801-b43977b30bfb",
    "subjectId": "db",
    "text": "SQL-де байланысқан ішкі сұраныстың әрбір қадамын сыртқы кестенің ағымдағы жолымен салыстыру үшін сыртқы кестеге не беріледі?",
    "options": [
      {
        "id": "a8ea6652-c0b5-48d9-8493-b4ecdcb5da1b",
        "text": "Алиас (уақытша атау)"
      },
      {
        "id": "2549b8c5-3cbd-405e-bf13-f206dded6e0e",
        "text": "Индекс"
      },
      {
        "id": "da94978f-05dd-41ac-8205-957f26e492ff",
        "text": "Жаңа бастапқы кілт"
      },
      {
        "id": "c442bb77-b01f-471f-b46c-b634b2233bf9",
        "text": "Транзакция ID-і"
      },
      {
        "id": "a852fae4-9f61-42ee-8656-8572bf6f0282",
        "text": "Тек рекурсивті CTE ішінде ғана рұқсат етіледі"
      },
      {
        "id": "a4161bda-6ec2-4f23-80ea-2ffbecad1344",
        "text": "Деректердің қауіпсіздік ережелерін орнату"
      },
      {
        "id": "d2456876-ed89-4fa4-a60b-ff5e75ff035a",
        "text": "Иә, тек SELECT 1 жазылуы тиіс, әйтпесе қате шығады"
      },
      {
        "id": "e0621d9c-3348-442d-bce1-eb4141ddcff7",
        "text": "Қателер журналы"
      }
    ],
    "correctOptionIds": [
      "a8ea6652-c0b5-48d9-8493-b4ecdcb5da1b"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "cd1905c6-883d-48e7-b9d7-e45683c0ea46",
    "subjectId": "db",
    "text": "SELECT * FROM Products p WHERE Price > (SELECT Price FROM Products WHERE Category = p.Category ORDER BY Price DESC LIMIT 1 OFFSET 1); сұранысы не істейді?",
    "options": [
      {
        "id": "699b2ab2-4277-4665-bdbd-2d65a32bfda8",
        "text": "Әр санаттағы екінші ең қымбат тауардан арзан тауарларды табады"
      },
      {
        "id": "e686f1bc-98cd-44d3-98e0-388ae4916e17",
        "text": "Әр санаттағы ең қымбат тауарларды табады"
      },
      {
        "id": "47199462-7ee0-44d3-b600-236113607f79",
        "text": "Тауарларды бағасы бойынша өсу ретімен сұрыптайды"
      },
      {
        "id": "de3fb41a-f5be-401d-8d9a-1df2c72423c9",
        "text": "Ешқандай санатқа жатпайтын тауарларды табады"
      },
      {
        "id": "4b2ff589-043d-4d1c-9e16-8928172631c9",
        "text": "Тізімде тек NULL емес мәндер бар екенін білдіреді"
      },
      {
        "id": "a658f459-0be8-4d04-88b7-ed8546ac18ef",
        "text": "NOT IN"
      },
      {
        "id": "a7c6be4c-93b9-40ab-aa34-0846dff7dd1e",
        "text": "Бұл сұраныста JOIN қолданылуы тиіс болғандықтан"
      },
      {
        "id": "069f069e-d528-4fde-9f3f-37b964daf754",
        "text": "Белгілі бір шартқа сәйкес келетін тәуелді объектілері бар жолдарды басқа кестедегі мәндер арқылы тауып өшіру"
      }
    ],
    "correctOptionIds": [
      "699b2ab2-4277-4665-bdbd-2d65a32bfda8"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "389e808c-bdd6-41fd-9b40-04619289c2fa",
    "subjectId": "db",
    "text": "Ішкі сұраныстар қай сұраныс түрінің ішінде ең көп қолданылады?",
    "options": [
      {
        "id": "e14bb47a-0522-4d2f-b8f7-f26fa82e713c",
        "text": "SELECT сұраныстарында"
      },
      {
        "id": "c830edb3-d1cf-4bc6-a4f0-8cb922013a9d",
        "text": "INSERT сұраныстарында"
      },
      {
        "id": "85b4283b-10b8-48e2-a56b-e9210df24ba0",
        "text": "CREATE сұраныстарында"
      },
      {
        "id": "da3a4c11-c523-49b0-88af-d85535d25665",
        "text": "DROP сұраныстарында"
      },
      {
        "id": "d5fefd13-a5be-4913-9879-aa54835ddc5c",
        "text": "FALSE қайтарады, ешқандай жол сәйкес келмейді"
      },
      {
        "id": "378e950e-e7d3-4ffe-bc62-2492e23823d0",
        "text": "Қателік (Error) шығарады"
      },
      {
        "id": "cddfd9d1-f8c1-4918-8d5a-a146931cb646",
        "text": "Иә, тек SELECT 1 жазылуы тиіс, әйтпесе қате шығады"
      },
      {
        "id": "c5fd507d-12f9-43cf-a539-66f6eda8b106",
        "text": "Сұраныс барлық нәтижелерді қайтарады"
      }
    ],
    "correctOptionIds": [
      "e14bb47a-0522-4d2f-b8f7-f26fa82e713c"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "c5f5c85a-6b6a-4ed8-bad6-56c00335674a",
    "subjectId": "db",
    "text": "IN операторының ішіндегі тізімде NULL болса, мысалы: 5 IN (1, 2, NULL), нәтижесі қандай болады?",
    "options": [
      {
        "id": "e380fdd1-f7d1-426f-95e1-d98d10528122",
        "text": "UNKNOWN (немесе NULL)"
      },
      {
        "id": "8f84d959-4cfa-4af0-a1b5-b06b08c3dad7",
        "text": "FALSE"
      },
      {
        "id": "8b480bc6-db8d-4a8d-a9fc-95d10fabcef8",
        "text": "TRUE"
      },
      {
        "id": "80d91289-806d-45c2-99ad-48610eb82b00",
        "text": "Қателік туындайды"
      },
      {
        "id": "dc2893fa-7408-4204-b06b-4fae27d59690",
        "text": "Ішкі сұраныс және сыртқы сұраныс"
      },
      {
        "id": "aeb13675-060e-421f-9736-971ccba0115a",
        "text": "REPEAT"
      },
      {
        "id": "4f6c9740-599c-4314-83d2-e82e7c36763e",
        "text": "IN операторы қауіпсіз"
      },
      {
        "id": "446f53d3-b0d0-4378-8888-32776d7838f6",
        "text": "Кестенің өз-өзіне қосылуын"
      }
    ],
    "correctOptionIds": [
      "e380fdd1-f7d1-426f-95e1-d98d10528122"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "c7e5fbe4-dfb7-4e37-8fdc-f07432e34e2e",
    "subjectId": "db",
    "text": "NOT IN операторының тізімінде NULL болса, мысалы: 5 NOT IN (1, 2, NULL), нәтижесі қандай болады?",
    "options": [
      {
        "id": "12cbaffd-837d-4842-ad00-ba7e7ee8f8c3",
        "text": "UNKNOWN (ешқандай жол таңдалмайды)"
      },
      {
        "id": "5b3223d6-edd2-45fb-b1c4-0d34e2701eef",
        "text": "TRUE"
      },
      {
        "id": "4aaffa31-4ff5-4bab-ad0e-bacea9f1e514",
        "text": "FALSE"
      },
      {
        "id": "053e3ff8-5c48-4dfb-80f4-4fe2a313615e",
        "text": "Нәтижесі әрқашан TRUE болады"
      },
      {
        "id": "ce8ccc10-2ce8-4c1c-8832-dc8a46a53b34",
        "text": "EXISTS алғашқы сәйкестікті тапқан бойда іздеуді тоқтатады (short-circuit), ал IN толық тізімді тексереді"
      },
      {
        "id": "72a02544-9767-4848-b4b5-95be2a858f37",
        "text": "Уақытша сұраныс"
      },
      {
        "id": "6a26cd02-c6f3-4150-a998-d10cac82ed7a",
        "text": "Тек мәтіндік деректер үшін рұқсат етіледі"
      },
      {
        "id": "707b97c5-6197-4d5c-8a67-23754d0d07aa",
        "text": "Тек сандар үшін рұқсат етіледі"
      }
    ],
    "correctOptionIds": [
      "12cbaffd-837d-4842-ad00-ba7e7ee8f8c3"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "9cc1228b-f59f-4440-ae6a-5cbf960dfa4f",
    "subjectId": "db",
    "text": "SQL стандарты бойынша ішкі сұраныстың ішінде ДҚБЖ сыртқы сұраныстың бағандарын көре алады ма?",
    "options": [
      {
        "id": "0a1637b6-7020-4fec-9e6b-63d687a9d990",
        "text": "Иә, ішкі сұраныстан сыртқы сұраныс бағандары көрінеді (scope visibility)"
      },
      {
        "id": "fd95071a-d700-49e9-96f4-1664eadc7e48",
        "text": "Жоқ, ішкі сұраныс сұраныстың сыртындағы бағандарды тікелей көрмейді"
      },
      {
        "id": "f275c2e5-8474-482f-9a91-a67aec02279d",
        "text": "Тек егер сыртқы кестеде индекс болса ғана көрінеді"
      },
      {
        "id": "63eac45c-c366-4c9b-ae69-193c1577a6fa",
        "text": "Тек скалярлық емес сұраныстарда көрінеді"
      },
      {
        "id": "15bd7208-851b-47da-8ae1-2c513428dbde",
        "text": "Тек FROM ішіндегі сұраныстарда ғана рұқсат етілген"
      },
      {
        "id": "91efab76-5dd4-4f36-ae8c-51c77a2fa47d",
        "text": "Ол бірнеше бағанды қайтара алады"
      },
      {
        "id": "8e6b1f88-f818-417d-b4d2-faec36d95bd7",
        "text": "Тек 100 деңгеймен шектеледі"
      },
      {
        "id": "2f4e298c-0862-49d0-9254-3f8b1c3766bc",
        "text": "Иә, кез келген уақытта қолдануға рұқсат етілген"
      }
    ],
    "correctOptionIds": [
      "0a1637b6-7020-4fec-9e6b-63d687a9d990"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "37cc26b7-811b-4dc7-88e5-8d19c2127b2e",
    "subjectId": "db",
    "text": "Сыртқы сұраныстан ішкі сұраныстың ішіндегі бағандарды тікелей SELECT-те қолдануға болады ма?",
    "options": [
      {
        "id": "94a80925-65a0-4405-ac0d-275e27169df7",
        "text": "Жоқ, сыртқы сұранысқа ішкі сұраныстың бағандары тікелей көрінбейді"
      },
      {
        "id": "0f5abd73-f5f6-4c4c-9cea-58db9b221510",
        "text": "Иә, кез келген уақытта қолдануға рұқсат етілген"
      },
      {
        "id": "79002ac0-1d66-44ea-95f7-47510b97bd04",
        "text": "Тек ішкі сұраныс байланысқан болса ғана болады"
      },
      {
        "id": "c225aaef-3f3e-46bc-b598-1af9ebbe290d",
        "text": "Тек скалярлық ішкі сұраныстарда болады"
      },
      {
        "id": "c3207d90-9594-4d08-aaef-5c19263863da",
        "text": "Ешқандай қате туындамайды"
      },
      {
        "id": "b72af448-5d54-426e-a010-9a5cc5175317",
        "text": "Common Table Expression"
      },
      {
        "id": "41b4d3ba-cd99-45fc-b57b-8c163db2ae32",
        "text": "Ол тек бір рет есептелетіндіктен"
      },
      {
        "id": "e6089eb5-dadb-4e88-bee3-8cd940ad48fd",
        "text": "NULL"
      }
    ],
    "correctOptionIds": [
      "94a80925-65a0-4405-ac0d-275e27169df7"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "95522e0c-f6a0-46e5-8bad-3155e622ccc0",
    "subjectId": "db",
    "text": "SELECT * FROM Employees WHERE Salary > (SELECT Salary FROM Employees WHERE DeptID = 5); сұранысы неліктен қате тудыруы мүмкін?",
    "options": [
      {
        "id": "8d1fd96e-efae-46eb-98f3-7b17378ba51f",
        "text": "Егер 5-ші департаментте бірден көп қызметкер жұмыс істесе, скалярлық емес салыстыру қатесін береді"
      },
      {
        "id": "2c21244d-e753-4658-89e9-df161fccff24",
        "text": "Орташа жалақы дұрыс есептелмегендіктен"
      },
      {
        "id": "a632ded1-8fba-4ad2-b1a6-8d46ee44bfb8",
        "text": "Бұл сұраныста JOIN қолданылуы тиіс болғандықтан"
      },
      {
        "id": "b23ff06d-874c-4538-b8a3-cac56a137676",
        "text": "WHERE-ден кейін Salary-ді салыстыруға болмайтындықтан"
      },
      {
        "id": "8ab8ad0f-268c-4f96-a7a2-b1922c6e162f",
        "text": "Тек INNER JOIN қолдануға рұқсат етіледі"
      },
      {
        "id": "7109d278-81d8-4ea9-ae61-0d5ce3b8503f",
        "text": "Бағасы орташа шамаға тең тауарларды табады"
      },
      {
        "id": "0bca8ef0-0ed7-4cbe-9dc2-49a4896572fd",
        "text": "NULL береді"
      },
      {
        "id": "010447f3-ada4-474f-b326-08c1e7c73d31",
        "text": "Ішкі сұраныс қайтарған мәндердің ең болмағанда біреуімен шарт орындалса true қайтарады"
      }
    ],
    "correctOptionIds": [
      "8d1fd96e-efae-46eb-98f3-7b17378ba51f"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "632f6cf0-8b2c-4f58-93e0-b05aa1acb87b",
    "subjectId": "db",
    "text": "Жоғарыдағы Salary > (SELECT Salary ...) қатесін болдырмау үшін салыстыру операторынан кейін қандай сөз жазылуы керек (егер барлық қызметкерден көп болсын десек)?",
    "options": [
      {
        "id": "9d06304f-0036-4b5e-ab4f-af2af4f1b110",
        "text": "ALL"
      },
      {
        "id": "0529690b-d32e-4f70-82ae-f45e07df3f73",
        "text": "ANY"
      },
      {
        "id": "bb93f618-ecdd-4067-a90f-c82730a174f4",
        "text": "EXISTS"
      },
      {
        "id": "02f9642c-9dca-4fdc-9dcd-b1e738348ffc",
        "text": "IN"
      },
      {
        "id": "d3a28423-28bd-4662-a017-0b7e86e50a1e",
        "text": "TRUE қайтарады, барлық жолдар таңдалады"
      },
      {
        "id": "d6191c5f-f334-4409-8b24-1605a968a432",
        "text": "Орташа жалақы есептелмегендіктен"
      },
      {
        "id": "1795249f-a38d-4381-800a-7754838370a5",
        "text": "O(log N)"
      },
      {
        "id": "38077257-64e7-40e9-a00e-cc0493e8b01f",
        "text": "Қателік туындамауы үшін кестелердің бірін жою керек"
      }
    ],
    "correctOptionIds": [
      "9d06304f-0036-4b5e-ab4f-af2af4f1b110"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "e5152910-583f-495e-ae2d-cfa0c7eb517e",
    "subjectId": "db",
    "text": "Жоғарыдағы Salary > (SELECT Salary ...) қатесін болдырмау үшін салыстыру операторынан кейін қандай сөз жазылуы керек (егер кем дегенде біреуінен көп болсын десек)?",
    "options": [
      {
        "id": "d261572c-1bc6-4e4b-9ee3-316f04225ad2",
        "text": "ANY (немесе SOME)"
      },
      {
        "id": "1ffb4ed1-72fa-4dec-a1f4-76535f404969",
        "text": "ALL"
      },
      {
        "id": "36569571-cc0f-415d-b826-62ba9fb4dcd4",
        "text": "EXISTS"
      },
      {
        "id": "6a62d5e1-0313-4168-8fa2-1feb8ade7436",
        "text": "IN"
      },
      {
        "id": "f727879c-a112-4ff2-b5e8-951f382d2d41",
        "text": "Иә, тек нақты бағандардың аттары жазылуы тиіс"
      },
      {
        "id": "a65fafdd-2ecf-476a-95de-d0bbcd7df601",
        "text": "Барлық қызметкерлердің жалақысын IT департаментінің бюджетіне теңейді"
      },
      {
        "id": "f70d1ec8-660c-47b1-beda-a586a903274f",
        "text": "EXISTS операторы қауіпсіз, өйткені ол үш мәнді логикаға (three-valued logic) тәуелді емес"
      },
      {
        "id": "d620b9e2-79dd-4754-8bb0-fdd64d3b49c5",
        "text": "Тек бірінші жолды өшіреді"
      }
    ],
    "correctOptionIds": [
      "d261572c-1bc6-4e4b-9ee3-316f04225ad2"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "25b00066-b57c-4828-b58c-061e5d38241f",
    "subjectId": "db",
    "text": "Ішкі сұраныстағы бағанға балама атау (alias) беру сыртқы сұраныста қолданғанда қалай әсер етеді?",
    "options": [
      {
        "id": "a4608d7c-7a34-43dd-9f4e-ea8bc211d850",
        "text": "Егер ішкі сұраныс FROM-да болса, сыртқы сұраныс сол балама атауды қолданып бағанға қол жеткізеді"
      },
      {
        "id": "024e9b5f-8f2b-46e0-a357-dfa3cbe6580d",
        "text": "Сыртқы сұранысқа ешқандай әсері жоқ"
      },
      {
        "id": "ec3d70dd-148f-446f-a126-3a1d5bfd123e",
        "text": "Сұраныстың жылдамдығын төмендетеді"
      },
      {
        "id": "38ee9b75-edb0-4b6f-b87e-e91b6b196158",
        "text": "Қате тудырады"
      },
      {
        "id": "a00fdea9-2e09-4950-a742-e3f0a28f9f9d",
        "text": "Бос мәтін"
      },
      {
        "id": "395ba02f-2ebe-49c1-8c51-85e0337b09bd",
        "text": "Тек бірінші жолды өшіреді"
      },
      {
        "id": "c9b7ba39-ce95-4886-9ec1-0fed374f3b5f",
        "text": "Кесте құрылымын автоматты түрде өзгерту"
      },
      {
        "id": "7b99c27b-3259-4efe-a016-4deb0df6ddf8",
        "text": "Тек олардың аттары бірдей болса ғана рұқсат"
      }
    ],
    "correctOptionIds": [
      "a4608d7c-7a34-43dd-9f4e-ea8bc211d850"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "23f42eb1-0d9a-44c7-a25a-e8da3e325496",
    "subjectId": "db",
    "text": "SQL-де EXISTS операторы орындалғанда деректердің өзі қайтарылады ма?",
    "options": [
      {
        "id": "7a53e9a0-6be3-452f-bbf7-67a6021f0444",
        "text": "Жоқ, тек логикалық TRUE немесе FALSE мәні ғана қайтарылады"
      },
      {
        "id": "bf49b446-5cb1-42af-9689-e0864f13a5ff",
        "text": "Иә, ішкі сұраныстың барлық жолдары сыртқы сұранысқа беріледі"
      },
      {
        "id": "477097bc-316c-425a-8008-152e2ebfa578",
        "text": "Тек бағандардың құрылымы қайтарылады"
      },
      {
        "id": "6a6d13c7-4e00-481a-9627-4430ff2572f8",
        "text": "Тек бастапқы кілттер ғана қайтарылады"
      },
      {
        "id": "915318a3-e5a8-489a-92a7-ee6052a7e40e",
        "text": "Тек JOIN операторымен қолданғанда міндетті"
      },
      {
        "id": "6cf0a741-9e77-45fd-9b0c-cc4c09b79725",
        "text": "DECLARE"
      },
      {
        "id": "fdb94f16-91d9-46c7-ba11-eb9239377f7e",
        "text": "Тек ішкі сұраныс байланысқан болса ғана болады"
      },
      {
        "id": "c7a966a9-24e2-4cc1-b414-c207aa661c03",
        "text": "Соңғы баған алдыңғыларын алмастырады"
      }
    ],
    "correctOptionIds": [
      "7a53e9a0-6be3-452f-bbf7-67a6021f0444"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "f22fe863-fcda-42f5-9649-23ed3523ad84",
    "subjectId": "db",
    "text": "NOT EXISTS операторы орындалғанда, егер ішкі сұраныстан бос жиын оралса, нәтижесі қандай болады?",
    "options": [
      {
        "id": "0df56061-39d7-4022-92a1-f8dc42ed4032",
        "text": "TRUE"
      },
      {
        "id": "01bca4eb-df5b-4597-9f63-99548cbead1d",
        "text": "FALSE"
      },
      {
        "id": "6ec823d1-0566-4683-bf0b-29012bf4737a",
        "text": "NULL"
      },
      {
        "id": "fb1baa71-b11b-4ae5-99bd-dce7f19b2caa",
        "text": "UNKNOWN"
      },
      {
        "id": "1a072099-29d5-48ba-b945-3475c9f263c9",
        "text": "Сыртқы сұраныстың әрбір жолына тәуелді және сыртқы кестенің бағандарын сілтеме ретінде қолданатын ішкі сұраныс"
      },
      {
        "id": "4daec8c9-8622-4615-a47b-e16724ea2aad",
        "text": "Жоқ, кез келген ДҚБЖ шексіз тереңдікті қолдайды"
      },
      {
        "id": "3be489c6-d1f3-49b1-b415-b3f42aab0af0",
        "text": "Анкерлік мүше (Anchor member) және рекурсивтік мүше (Recursive member)"
      },
      {
        "id": "50af7cb9-e0fc-4d94-822a-c133342f8383",
        "text": "Тек DDL деңгейінде жұмыс істейтін сұраныс"
      }
    ],
    "correctOptionIds": [
      "0df56061-39d7-4022-92a1-f8dc42ed4032"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "b01bfffe-df5c-4cf3-8aeb-1a13073c880f",
    "subjectId": "db",
    "text": "SELECT * FROM Products WHERE Price >= ALL (SELECT Price FROM Products); сұранысы не істейді?",
    "options": [
      {
        "id": "24ccf822-5761-41c9-9751-7ed9f10c7f94",
        "text": "Ең қымбат тауарларды (немесе бірнешеу болса, солардың бәрін) табады"
      },
      {
        "id": "26f53d13-1a87-4376-96cd-1987291a9fa5",
        "text": "Ең арзан тауарды табады"
      },
      {
        "id": "ba54d973-0781-44b6-844f-3fc6e4b436d6",
        "text": "Барлық тауарларды табады"
      },
      {
        "id": "086b770b-6013-4d2d-a83d-b6b2fd5c30fb",
        "text": "Бағасы орташа шамаға тең тауарларды табады"
      },
      {
        "id": "007d7d76-5286-4bba-b1ae-9f128df93a55",
        "text": "Ішкі сұраныс қайтарған барлық мәндермен шарт орындалса ғана true қайтарады"
      },
      {
        "id": "1691278f-75b3-4912-9c22-91bdd7b889cb",
        "text": "Сұраныс бос нәтиже қайтарады, өйткені NULL-мен салыстыру белгісіз мәнді береді"
      },
      {
        "id": "329b5e36-2634-4ed2-a22c-fb3073c8f3df",
        "text": "> ANY"
      },
      {
        "id": "265bd5fb-501b-4d10-981d-705394ab5ef0",
        "text": "Тек бірінші мәнмен салыстырады"
      }
    ],
    "correctOptionIds": [
      "24ccf822-5761-41c9-9751-7ed9f10c7f94"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "be4e28ce-c42d-4bee-9419-149167f7794f",
    "subjectId": "db",
    "text": "SELECT * FROM Products WHERE Price <= ALL (SELECT Price FROM Products); сұранысы не істейді?",
    "options": [
      {
        "id": "e615ee4d-09ca-43ac-b019-d235af7e59f6",
        "text": "Ең арзан тауарларды (немесе бірнешеу болса, солардың бәрін) табады"
      },
      {
        "id": "be09ac9e-229b-45de-aa16-aebd5b7b1970",
        "text": "Ең қымбат тауарды табады"
      },
      {
        "id": "90b08111-4505-44cd-9407-49a16194f03d",
        "text": "Тауарлардың бағасын сұрыптайды"
      },
      {
        "id": "507ed9d2-c420-467b-941d-7ddbc57793d7",
        "text": "Бос нәтиже қайтарады"
      },
      {
        "id": "d07dd56c-98e0-4f75-986a-0dcc789dcddf",
        "text": "Ол ешқандай ережеге бағынбайды"
      },
      {
        "id": "4b1ab1be-3168-4434-a320-8799e3740797",
        "text": "Тәуелсіз (Non-correlated) ішкі сұраныс"
      },
      {
        "id": "37e3ddd4-2a20-4d71-8575-697d88589900",
        "text": "Тек 100 деңгеймен шектеледі"
      },
      {
        "id": "92f3cf7e-f566-4f7d-bf98-e60b295d242a",
        "text": "Екеуі де бірдей қауіпті"
      }
    ],
    "correctOptionIds": [
      "e615ee4d-09ca-43ac-b019-d235af7e59f6"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "f15fc980-ab5a-4f54-b779-1d5c300929f4",
    "subjectId": "db",
    "text": "IN операторын (= ANY) байланыспаған қарапайым ішкі сұраныспен орындағанда, ДҚБЖ оны ішкі сұраныстың бірегей мәндер жиыны ретінде қалай қарастырады?",
    "options": [
      {
        "id": "6bd33bee-da83-4fbb-b4fc-fac8150078fc",
        "text": "Хэш-кесте (Hash Table) немесе индекс арқылы іздеуге оңтайландырады"
      },
      {
        "id": "6f81c014-ff22-47df-ab1c-5366b1eb1433",
        "text": "Әр жол үшін сызықтық іздеу жасайды"
      },
      {
        "id": "8953d22b-3ee3-42d1-bcee-903293ab10c8",
        "text": "Автоматты түрде транзакцияны бұғаттайды"
      },
      {
        "id": "69fcfbc0-182b-450d-8fa7-1e62c604c14f",
        "text": "Оны тек рекурсивті түрде орындайды"
      },
      {
        "id": "4c4a5d90-cb0e-4ef9-9951-ebb6b06590a1",
        "text": "NULL"
      },
      {
        "id": "c3a859f6-684c-4328-8654-788a2ebc74c8",
        "text": "Иә, тек SELECT * жазылуы тиіс"
      },
      {
        "id": "f94dcd00-f5da-4692-9005-25734bed5e73",
        "text": "ANY"
      },
      {
        "id": "494465e9-1023-457b-96e4-4a3db04239d7",
        "text": "Тапсырмалары жоқ жобаларды жояды"
      }
    ],
    "correctOptionIds": [
      "6bd33bee-da83-4fbb-b4fc-fac8150078fc"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "d91120b3-0823-4079-ad87-bbdb5dde7438",
    "subjectId": "db",
    "text": "SQL-де ішкі сұраныстарды қолданудың негізгі мақсаты не?",
    "options": [
      {
        "id": "74c12182-61bc-4d85-a412-bc5fbdfb007d",
        "text": "Бірнеше қадамдық логиканы бір сұраныс ішінде шешу және сұранысты икемді ету"
      },
      {
        "id": "68dcf83d-9b27-43a5-9bce-ca0276715864",
        "text": "Деректердің қауіпсіздік ережелерін орнату"
      },
      {
        "id": "9aa21ec9-c11c-4c78-80de-89925a811e8c",
        "text": "Дерекқордың файлдық өлшемін кішірейту"
      },
      {
        "id": "9521b9c6-49c1-4b83-88da-d23f02deb141",
        "text": "Кесте құрылымын автоматты түрде өзгерту"
      },
      {
        "id": "f34fa2eb-fd7b-4e14-ae10-f3d88abae6d2",
        "text": "Ішкі сұраныстардың қателікке ұшырап тоқтауы"
      },
      {
        "id": "3b72aa6f-d55b-4e39-9e22-119e83ac1d80",
        "text": "INSERT сұраныстарында"
      },
      {
        "id": "18e741bf-7f42-457b-b804-28a0144daf16",
        "text": "Correlated Subquery (байланысқан сұраныс)"
      },
      {
        "id": "48940055-3e46-42dc-ae8a-c2d1d4301708",
        "text": "Хэш-кесте (Hash Table) немесе индекс арқылы іздеуге оңтайландырады"
      }
    ],
    "correctOptionIds": [
      "74c12182-61bc-4d85-a412-bc5fbdfb007d"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "ac116591-526a-48c0-8129-8298bb57773a",
    "subjectId": "db",
    "text": "UPDATE Employees SET Salary = Salary * 1.1 WHERE DeptID IN (SELECT ID FROM Departments WHERE Name = 'IT'); сұранысы не істейді?",
    "options": [
      {
        "id": "49690d44-bc1a-4993-a792-189f16e7a451",
        "text": "IT департаментіндегі қызметкерлердің жалақысын 10%-ға өсіреді"
      },
      {
        "id": "738ad0d6-8e70-4579-89f4-d8ceb42cad1b",
        "text": "IT департаментіндегі қызметкерлердің жалақысын 1.1 теңгеге өсіреді"
      },
      {
        "id": "a1d119bd-92ab-4119-85bc-ab4f5cd41cc0",
        "text": "IT департаментін жабады"
      },
      {
        "id": "1b8615d4-ee5b-48d9-985b-f7ac9e9e9be3",
        "text": "Барлық қызметкерлердің жалақысын IT департаментінің бюджетіне теңейді"
      },
      {
        "id": "8e653649-4028-4baa-9473-28395b7211d4",
        "text": "Ешқашан орындалмайды"
      },
      {
        "id": "498c8abf-7021-4cf7-b3b6-80dc80fa6a2e",
        "text": "Транзакциялау"
      },
      {
        "id": "66ad58d5-c6ec-4827-9c22-238a40feb192",
        "text": "Екеуі де NULL мәндерді елемейді"
      },
      {
        "id": "149aeb9e-dfd3-4d02-aa1c-75e8acd18461",
        "text": "Қате тудырады"
      }
    ],
    "correctOptionIds": [
      "49690d44-bc1a-4993-a792-189f16e7a451"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "018e6dfc-c824-4da1-b866-5e2f7f46caa7",
    "subjectId": "db",
    "text": "DELETE FROM Tasks WHERE ProjectID NOT IN (SELECT ID FROM Projects); сұранысы не істейді?",
    "options": [
      {
        "id": "6061f52a-cd72-4e2a-a16a-8a1564f000aa",
        "text": "Қолданыстағы жобаларға тиесілі емес барлық тапсырмаларды жояды"
      },
      {
        "id": "66d50f4b-1195-426b-ae22-348ad1193dc6",
        "text": "Барлық жобаларды жояды"
      },
      {
        "id": "0611ddc4-4be5-41d7-a060-9b76cba299a5",
        "text": "Тапсырмалары жоқ жобаларды жояды"
      },
      {
        "id": "4863f864-9f34-4a12-9a46-66c84c93ecfd",
        "text": "Жаңа тапсырмалар қосады"
      },
      {
        "id": "311e24e3-20d8-4333-8de6-ea8a74fc524f",
        "text": "Барлық тауарларды табады"
      },
      {
        "id": "00a20aa3-ef63-4b88-9991-2329a8d8da79",
        "text": "NOT IN"
      },
      {
        "id": "1f6b79a3-e3f5-4299-a7cd-a02835aac36b",
        "text": "Орташа жалақының мөлшерін есептейді"
      },
      {
        "id": "dc08d646-4104-4449-91fb-6b08384b57d1",
        "text": "UNKNOWN (немесе NULL)"
      }
    ],
    "correctOptionIds": [
      "6061f52a-cd72-4e2a-a16a-8a1564f000aa"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "c114f51f-aa41-4161-933b-9db4f5345fa8",
    "subjectId": "db",
    "text": "FROM сөйлеміндегі ішкі сұраныстың (Derived Table) ішінде басқа кестелермен JOIN жасауға болады ма?",
    "options": [
      {
        "id": "2537510b-38c5-461e-82da-2482992cda2a",
        "text": "Иә, оны кез келген кәдімгі кесте сияқты қосуға және басқа кестелермен JOIN жасауға болады"
      },
      {
        "id": "281a1625-a99a-48b3-99c6-233b2ac3ff7a",
        "text": "Жоқ, Derived Table ішінде JOIN қолдануға мүлдем тыйым салынған"
      },
      {
        "id": "81dbf5ee-6f90-4948-824a-159971d0aef7",
        "text": "Тек INNER JOIN қолдануға рұқсат етіледі"
      },
      {
        "id": "ff1e7d62-3dfd-4cb0-93f3-15d8ec421192",
        "text": "Тек RIGHT JOIN қолдануға рұқсат етіледі"
      },
      {
        "id": "62c8c70d-c021-4c83-894d-0beb642e8295",
        "text": "Қате шығарады, себебі скалярлық сұранысты SELECT-те қолдануға болмайды"
      },
      {
        "id": "1d6fc7b4-f47c-45d9-a0d6-86f1bef431db",
        "text": "Сәйкес бағандарға индекстер (indexes) құру немесе оны JOIN-мен алмастыру"
      },
      {
        "id": "8a364bf5-f323-4c37-a05b-20b02cd4f2ea",
        "text": "Жобада Salary бағаны жоқ болса"
      },
      {
        "id": "a0514263-d09f-44ea-a0f0-f9f39678a5b1",
        "text": "Автоматты түрде транзакцияны бұғаттайды"
      }
    ],
    "correctOptionIds": [
      "2537510b-38c5-461e-82da-2482992cda2a"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "58769020-ff0e-4d2e-8fd2-9f03d10c2737",
    "subjectId": "db",
    "text": "Байланысқан ішкі сұранысты жазу кезінде сыртқы және ішкі кестелердің бағандарының аттары бірдей болса не істеу керек?",
    "options": [
      {
        "id": "61afa854-d6d9-46b5-a55e-d58bd15cecd4",
        "text": "Сыртқы кестеге алиас (атау) беріп, бағанды сол алиас арқылы нақты көрсету керек (мысалы, outer_table.column_name)"
      },
      {
        "id": "2ed91874-af7c-487c-90dd-bb5265978e58",
        "text": "Бағанның деректер типін өзгерту керек"
      },
      {
        "id": "3c90a618-9a06-4416-893a-9b4872a67e12",
        "text": "ДҚБЖ автоматты түрде реттейтіндіктен ештеңе істеу керек емес"
      },
      {
        "id": "6e3dc465-1595-4a92-a65e-b2f831d1f2b3",
        "text": "Қателік туындамауы үшін кестелердің бірін жою керек"
      },
      {
        "id": "28777bed-ca1c-4ca0-ae91-ef27096fd517",
        "text": "Екеуінің орындалу жылдамдығы бірдей"
      },
      {
        "id": "8e80fbb8-4a31-4481-8a39-93c6ac2162d6",
        "text": "Дерекқордың физикалық индексі"
      },
      {
        "id": "44237def-4f76-4b23-b65d-e783713060ed",
        "text": "NOT IN операторының"
      },
      {
        "id": "09257836-0a68-4612-bba8-b634922a8675",
        "text": "Жобада Salary бағаны жоқ болса"
      }
    ],
    "correctOptionIds": [
      "61afa854-d6d9-46b5-a55e-d58bd15cecd4"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "044b59e9-4650-4f5c-907f-21389addd9a6",
    "subjectId": "db",
    "text": "Скалярлық ішкі сұраныс (Scalar Subquery) SQL-де салыстыру операторының (например, =, <, >) қай жағында орналаса алады?",
    "options": [
      {
        "id": "164090af-41ad-438f-8298-d4091e000279",
        "text": "Оң жағында да, сол жағында да орналаса алады"
      },
      {
        "id": "81509000-c94b-4626-b5b7-b75a1d741c9d",
        "text": "Тек оң жағында ғана орналасуы тиіс"
      },
      {
        "id": "ffcaf1a1-a138-440e-b85d-87d36950ae7a",
        "text": "Тек сол жағында ғана орналасуы тиіс"
      },
      {
        "id": "ac1748a6-1de6-4e81-95bc-2169c03ac803",
        "text": "Салыстыру операторларымен бірге қолданылуы мүмкен емес"
      },
      {
        "id": "a60bbcea-f623-4c72-a338-9c22eb893f9d",
        "text": "JOIN тиімдірек, себебі ДҚБЖ оны оңтайлырақ жоспарлайды"
      },
      {
        "id": "bb55cc17-36e2-4092-bf1f-b3ed8388b44a",
        "text": "Әр студенттің жеке ең жоғары балын табады"
      },
      {
        "id": "a0d614a0-2454-4f33-9a38-129974be02ea",
        "text": "Кестелердің сақтық көшірмесін жасау үшін"
      },
      {
        "id": "3893ecd4-beb8-4f68-b429-454372c9d054",
        "text": "Жоқ, кез келген ДҚБЖ шексіз тереңдікті қолдайды"
      }
    ],
    "correctOptionIds": [
      "164090af-41ad-438f-8298-d4091e000279"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "2ec93219-d426-4117-8cca-e5192d452144",
    "subjectId": "db",
    "text": "SELECT * FROM Employees WHERE Salary > (SELECT Salary FROM Employees WHERE Name = 'John'); сұранысында неліктен қате туындауы мүмкін?",
    "options": [
      {
        "id": "1606f1a9-a3b3-4f88-a7bc-ba331f0ecaf3",
        "text": "Егер 'John' есімді қызметкерлер саны бірден көп болса, скалярлық салыстыру қатесін береді"
      },
      {
        "id": "e837f5fa-fce5-480c-8771-5a9facd3831a",
        "text": "Жобада Salary бағаны жоқ болса"
      },
      {
        "id": "553f6575-334b-46d3-a1b0-d05ba66798b7",
        "text": "Орташа жалақы есептелмегендіктен"
      },
      {
        "id": "3f6e0637-5c78-4939-89c1-a26112dabb71",
        "text": "Ешқандай қате туындамайды"
      },
      {
        "id": "46df3020-e07d-4c06-8acf-9229e7f61737",
        "text": "Ішкі сұраныс тек бір жол қайтаруы тиіс"
      },
      {
        "id": "d652b881-e05d-41c5-abc3-88a8fb24d473",
        "text": "Әрбір студент жолының жанында барлық тесттердің ең жоғары балын қайталайды"
      },
      {
        "id": "408ceae8-ba6d-4b8d-8b19-69a68f284df1",
        "text": "Тәуелсіз немесе қарапайым ішкі сұраныс (Non-correlated subquery)"
      },
      {
        "id": "0736f284-fa97-46b6-9df0-5c6d01d9004d",
        "text": "Тапсырмалары жоқ жобаларды жояды"
      }
    ],
    "correctOptionIds": [
      "1606f1a9-a3b3-4f88-a7bc-ba331f0ecaf3"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "b7d54693-7b67-4348-9456-3ca548d7b55f",
    "subjectId": "db",
    "text": "EXISTS операторының орнына IN операторын қолданғанда, олардың қайсысы NULL мәндері бар кестелерде қауіпсіз жұмыс істейді?",
    "options": [
      {
        "id": "3a5d77e1-18f2-4ef9-9c40-0a8f6de32430",
        "text": "EXISTS операторы қауіпсіз, өйткені ол үш мәнді логикаға (three-valued logic) тәуелді емес"
      },
      {
        "id": "fa190eb4-bf27-456a-93cc-e79d12549416",
        "text": "IN операторы қауіпсіз"
      },
      {
        "id": "f736318d-8397-48c9-b522-fbd31ff300a9",
        "text": "Екеуі де бірдей қауіпті"
      },
      {
        "id": "b7a6f91d-1045-48df-a62d-851e463bff46",
        "text": "Екеуі де NULL мәндерді елемейді"
      },
      {
        "id": "36ab91d4-cf37-4043-ab65-db7995256da7",
        "text": "CREATE сұраныстарында"
      },
      {
        "id": "99ed4213-99ca-42d8-a011-395f862f54fb",
        "text": "Оны тек рекурсивті түрде орындайды"
      },
      {
        "id": "4d14d9b2-e0e2-415a-880f-3bc93934c68f",
        "text": "Нормализация"
      },
      {
        "id": "cfafdd3a-239f-4ebc-ab4a-c376785f522f",
        "text": "Тек бірінші баған ғана сақталады"
      }
    ],
    "correctOptionIds": [
      "3a5d77e1-18f2-4ef9-9c40-0a8f6de32430"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  },
  {
    "id": "bcc50ab9-a47c-41b3-99c4-bce1570f8974",
    "subjectId": "db",
    "text": "Сыртқы сұраныс жойылғанда (DELETE), ішкі сұраныс сыртқы сұраныспен байланысқан болса, өшіру әрекеті қалай жүреді?",
    "options": [
      {
        "id": "a46ba307-74e9-4fc8-88fe-5eb9d532d292",
        "text": "ДҚБЖ әрбір өшірілетін жол үшін ішкі сұранысты қайта орындап тексереді"
      },
      {
        "id": "3f5b7e45-f500-49f0-83a6-7f2c5f8f8d3d",
        "text": "Барлық жолдарды бірден өшіреді"
      },
      {
        "id": "9326b86b-c7f8-457f-bc85-9bfb30712809",
        "text": "Ішкі сұраныс орындалмай қалады"
      },
      {
        "id": "553982c7-8e16-42d5-902a-43d6894d35b0",
        "text": "Тек бірінші жолды өшіреді"
      },
      {
        "id": "2dc375c3-3546-4e52-adea-fc431aaa37bd",
        "text": "Тек DDL деңгейінде жұмыс істейтін сұраныс"
      },
      {
        "id": "04f86694-f1fb-458b-8f60-4afae34b6999",
        "text": "Уақытша кесте"
      },
      {
        "id": "7aa24b69-c43b-4caa-9bdd-ef880248d778",
        "text": "Кортеждік сұраныс"
      },
      {
        "id": "0b8d6c6c-4ca4-46e0-b4c2-7dd5627428b6",
        "text": "Ол тек бір баған және ең көп дегенде бір жол (жалғыз мән) қайтаруы керек"
      }
    ],
    "correctOptionIds": [
      "a46ba307-74e9-4fc8-88fe-5eb9d532d292"
    ],
    "type": "MULTIPLE",
    "topic": "Ішкі және байланысқан SQL",
    "difficulty": "medium"
  }
] as Question[];
