import { Question } from '../../../../types';

// db / Нормализация
export const db10NormalizationQuestions = [
  {
    "id": "114491a2-00f7-4e6f-af7a-cd61b9048986",
    "subjectId": "db",
    "text": "Кандидат кілт дегеніміз не?",
    "options": [
      {
        "id": "5b366250-63a3-45e6-a256-b27e98656c88",
        "text": "Индекс"
      },
      {
        "id": "8e502463-585d-47d8-8092-385887c17f4f",
        "text": "Жазбаны бірегей анықтай алатын минималды атрибуттар жиыны"
      },
      {
        "id": "e1bdaa56-6eff-4117-96aa-7af5d2ba8cfa",
        "text": "Foreign Key"
      },
      {
        "id": "ff547df6-9393-4e7c-888f-221e79da9ecf",
        "text": "Кез келген атрибут"
      },
      {
        "id": "6d2498c1-a51d-41b6-a557-f2a6612bff68",
        "text": "Толық тәуелділік"
      },
      {
        "id": "48a103cc-783c-42b1-ae52-74d278513e4d",
        "text": "X -> Z"
      },
      {
        "id": "137a2fd7-d4dd-4660-9136-0e82823dfd3c",
        "text": "Кестелердің санын азайту үшін"
      },
      {
        "id": "56deb8dd-261a-4328-bbe9-a9b0abfad60e",
        "text": "Көп мәнді атрибуттар бар"
      }
    ],
    "correctOptionIds": [
      "8e502463-585d-47d8-8092-385887c17f4f"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "33a577ba-b974-4c63-94f5-c9e745e92f01",
    "subjectId": "db",
    "text": "Транзитивті тәуелділік дегеніміз не?",
    "options": [
      {
        "id": "53f2395e-33cb-49d4-81ff-e3858e0c99a3",
        "text": "Кілтке тәуелділік"
      },
      {
        "id": "7f6b70ee-8ff0-4af6-945d-efbb0d3f9db0",
        "text": "Жартылай тәуелділік"
      },
      {
        "id": "9ff42e53-b023-4fd6-8ffc-f5ffc6e6f45e",
        "text": "Тікелей тәуелділік"
      },
      {
        "id": "ce522922-9f14-4d1c-957b-25ba1c92812d",
        "text": "A → B, ал B → C болса, A → C"
      },
      {
        "id": "bdac9d45-5fe5-4f99-94a4-cc83c88a0006",
        "text": "Кестенің ең бірінші бағаны"
      },
      {
        "id": "8c72dcd6-6d38-4fa5-9a38-3decb89b4c2d",
        "text": "Армстронг аксиомаларының көмегімен F жиынтығынан шығарылатын барлық функционалдық тәуелділіктер жиыны"
      },
      {
        "id": "978584b8-0591-4522-9aed-0ce02393163b",
        "text": "Кестелердің санын азайту үшін"
      },
      {
        "id": "a46e1b4e-251d-4c79-a1e3-10fcd506531e",
        "text": "Рефлексивтілік (Reflexivity)"
      }
    ],
    "correctOptionIds": [
      "ce522922-9f14-4d1c-957b-25ba1c92812d"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "421684e7-ce73-4790-803c-fb7b0aa2f8e6",
    "subjectId": "db",
    "text": "4NF қандай тәуелділікті жояды?",
    "options": [
      {
        "id": "73c35902-3e45-473e-b13a-b764b07d5dca",
        "text": "Транзитивті тәуелділік"
      },
      {
        "id": "db27f688-a2ea-401a-8b06-7fae4a35af61",
        "text": "Жартылай тәуелділік"
      },
      {
        "id": "e3f0d52d-e677-43c3-9a08-21a794500a2a",
        "text": "Функционалдық тәуелділік"
      },
      {
        "id": "e7100bf9-71cf-497b-8976-5d99b9c46d7d",
        "text": "Көп мәнді тәуелділік"
      },
      {
        "id": "44f583ed-8a81-49c1-8a31-ec72f53ee07f",
        "text": "Онда ешқандай бастапқы кілт болмаса"
      },
      {
        "id": "e4c9c3d6-200b-4e1d-9d32-07736ed7b55f",
        "text": "Сыртқы атрибуттар"
      },
      {
        "id": "80cc87c1-42c1-44be-a5fc-f6a0f42387c4",
        "text": "Егер X -> YZ болса, онда X -> Y және X -> Z орындалады"
      },
      {
        "id": "dbc995c3-2ef8-40e0-87aa-55ebb79ae673",
        "text": "Схема (Schema)"
      }
    ],
    "correctOptionIds": [
      "e7100bf9-71cf-497b-8976-5d99b9c46d7d"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "52bf552a-b0b3-4c98-a6c9-f9cfe58c226c",
    "subjectId": "db",
    "text": "Нормализация дегеніміз не?",
    "options": [
      {
        "id": "1d552f65-2722-4f83-9786-a35347f69ecf",
        "text": "Артық деректерді азайту процесі"
      },
      {
        "id": "4b9f3d4f-5d64-4cb4-af8b-b02839b7a3f7",
        "text": "Деректерді сақтау"
      },
      {
        "id": "6845bcfb-f670-4ace-8259-7d938d24ff0b",
        "text": "Деректерді жою"
      },
      {
        "id": "e55f6d36-6e1e-48d0-a233-a60182aa4038",
        "text": "Деректерді шифрлау"
      },
      {
        "id": "6e84f444-a374-49ae-b649-cf556b3dc4e5",
        "text": "Мәндері тек NULL болатын баған"
      },
      {
        "id": "1ba53c6e-275f-4f49-b2d2-357034475762",
        "text": "Кестедегі индекстердің жетіспеушілігі"
      },
      {
        "id": "837d122e-aabd-4d3b-adc5-e7d5be954aa9",
        "text": "Кестелердің шексіз санын"
      },
      {
        "id": "27b08d12-a72b-4b8a-babf-85e047f288f0",
        "text": "Оның барлық ұяшықтарында тек скалярлық (атомды) мәндер сақталып, массивтер немесе жиынтықтар болмаса"
      }
    ],
    "correctOptionIds": [
      "1d552f65-2722-4f83-9786-a35347f69ecf"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "5ab143b0-dea7-44fe-9fdf-ebc72f1504b1",
    "subjectId": "db",
    "text": "Жартылай функционалдық тәуелділік дегеніміз не?",
    "options": [
      {
        "id": "1846a42f-8fd5-48f1-8736-c9c5dd01c2bd",
        "text": "Атрибут құрама кілттің бір бөлігіне тәуелді"
      },
      {
        "id": "42ef705d-fe8a-4f8a-af15-417c882f9dba",
        "text": "Транзитивті тәуелділік"
      },
      {
        "id": "6e060fe5-8ab8-41f5-bd58-b5a10e4fe0ae",
        "text": "Атрибут барлық кілтке тәуелді"
      },
      {
        "id": "70242ef0-664b-4519-957c-d5c2fe4dba87",
        "text": "Кілтсіз тәуелділік"
      },
      {
        "id": "582b1d90-1856-4b96-b4f2-f15ef2e9f1f6",
        "text": "Тегі"
      },
      {
        "id": "14c498e6-6c59-40e4-9496-b09a39487b27",
        "text": "Кесте 2NF-те болуы және кілттік емес атрибуттар арасында транзитивті тәуелділік болмауы тиіс"
      },
      {
        "id": "d7f9c02f-7c99-48a0-aa0b-ac72235c3f56",
        "text": "Мүлдем сақталмауы керек"
      },
      {
        "id": "2094a813-ffd9-45f3-82cd-3c0fc9764ccc",
        "text": "Кестелердің санын азайту үшін"
      }
    ],
    "correctOptionIds": [
      "1846a42f-8fd5-48f1-8736-c9c5dd01c2bd"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "5e277615-7e55-46cd-b150-35ad3d3fbbfe",
    "subjectId": "db",
    "text": "Атомарлы мән дегеніміз не?",
    "options": [
      {
        "id": "24bb702e-dc44-41a1-9838-d0c0cdb6048f",
        "text": "Көп мәнді атрибут"
      },
      {
        "id": "44500387-49f8-48ef-a652-0cedf0af6250",
        "text": "Бөлуге болатын мән"
      },
      {
        "id": "9a15c216-e0f8-4576-955c-5a01bff3232c",
        "text": "Бөлуге болмайтын ең қарапайым мән"
      },
      {
        "id": "b3633475-24f9-4b03-9dd2-52bbf91c07c8",
        "text": "Күрделі атрибут"
      },
      {
        "id": "d00eef56-34ce-469b-bd62-9c46692c32bc",
        "text": "Транзитивті тәуелділік"
      },
      {
        "id": "13db428a-b86b-49f6-924d-66385d9bca53",
        "text": "1NF + көп мәнді атрибуттар жоқ"
      },
      {
        "id": "0e147f9a-1b53-4aeb-9814-bc7e187404e9",
        "text": "Ең көп қолданылатын сыртқы кілт"
      },
      {
        "id": "992d458b-059e-42d2-8b06-258985645c3a",
        "text": "Y атрибуты X-тің кез келген бір бөлігіне тәуелді болса"
      }
    ],
    "correctOptionIds": [
      "9a15c216-e0f8-4576-955c-5a01bff3232c"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "6b7884b2-e2fc-4840-a475-1108e2da7ed3",
    "subjectId": "db",
    "text": "Жаңарту аномалиясы (update anomaly) дегеніміз не?",
    "options": [
      {
        "id": "1004e26d-f94e-4cb5-b148-b7afb23cb57a",
        "text": "Дерек қосу мүмкін емес"
      },
      {
        "id": "88ca9bef-8631-4c26-a1aa-759245d55362",
        "text": "Бір деректі өзгерту үшін көп жерде өзгерту керек"
      },
      {
        "id": "b1fe3f1c-cd1c-4bc7-a26d-4fe6cfff7d4c",
        "text": "Іздеу баяу"
      },
      {
        "id": "f75c2b83-6122-47ef-993d-ca91af8c9b0b",
        "text": "Дерек жою мүмкін емес"
      },
      {
        "id": "4f472c87-09e4-4c60-ad1f-3470d606ace1",
        "text": "Транзитивті тәуелділіктерді жеке кестеге шығару"
      },
      {
        "id": "c6dfaae6-5259-49d2-bc35-85fedd8116f2",
        "text": "Деректерді жою"
      },
      {
        "id": "3661bb5c-4f75-4299-9211-70fb8c833270",
        "text": "Деректерді шифрлау"
      },
      {
        "id": "b8755ad9-625a-460f-9db0-dc653ec1e99a",
        "text": "Жазбаны бірегей анықтай алатын минималды атрибуттар жиыны"
      }
    ],
    "correctOptionIds": [
      "88ca9bef-8631-4c26-a1aa-759245d55362"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "95815cdd-7f98-4167-bbc9-23badad68d6f",
    "subjectId": "db",
    "text": "1NF қандай шартты талап етеді?",
    "options": [
      {
        "id": "02418b26-1ec8-409e-a7c3-24f53d809d72",
        "text": "Индекстер болуы керек"
      },
      {
        "id": "36842ca1-4720-44f3-b97c-a18266c344cd",
        "text": "Foreign Key болуы керек"
      },
      {
        "id": "37e48faa-6049-4ead-90d3-9dd4a3f92da9",
        "text": "Барлық атрибуттар атомарлы болуы керек"
      },
      {
        "id": "74e3f6cc-5313-4740-9263-b162625838ec",
        "text": "Транзакциялар болуы керек"
      },
      {
        "id": "e3a1e606-3514-4b7a-9d96-94cf29172026",
        "text": "Ешқандай қасиет сақталмайды"
      },
      {
        "id": "a18a7403-f1fc-4279-b5ee-acac8c8d9d9e",
        "text": "Суррогаттық кілт"
      },
      {
        "id": "5407f689-492b-4df2-addc-e8f4d09f26d9",
        "text": "Деректердің тым көп қайталануын (redundancy) және сәйкессіздікті"
      },
      {
        "id": "75a2e758-1dc0-4619-a8c9-7efeaae921b8",
        "text": "Транзитивті қалыпты форма"
      }
    ],
    "correctOptionIds": [
      "37e48faa-6049-4ead-90d3-9dd4a3f92da9"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "9a23facd-e0a9-43f8-bb54-f3cf6d2442ee",
    "subjectId": "db",
    "text": "Кірістіру аномалиясы (insertion anomaly) дегеніміз не?",
    "options": [
      {
        "id": "11677fcb-e981-4e22-9c75-c62ae795eb42",
        "text": "Деректі жою қиын"
      },
      {
        "id": "5b629d6a-cd8e-4f35-bedc-49196b162987",
        "text": "Деректі жаңарту қиын"
      },
      {
        "id": "bead6e75-cc04-419d-98b8-49f0f7858640",
        "text": "Іздеу қиын"
      },
      {
        "id": "d11de6ff-10e0-4593-a254-2eb2a0cfa9aa",
        "text": "Қосымша ақпаратсыз жаңа дерек қосу мүмкін емес"
      },
      {
        "id": "3630dce0-1c7b-4cac-90fb-906ad2755003",
        "text": "X ~> Y"
      },
      {
        "id": "002a2373-a570-4b5e-a1dc-3f6b3e470cb0",
        "text": "SQL сұраныстарының санын көбейту"
      },
      {
        "id": "dbc9fd6d-48fc-478d-af55-89195735c49e",
        "text": "Y мәні X-ке функционалды тәуелді"
      },
      {
        "id": "b8ad08b8-41f7-4eaa-9cc2-0d5a68ec6ef2",
        "text": "Кестеде сыртқы кілттің болуы"
      }
    ],
    "correctOptionIds": [
      "d11de6ff-10e0-4593-a254-2eb2a0cfa9aa"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "a25ef975-d07e-4aba-9b40-2d5708f7d5f3",
    "subjectId": "db",
    "text": "3NF шарты қандай?",
    "options": [
      {
        "id": "4a5cf0f5-198d-43a2-a292-640ad4e4730e",
        "text": "Атомарлы мәндер"
      },
      {
        "id": "7739dcad-e17c-4ab3-a521-8703af18dd43",
        "text": "BCNF"
      },
      {
        "id": "7f94398b-3a96-4f56-9a48-bcb9640b7f80",
        "text": "Жартылай тәуелділік жоқ"
      },
      {
        "id": "a6afbf81-e3cf-4896-823d-f5362c2dd45c",
        "text": "2NF + транзитивті тәуелділік жоқ"
      },
      {
        "id": "b41a58d9-30f1-4b2e-9a25-4f777f5cce5f",
        "text": "Біріншілік емес атрибут"
      },
      {
        "id": "1e12e180-15be-4439-9a2e-88f5094748cf",
        "text": "Әрбір детерминант кандидат кілт болуы керек"
      },
      {
        "id": "1a84a26b-2fbc-4e4c-aaa3-12dfe417ec42",
        "text": "Көп мәнді тәуелділік"
      },
      {
        "id": "b003a4c4-976b-4a93-bfd7-3d212c9dc79a",
        "text": "Кестелерді біріктіргенде сұраныс уақытының жоғалмауын"
      }
    ],
    "correctOptionIds": [
      "a6afbf81-e3cf-4896-823d-f5362c2dd45c"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "a7facef5-0418-4a09-9826-719592203952",
    "subjectId": "db",
    "text": "Денормализация не үшін қолданылады?",
    "options": [
      {
        "id": "1ad15a0b-695f-4144-baee-c38d6677753b",
        "text": "Деректерді жою"
      },
      {
        "id": "38f9c32a-b08a-4eb0-8eb0-e89f9394c220",
        "text": "Қауіпсіздікті арттыру"
      },
      {
        "id": "a6a5d359-8464-4f27-af9a-f15cce0b282f",
        "text": "Кестелерді бөлу"
      },
      {
        "id": "f47ecf2b-1400-4534-85d2-82ca4e3b49a0",
        "text": "Өнімділікті арттыру үшін"
      },
      {
        "id": "1edf31c6-aa95-453b-aeea-1ce94c744495",
        "text": "Кестеге бір уақытта екі жол қоса алмау қатесі"
      },
      {
        "id": "a0901c09-7602-4f85-acac-e1a1f87daeea",
        "text": "Y тек бірегей мәндерді қамтыса"
      },
      {
        "id": "895c985e-a56b-41e3-bd08-8770ca136065",
        "text": "Қатынас (Relation)"
      },
      {
        "id": "7fe87933-acd3-4097-b238-ec04192e0ffb",
        "text": "X бойынша сұрыптау"
      }
    ],
    "correctOptionIds": [
      "f47ecf2b-1400-4534-85d2-82ca4e3b49a0"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "b23085a2-1c20-4460-b99b-92f1b73bdd22",
    "subjectId": "db",
    "text": "Суперкілт дегеніміз не?",
    "options": [
      {
        "id": "25a457a2-126a-40bb-847f-159081e36f6b",
        "text": "Жазбаны бірегей анықтайтын кез келген атрибуттар жиыны"
      },
      {
        "id": "7fc947ab-b805-4024-a43f-f247c4ef3ace",
        "text": "Атомарлы атрибут"
      },
      {
        "id": "f2fd5f2f-dcc5-4acd-9c21-552c27776d29",
        "text": "Foreign Key"
      },
      {
        "id": "fc5c3b34-fbf1-4b24-a62a-1e36a5458553",
        "text": "Минималды кілт"
      },
      {
        "id": "f25f3ead-916a-4d76-9683-d4b8f654115e",
        "text": "Егер кестеде бірнеше қиылысатын құрама кандидаттық кілттер болса"
      },
      {
        "id": "1624b625-10c3-4399-aeca-12ebd1fbfdd7",
        "text": "Іздеу баяу"
      },
      {
        "id": "849a6af0-f0e7-406c-918d-4faf4a41e09b",
        "text": "1NF + көп мәнді атрибуттар жоқ"
      },
      {
        "id": "ae1e4d02-7bcd-4cb4-b0e0-2bc096cb628f",
        "text": "Кестеден бір деректі жойған кезде оған тәуелсіз басқа да маңызды ақпараттың қоса жойылып кетуі"
      }
    ],
    "correctOptionIds": [
      "25a457a2-126a-40bb-847f-159081e36f6b"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "bb78ca8b-e116-4e91-b8da-ca8f2b4ea1e5",
    "subjectId": "db",
    "text": "Жою аномалиясы (deletion anomaly) дегеніміз не?",
    "options": [
      {
        "id": "0c347093-4621-4af1-a3c1-2e38fe48c552",
        "text": "Іздеу нәтижесі қате"
      },
      {
        "id": "56b06c6d-d686-458c-84b6-fae3fc1c8dc1",
        "text": "Дерек жою кезінде қажетті ақпарат жоғалады"
      },
      {
        "id": "a339469a-085c-4d46-93c6-33e05f92f4a3",
        "text": "Дерек жаңарту қиын"
      },
      {
        "id": "bbd1e0d3-5b69-44ae-a9ef-55be4b4f747d",
        "text": "Дерек қосу қиын"
      },
      {
        "id": "3e0ce72f-8e3b-4189-8fae-5aad50c90507",
        "text": "Бейтривиалды тәуелділік"
      },
      {
        "id": "ad986f56-f22f-4a0d-9b72-fe60c9a36078",
        "text": "Сыртқы кілттің мәнін өзгерте алмау"
      },
      {
        "id": "114495ea-3b8c-470c-ae6d-2d296a36e64c",
        "text": "Көп мәнді атрибуттар бар"
      },
      {
        "id": "f7dff4c3-bfb5-4bfc-9b24-fdeb76323f57",
        "text": "Функционалдық тәуелділік"
      }
    ],
    "correctOptionIds": [
      "56b06c6d-d686-458c-84b6-fae3fc1c8dc1"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "c032e569-36b5-4edb-9f22-fb7c2921bc92",
    "subjectId": "db",
    "text": "BCNF (Бойс-Кодд) формасының ерекшелігі не?",
    "options": [
      {
        "id": "35a3bb01-6c08-4a9d-8b2c-3c983064d773",
        "text": "Көп мәнді атрибуттар бар"
      },
      {
        "id": "3f6a8034-450d-4496-a4bc-7d761a985296",
        "text": "Транзитивті тәуелділік бар"
      },
      {
        "id": "b75dcb68-c39f-4318-94a8-2942419b4de9",
        "text": "Әрбір детерминант кандидат кілт болуы керек"
      },
      {
        "id": "face800e-0755-4794-9497-b0c7d31fe8e1",
        "text": "Тек атомарлы мәндер"
      },
      {
        "id": "311c380d-0757-4681-9dfa-74ff3fa4e07a",
        "text": "Кесте құрылымын жоюды білдіреді"
      },
      {
        "id": "9ac2e31d-6c7b-4f30-9815-b19f71dad452",
        "text": "Кілтке тәуелділік"
      },
      {
        "id": "34957401-320f-480a-8d6d-578ca441a83b",
        "text": "Аты"
      },
      {
        "id": "a54019bb-3829-4e11-8c36-6090d29df35c",
        "text": "В бастапқы кілт болып табылады"
      }
    ],
    "correctOptionIds": [
      "b75dcb68-c39f-4318-94a8-2942419b4de9"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "d4772607-2a7b-484e-ae0b-ca6277ead658",
    "subjectId": "db",
    "text": "Денормализацияның кемшілігі не?",
    "options": [
      {
        "id": "76c4cbe4-e562-4931-8e76-7ffe486e35bd",
        "text": "Кестелер азаяды"
      },
      {
        "id": "7f49dc63-04b6-4879-b6af-faa1948602ba",
        "text": "Жылдамдық артады"
      },
      {
        "id": "98a77348-7038-45b3-860e-b95c5f408a2f",
        "text": "Артық деректер мен аномалиялар пайда болады"
      },
      {
        "id": "c66ff0ee-f4b6-43ce-ac04-ece9303bcd1e",
        "text": "Индекс қажет емес"
      },
      {
        "id": "ba2382c7-3025-4930-a1a6-fe11d0ac8a07",
        "text": "Кестелерді ыдыратуға (decomposition)"
      },
      {
        "id": "e9fe7a8d-afa7-4651-8433-3e90e0427438",
        "text": "Жазбаны бірегей анықтай алатын минималды атрибуттар жиыны"
      },
      {
        "id": "dfdb68bb-21a4-4a83-bf34-417553708ae9",
        "text": "Ішінара тәуелділік"
      },
      {
        "id": "6cba47bd-7725-4f8f-9a87-f5e0476123cf",
        "text": "Транзитивті тәуелділіктердің болуы"
      }
    ],
    "correctOptionIds": [
      "98a77348-7038-45b3-860e-b95c5f408a2f"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "d77e836e-ed7a-43c5-814c-e0831f58ced6",
    "subjectId": "db",
    "text": "X → Y жазуы нені білдіреді?",
    "options": [
      {
        "id": "8c580216-2d86-466a-a4e0-eed6fe138b48",
        "text": "X Y-ға тең емес"
      },
      {
        "id": "a16ea78d-18e8-4ca4-8300-a644c8c89ad1",
        "text": "X бойынша сұрыптау"
      },
      {
        "id": "acfc0cea-8029-472d-96a3-ea72e7eba49f",
        "text": "Y мәні X-ке функционалды тәуелді"
      },
      {
        "id": "c7e04f8f-17d5-41f9-95c7-b7adf424c049",
        "text": "X пен Y тәуелсіз"
      },
      {
        "id": "720983d2-ccbe-4a13-a1a6-c5a5099e760a",
        "text": "Кестелерді бөлу"
      },
      {
        "id": "78849da5-c156-4031-b798-824a270eaa26",
        "text": "Кестеде сыртқы кілт мүлдем болмауы тиіс"
      },
      {
        "id": "6a9a7c58-fc66-4c9f-8afb-03f3953b93ac",
        "text": "Кестенің ең бірінші бағаны"
      },
      {
        "id": "a5f94c27-f6cb-43f7-a202-9d15ffcf7a07",
        "text": "Y атрибуты X-ке тәуелді болып, бірақ X-тің ешқандай ішкі жиынына тәуелді болмаса"
      }
    ],
    "correctOptionIds": [
      "acfc0cea-8029-472d-96a3-ea72e7eba49f"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "d8130e33-027d-4462-a1be-7108859449d8",
    "subjectId": "db",
    "text": "2NF шарты қандай?",
    "options": [
      {
        "id": "1a98f86e-9f58-40d5-93c7-7f0b1984d935",
        "text": "BCNF + атомарлы мәндер"
      },
      {
        "id": "5949b6ca-0bb2-477a-b6e6-93e2661d8148",
        "text": "1NF + жартылай функционалдық тәуелділік жоқ"
      },
      {
        "id": "ea97c4b6-03e5-49d3-abe3-5938ca28aa42",
        "text": "1NF + көп мәнді атрибуттар жоқ"
      },
      {
        "id": "f342bdff-893f-4c8a-9cfc-88a25b769efa",
        "text": "Транзитивті тәуелділік жоқ"
      },
      {
        "id": "603cb1bf-bbc4-4b9e-a95b-24842f660fec",
        "text": "А-ның әрбір мәніне В-ның тек бір ғана мәні сәйкес келеді"
      },
      {
        "id": "130a05ac-dac3-4d8d-84c0-fa3e207e4c17",
        "text": "Әрбір детерминант кандидат кілт болуы керек"
      },
      {
        "id": "2e070605-ac82-4c8e-9640-f878bfc9cbe0",
        "text": "X-тің бір мәніне Y-тің тек бір ғана мәні сәйкес келеді"
      },
      {
        "id": "d3412a8f-ff63-4d9c-8ff8-9645c3c9e8ee",
        "text": "Сыртқы кілттің орындалуын тексеру үшін"
      }
    ],
    "correctOptionIds": [
      "5949b6ca-0bb2-477a-b6e6-93e2661d8148"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "e3e86c12-9835-4d6a-be44-cbf709198beb",
    "subjectId": "db",
    "text": "Нормализацияның негізгі мақсаты не?",
    "options": [
      {
        "id": "247e53db-83a5-452b-a01e-893edce7f970",
        "text": "Сұраныс жылдамдығын арттыру"
      },
      {
        "id": "492432c5-a1e6-4065-b764-ca522257ea79",
        "text": "Артық деректер мен аномалияларды азайту"
      },
      {
        "id": "d7d94cab-d422-4438-a373-82b65ad284cb",
        "text": "Деректерді шифрлау"
      },
      {
        "id": "e8d2c3c0-abcb-4f39-9fe0-f238400f113f",
        "text": "Кестелерді көбейту"
      },
      {
        "id": "56930856-a11b-4daa-b3a5-be335ab39584",
        "text": "Кестеде сыртқы кілт мүлдем болмауы тиіс"
      },
      {
        "id": "0cf8ea7f-84a5-4c7b-b917-4591797283b4",
        "text": "Домендік-кілттік қалыпты форма (DKNF)"
      },
      {
        "id": "6bceddb2-a071-4ea1-885f-bf9abc0eefef",
        "text": "X Y-ға тең емес"
      },
      {
        "id": "b4438c52-f356-4cd1-aee9-c21ac5f08b2e",
        "text": "Деректі жаңарту қиын"
      }
    ],
    "correctOptionIds": [
      "492432c5-a1e6-4065-b764-ca522257ea79"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "ea7b5ca8-0754-4baa-a48c-4f8ad753c68c",
    "subjectId": "db",
    "text": "1NF-ті бұзатын мысал қандай?",
    "options": [
      {
        "id": "0b15d5c1-4604-4fa4-be13-e496ec49334b",
        "text": "Foreign Key бар"
      },
      {
        "id": "432bbecb-3de1-4bfc-990d-de89f5ed4fc6",
        "text": "Әр ұяшықта бір мән"
      },
      {
        "id": "73e6a1ee-e967-4aef-9208-ae8fd8ea5ab4",
        "text": "Primary Key бар"
      },
      {
        "id": "c7931a15-e9e3-4be5-8db8-bec5cb759070",
        "text": "Бір ұяшықта бірнеше телефон нөмірі"
      },
      {
        "id": "410dbdfe-4e26-4352-9c4f-0c4dfd31a36f",
        "text": "Атомарлы мәндер"
      },
      {
        "id": "44351e2d-210d-46e8-8c09-97c01746fbba",
        "text": "Рефлексивтілік (Reflexivity)"
      },
      {
        "id": "2f114b0a-5247-4e52-937e-7f543bb44f2f",
        "text": "Тек сандық кестелерде ғана сақталады"
      },
      {
        "id": "a7f58238-8001-44e8-a3d8-73c03af470a9",
        "text": "Питер Чен"
      }
    ],
    "correctOptionIds": [
      "c7931a15-e9e3-4be5-8db8-bec5cb759070"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "616af217-0f62-4fcd-9fa6-d03267346a55",
    "subjectId": "db",
    "text": "3NF (Үшінші қалыпты форма) шарты қандай?",
    "options": [
      {
        "id": "9ca1b6ea-7d7e-4411-82a8-4dab0174491c",
        "text": "Кесте 2NF-те болуы және кілттік емес атрибуттар арасында транзитивті тәуелділік болмауы тиіс"
      },
      {
        "id": "d858e47d-c21e-4013-afed-c9c326207d6b",
        "text": "Кесте 1NF-те болуы керек"
      },
      {
        "id": "5fb2345d-3003-4436-a490-77251e3c74aa",
        "text": "Кестеде тек бір баған болуы тиіс"
      },
      {
        "id": "9c8af9b5-e1ab-49b3-bf80-4952a63690af",
        "text": "Көпмәнді тәуелділіктердің болмауы"
      },
      {
        "id": "a47703ce-ee2a-466c-9d72-c0b8c9154485",
        "text": "Жаңа дерекқорды алғаш рет жобалағанда"
      },
      {
        "id": "e9e32f7c-6b80-40ec-9049-850499bee166",
        "text": "Атрибут (Attribute)"
      },
      {
        "id": "3802d43e-1ffd-4fca-939d-ae9996f30357",
        "text": "X бойынша сұрыптау"
      },
      {
        "id": "5895e300-a520-425b-8322-cd9b2fbe883c",
        "text": "X ~> Y"
      }
    ],
    "correctOptionIds": [
      "9ca1b6ea-7d7e-4411-82a8-4dab0174491c"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "07665bef-7238-4d69-bb29-1956a94a02ff",
    "subjectId": "db",
    "text": "Кестенің Бірінші қалыпты формада (1NF) болуының негізгі шарты қандай?",
    "options": [
      {
        "id": "82fa2aa1-075b-4fae-9174-3b93a30ede78",
        "text": "Барлық атрибуттардың мәндері атомарлы (бөлінбейтін) болуы және қайталанатын топтардың болмауы"
      },
      {
        "id": "5c68ca58-8318-40a4-952b-32573c72f50e",
        "text": "Кестеде сыртқы кілттің болуы"
      },
      {
        "id": "8352b118-9512-44df-bc87-3a5de0c04167",
        "text": "Транзитивті тәуелділіктердің болмауы"
      },
      {
        "id": "1f50fc40-97d2-4572-a116-43915fd70f6a",
        "text": "Кестенің 2NF-те болуы"
      },
      {
        "id": "de40c112-5972-4d53-903e-a4673fbcfc70",
        "text": "XZ -> Y"
      },
      {
        "id": "97f6271e-b322-4cd4-9048-71bb72af20c7",
        "text": "Ешқандай қалыпты формаға жатпайды"
      },
      {
        "id": "cca148cd-c387-4031-9217-1e1ed7866ecd",
        "text": "4NF"
      },
      {
        "id": "6179267e-c2ee-4e76-aaab-7f8edc224bbb",
        "text": "Барлық суперкілттер кандидаттық кілт болады"
      }
    ],
    "correctOptionIds": [
      "82fa2aa1-075b-4fae-9174-3b93a30ede78"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "b2e387f6-4062-41a0-b1f2-4fdf7ffca39a",
    "subjectId": "db",
    "text": "Екінші қалыпты форманың (2NF) басты шарты қандай?",
    "options": [
      {
        "id": "a355174c-8fd2-4aec-a000-52adbdf77956",
        "text": "Кесте 1NF-те болуы және кез келген кілттік емес атрибут бастапқы кілтке (әсіресе құрама кілтке) толық функционалды тәуелді болуы тиіс (ішінара тәуелділік болмауы керек)"
      },
      {
        "id": "939ea8eb-514f-4e31-8b41-eb2fec676bf0",
        "text": "Кестеде тек бірегей индекстер болуы керек"
      },
      {
        "id": "5ad2ac85-8429-420d-91b9-c3f1a1516959",
        "text": "Транзитивті тәуелділіктердің болуы"
      },
      {
        "id": "3dbcc110-4fce-4228-bfcf-44719b34d64d",
        "text": "Атрибуттардың тек сандық болуы"
      },
      {
        "id": "42912cf8-31cf-4b18-9b05-405cede72ccf",
        "text": "Егер X -> Y болса, онда Y -> X орындалады"
      },
      {
        "id": "7b8c7cb1-1d2e-4d26-afd0-81880b1ca52b",
        "text": "Физикалық жобалау кезеңінде"
      },
      {
        "id": "89488545-a237-439d-a74f-5ec909f3ce8f",
        "text": "Сыртқы кілт (Foreign Key)"
      },
      {
        "id": "8e962fed-f313-4d9b-9f8c-1da8fc945d8d",
        "text": "Индекстерді жылдам оқу үшін"
      }
    ],
    "correctOptionIds": [
      "a355174c-8fd2-4aec-a000-52adbdf77956"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "e2727aa7-c2ff-4995-bb5a-d8a4099f7c39",
    "subjectId": "db",
    "text": "Бойс-Кодд қалыпты формасы (BCNF) үшін қандай шарт орындалуы керек?",
    "options": [
      {
        "id": "ce1a2ecc-ab87-439b-9a25-204da290c1c0",
        "text": "Кесте 3NF-те болуы және кез келген функционалды тәуелділікте (X -> Y) X анықтаушысы суперкілт болуы тиіс"
      },
      {
        "id": "02510119-ab11-42af-bebf-98d62fb9d71f",
        "text": "Кестеде сыртқы кілт мүлдем болмауы тиіс"
      },
      {
        "id": "500a8084-b755-40d1-a1dc-7d061f292cd6",
        "text": "Кесте 4NF-те болуы керек"
      },
      {
        "id": "a2a533da-2d3c-4fb0-9815-8c1f3b5140b6",
        "text": "Тек скалярлық мәндер сақталуы тиіс"
      },
      {
        "id": "354b9e43-67e9-4fa6-88fc-281c8be2ac57",
        "text": "Атрибут құрама кілттің бір бөлігіне тәуелді"
      },
      {
        "id": "6e3ceafc-729a-489d-8c5b-d281a8446963",
        "text": "Шексіз көп"
      },
      {
        "id": "797f0cd0-9b05-48ce-9d16-00a16459f772",
        "text": "Функционалдық тәуелділіктердің санын көбейту үшін"
      },
      {
        "id": "dbeaee35-6221-4826-b973-973c0902625c",
        "text": "Деректерді сақтау"
      }
    ],
    "correctOptionIds": [
      "ce1a2ecc-ab87-439b-9a25-204da290c1c0"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "f39ab5e6-dde1-4519-ba3c-a8b1ce7fbd2d",
    "subjectId": "db",
    "text": "Кестеде кілттік емес Y атрибуты кілттік емес X атрибутына тәуелді, ал X өз кезегінде бастапқы кілтке тәуелді болса, бұл қандай тәуелділік?",
    "options": [
      {
        "id": "09cf8690-4e12-4ae8-8d0f-1a51a4b1bb91",
        "text": "Транзитивті тәуелділік (Transitive Dependency)"
      },
      {
        "id": "50428135-1307-4e67-9326-dcc18ce15251",
        "text": "Толық функционалды тәуелділік"
      },
      {
        "id": "0c55f010-652e-435b-854d-91c7f8285660",
        "text": "Ішінара тәуелділік"
      },
      {
        "id": "4a58f643-b6a3-41df-958b-b6630e94ef02",
        "text": "Көпмәнді тәуелділік"
      },
      {
        "id": "c5d67851-ab79-4b95-80aa-6748777b1802",
        "text": "Барлық атрибуттардың мәндері атомарлы (бөлінбейтін) болуы және қайталанатын топтардың болмауы"
      },
      {
        "id": "3056c25b-389f-4f4a-8f2a-3b4698ae5c91",
        "text": "Транзитивті тәуелділіктердің болмауы"
      },
      {
        "id": "88ca5c21-2994-4f79-9acf-22b32507d2cf",
        "text": "Деректерді шифрлау"
      },
      {
        "id": "0da2fdfd-871b-4098-906d-35958ee022a5",
        "text": "Ыдырату (Decomposition)"
      }
    ],
    "correctOptionIds": [
      "09cf8690-4e12-4ae8-8d0f-1a51a4b1bb91"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "d772b177-3a1e-4d2c-b78f-8a723c201375",
    "subjectId": "db",
    "text": "Төртінші қалыпты формада (4NF) қандай тәуелділік түрі жойылады?",
    "options": [
      {
        "id": "7742eef8-f4a1-42c4-9d6a-63e9d4efc69a",
        "text": "Көпмәнді тәуелділіктер (Multivalued Dependencies)"
      },
      {
        "id": "6f32c143-12d4-4f4c-a824-c878a76fbd2d",
        "text": "Транзитивті тәуелділіктер"
      },
      {
        "id": "c4324c8c-7ad2-433d-a3bc-55b928be47b3",
        "text": "Ішінара функционалды тәуелділіктер"
      },
      {
        "id": "2c12e18b-7e29-4033-a369-4fef09a11359",
        "text": "Қосылу тәуелділіктері"
      },
      {
        "id": "7c4ab098-82e1-44ff-8edb-4e32ef9d69b7",
        "text": "Декарт ережелеріне"
      },
      {
        "id": "16936871-b63f-4647-b059-283c7c6f4578",
        "text": "Кестедеге жазбаны бірегей анықтай алатын атрибут немесе атрибуттар жиынтығы (бірақ минималды болуы міндетті емес)"
      },
      {
        "id": "1951a843-83ba-4598-9c94-e0b2619b936b",
        "text": "Армстронг аксиомаларының көмегімен F жиынтығынан шығарылатын барлық функционалдық тәуелділіктер жиыны"
      },
      {
        "id": "51e5a3a6-bdb1-48ff-b742-273e4177c2cf",
        "text": "Көпмәнді тәуелділіктерді (multivalued dependencies) жою"
      }
    ],
    "correctOptionIds": [
      "7742eef8-f4a1-42c4-9d6a-63e9d4efc69a"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "b70c994d-24ae-4ba1-ac7e-48d8925829b5",
    "subjectId": "db",
    "text": "Бесінші қалыпты форманың (5NF / PJNF) негізгі мақсаты не?",
    "options": [
      {
        "id": "4aaf5e4c-f32e-4d03-94ea-1477434ac159",
        "text": "Деректерді жоғалтпай біріктіру (Join Dependency) тәуелділіктерін реттеу және артықшылықтарды жою"
      },
      {
        "id": "b675a87a-7f43-4e56-bbb4-8082db7f7f9c",
        "text": "Транзитивті тәуелділікті жою"
      },
      {
        "id": "c200eade-bb67-4b38-9cb5-2224e05c0657",
        "text": "Көпмәнді атрибуттарды атомарлы ету"
      },
      {
        "id": "7f6f0ade-fc31-4800-aa8a-87636272045a",
        "text": "Кестедегі индекстерді азайту"
      },
      {
        "id": "b3d12ee8-d4dc-475a-879e-2b0e4704433c",
        "text": "Жоқ, BCNF-те кейде функционалдық тәуелділікті сақтау мүмкін болмайды (trade-off)"
      },
      {
        "id": "e2754832-f18d-44f5-8b86-50a3b15e0296",
        "text": "Деректердің физикалық өлшемінің тым үлкен болып кетуі"
      },
      {
        "id": "5626eca7-479d-4e06-92c5-683ca2bcd85b",
        "text": "Бастапқы кілттің бөлігіне ғана тәуелді атрибуттарды (жартылай тәуелділіктерді) жеке кестеге шығару"
      },
      {
        "id": "29ee6d54-8084-4ce6-9d7f-b68a3483be20",
        "text": "Проекциялық-біріктіру қалыпты формасы (PJNF), біріктіру тәуелділігіне (join dependency) негізделген"
      }
    ],
    "correctOptionIds": [
      "4aaf5e4c-f32e-4d03-94ea-1477434ac159"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "820cdc1b-0511-40ed-b4cd-bb0b7f2a9dd7",
    "subjectId": "db",
    "text": "Нормализациялау процесінің негізгі кемшілігі қандай болуы мүмкін?",
    "options": [
      {
        "id": "b63cc0b5-1e2e-4b2c-ad84-82186504ae9f",
        "text": "Кестелер санының көбеюіне байланысты JOIN амалдары жиілеп, кейбір оқу сұраныстарының баяулауы"
      },
      {
        "id": "ecb38eb8-fed5-40b9-a56b-84804ceb5244",
        "text": "Дерекқордағы қателердің жиілеуі"
      },
      {
        "id": "1eab6987-77f5-434e-a753-b142fa0575f7",
        "text": "Деректердің тұтастығын бақылаудың қиындауы"
      },
      {
        "id": "4274327b-986a-4779-8e33-aa8208896f55",
        "text": "Деректердің физикалық өлшемінің тым үлкен болып кетуі"
      },
      {
        "id": "7dbd05f9-5c3e-4c43-92b6-ce4e803caf57",
        "text": "Артық деректер мен аномалияларды азайту"
      },
      {
        "id": "de926b44-3979-4a1f-859b-627e76b038f4",
        "text": "Әрбір детерминант кандидат кілт болуы керек"
      },
      {
        "id": "ed8944b5-4d1a-4be6-b4bc-3c69a470ca54",
        "text": "Деректерді сақтау"
      },
      {
        "id": "b481c91a-a970-418f-9bc5-79e811c0c6c4",
        "text": "BCNF + атомарлы мәндер"
      }
    ],
    "correctOptionIds": [
      "b63cc0b5-1e2e-4b2c-ad84-82186504ae9f"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "d3151285-9623-48be-ba9b-5f9fad240805",
    "subjectId": "db",
    "text": "Егер кестеде бастапқы кілт жай (бір ғана бағаннан тұратын) кілт болса, онда 1NF-тегі бұл кесте автоматты түрде қай қалыпты формаға сәйкес келеді?",
    "options": [
      {
        "id": "b2cabc1c-8fa8-4d1a-afde-8e41200c3bbc",
        "text": "2NF-ке (себебі ішінара тәуелділік болуы мүмкін емес)"
      },
      {
        "id": "9bbe4bdc-5ba6-4dc6-af7f-d99ee380d2fd",
        "text": "3NF-ке"
      },
      {
        "id": "67ebfdb7-5104-4d89-96a1-722e3a358a8a",
        "text": "BCNF-ке"
      },
      {
        "id": "5fed8b6a-4a70-43f0-9eb8-c7eb67e22dae",
        "text": "Ешқандай қалыпты формаға жатпайды"
      },
      {
        "id": "d096fc3d-4664-440a-afb3-4c9035fa7e07",
        "text": "Дерекқордың оңтайлы жұмыс істейтінін"
      },
      {
        "id": "c8cc9467-7af4-4b48-b92a-acf5f90dd1d1",
        "text": "Кестеде тек INNER JOIN қолданылса"
      },
      {
        "id": "b1e796d0-2147-47c1-81d0-dcc2ea5cd1b9",
        "text": "Дерек қосу мүмкін емес"
      },
      {
        "id": "4ceb3650-81ae-4e4d-b835-1816ccbc2e1c",
        "text": "Бастапқы кілтке сілтеме жасайтын атрибут"
      }
    ],
    "correctOptionIds": [
      "b2cabc1c-8fa8-4d1a-afde-8e41200c3bbc"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "b17eb39d-bca1-46c0-b7a8-ae716a7bae0f",
    "subjectId": "db",
    "text": "1NF-тің басты талабы қандай?",
    "options": [
      {
        "id": "3c09244b-b2db-4976-b2b3-02a92726f4e2",
        "text": "Барлық атрибуттардың мәндері атомды (бөлінбейтін) болуы тиіс"
      },
      {
        "id": "f59089d8-fc64-402a-8cbd-e0c48193ea94",
        "text": "Кестеде сыртқы кілттер (FK) болмауы тиіс"
      },
      {
        "id": "f6691c24-09ce-4e8e-a086-72a337da3afd",
        "text": "Транзитивті тәуелділіктер болмауы тиіс"
      },
      {
        "id": "e9b71247-6ea6-4872-9331-683d0e30608f",
        "text": "Кестеде тек бірегей индекстер болуы тиіс"
      },
      {
        "id": "ac67af37-5b61-490c-90df-574b82abcb9c",
        "text": "Тек скалярлық мәндер сақталуы тиіс"
      },
      {
        "id": "610d2b10-91d2-43e0-9ed6-42f9cc9df933",
        "text": "Индексі бар кез келген кесте"
      },
      {
        "id": "1567bbc7-66ad-4418-8e36-dacabf00f8b2",
        "text": "Деректерді жоғалтпай біріктіру (Join Dependency) тәуелділіктерін реттеу және артықшылықтарды жою"
      },
      {
        "id": "28271f63-018d-4765-9b28-3c5126a5c0d8",
        "text": "Аксиомалардың қатесіз жазылуын"
      }
    ],
    "correctOptionIds": [
      "3c09244b-b2db-4976-b2b3-02a92726f4e2"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "024da517-3be8-42bb-9765-a4e941892637",
    "subjectId": "db",
    "text": "2NF-тің басты ережесі қандай?",
    "options": [
      {
        "id": "88cc0fd6-03db-4e45-bd61-ac9e54290a8a",
        "text": "Кесте 1NF-те болуы және кез келген кілттік емес атрибут бастапқы немесе кандидаттық кілтке толықтай тәуелді болуы тиіс (жартылай тәуелділікті жою)"
      },
      {
        "id": "764e77fc-bcab-4986-a307-d43b4e30cdc2",
        "text": "Транзитивті тәуелділіктерді толығымен жою"
      },
      {
        "id": "eac9a097-a942-446c-8d24-44df06a24a1c",
        "text": "Көпмәнді тәуелділіктерді жою"
      },
      {
        "id": "41d377d1-6f9b-4e86-b2ea-3f5fbd277e31",
        "text": "Кестеде тек бір ғана баған болуы"
      },
      {
        "id": "b65e9405-482b-4648-97ab-10e57453f672",
        "text": "SQL сұраныстарының санын көбейту"
      },
      {
        "id": "591af071-c4ff-43cb-ba49-a3cc8238f662",
        "text": "Минималды кілт"
      },
      {
        "id": "81c52636-15ce-41fe-9581-3de8dc4f1de4",
        "text": "Жазбаны бірегей анықтай алатын минималды атрибуттар жиыны"
      },
      {
        "id": "5a58cc55-d961-423c-8b92-f1aa35bc12a9",
        "text": "X-тің бір мәніне Y-тің бірнеше тәуелсіз мәндер жиыны сәйкес келеді және олар үшінші Z атрибутына тәуелсіз сақталады"
      }
    ],
    "correctOptionIds": [
      "88cc0fd6-03db-4e45-bd61-ac9e54290a8a"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "732e2047-58ef-4c94-a385-7f327a0c5474",
    "subjectId": "db",
    "text": "3NF-тің анықтамасына сәйкес келетін шарт қандай?",
    "options": [
      {
        "id": "b267b7a4-008b-497b-a3d2-2a71c880f357",
        "text": "Кесте 2NF-те болуы және кілттік емес атрибуттардың арасында транзитивті тәуелділік болмауы тиіс"
      },
      {
        "id": "0b7ec4fa-8c5b-4725-854b-b511babfdbe1",
        "text": "Кесте тек 1NF-те болуы тиіс"
      },
      {
        "id": "63ba80ee-43bf-4214-ae0d-7ab169414378",
        "text": "Көпмәнді тәуелділіктер жойылуы тиіс"
      },
      {
        "id": "279f398d-1996-46d6-8603-388f596343e0",
        "text": "Кандидаттық кілттер мүлдем болмауы тиіс"
      },
      {
        "id": "d9a23825-9edf-4948-957c-5d029fb8b268",
        "text": "Иә, бірақ бастапқы кілт тек біреу ғана болады"
      },
      {
        "id": "81ec9ed9-3882-470a-ba12-2f594e190d6f",
        "text": "Сызықтық ыдырату"
      },
      {
        "id": "a5f8369b-b42e-4585-b66e-455d1a4147ee",
        "text": "Кесте 1NF-те болуы және кез келген кілттік емес атрибут бастапқы немесе кандидаттық кілтке толықтай тәуелді болуы тиіс (жартылай тәуелділікті жою)"
      },
      {
        "id": "2ded48c7-8533-454b-9192-c962a3949ba7",
        "text": "Қосымша ақпаратсыз жаңа дерек қосу мүмкін емес"
      }
    ],
    "correctOptionIds": [
      "b267b7a4-008b-497b-a3d2-2a71c880f357"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "6cd17bd4-b22a-4116-8bbe-c545ac39d614",
    "subjectId": "db",
    "text": "Boyce-Codd қалыпты формасы (BCNF) үшін қандай шарт орындалуы керек?",
    "options": [
      {
        "id": "8f5fe7e7-111a-4866-9c2c-58965a80ca03",
        "text": "Кез келген бейтривиалды X -> Y функционалдық тәуелділігі үшін X міндетті түрде суперкілт (superkey) болуы тиіс"
      },
      {
        "id": "f97045ba-0b14-4a42-97ef-a5c9cf1b61c3",
        "text": "Бастапқы кілт тек суррогаттық кілт болуы керек"
      },
      {
        "id": "01b900b7-b0da-4415-9e81-d42928a33eb9",
        "text": "Кестеде тек 1:1 байланыстары болуы тиіс"
      },
      {
        "id": "8ff5be1f-e676-4315-a6b8-d2fb84cb87fc",
        "text": "Транзитивті тәуелділіктер ғана рұқсат етіледі"
      },
      {
        "id": "4b94bacd-0c1b-441d-bcec-66f422361dd0",
        "text": "Егер кестеде транзитивті тәуелділік болса"
      },
      {
        "id": "4c582034-2544-4fcc-b5a1-6bde44a73f20",
        "text": "Домендік-кілттік қалыпты форма (DKNF)"
      },
      {
        "id": "d0b787ae-5e3e-4f57-9b54-f983131ce43e",
        "text": "Күрделі атрибут"
      },
      {
        "id": "eda4afef-2977-47d9-90d9-f19eb2477341",
        "text": "Бастапқы кілт болып табылатын ең кіші баған"
      }
    ],
    "correctOptionIds": [
      "8f5fe7e7-111a-4866-9c2c-58965a80ca03"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "f9eb881f-d6bf-414c-a1b3-847200ef87f9",
    "subjectId": "db",
    "text": "4NF-тің негізгі мақсаты қандай?",
    "options": [
      {
        "id": "3a2bab07-7ff6-47b3-b97a-1411f07d4d79",
        "text": "Көпмәнді тәуелділіктерді (multivalued dependencies) жою"
      },
      {
        "id": "2ae08aee-4baa-4797-9bed-634a4d18d96a",
        "text": "Транзитивті тәуелділіктерді жою"
      },
      {
        "id": "87bc8243-a331-44e7-86aa-ff091e017ccd",
        "text": "Жартылай тәуелділіктерді жою"
      },
      {
        "id": "83a9748f-0297-4152-b4a9-4e716c1a8d63",
        "text": "Біріктіру тәуелділіктерін (join dependency) шешу"
      },
      {
        "id": "eb3f8ef4-15a7-4086-a3ed-6050b7f776ee",
        "text": "Тікелей тәуелділік"
      },
      {
        "id": "12b417a9-ee97-4cfa-9e4f-a681e1cb24d4",
        "text": "Дерекқордың физикалық қауіпсіздігінің нашарлауы"
      },
      {
        "id": "5a604a10-d343-4a02-8972-fd594aa86c60",
        "text": "Транзитивті қалыпты форма"
      },
      {
        "id": "e2068607-88f4-471c-bde6-9cf4b0d539e8",
        "text": "Кестелер санының көбеюіне байланысты JOIN амалдары жиілеп, кейбір оқу сұраныстарының баяулауы"
      }
    ],
    "correctOptionIds": [
      "3a2bab07-7ff6-47b3-b97a-1411f07d4d79"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "97e5b104-3e00-4d7d-9a96-ec74885f40bb",
    "subjectId": "db",
    "text": "5NF-тің басқаша атауы қандай және ол неге негізделген?",
    "options": [
      {
        "id": "30bea953-9243-4bf8-8e0b-79bb34b1d7f9",
        "text": "Проекциялық-біріктіру қалыпты формасы (PJNF), біріктіру тәуелділігіне (join dependency) негізделген"
      },
      {
        "id": "dc44183d-0f59-4c66-902d-8c5477814ba4",
        "text": "Бойс-Кодд қалыпты формасы, суперкілтке негізделген"
      },
      {
        "id": "cade5d12-9e24-4dde-8377-5c03ed1d72d7",
        "text": "Домендік-кілттік қалыпты форма (DKNF)"
      },
      {
        "id": "41f131a5-46fa-42e1-a7d2-f98edc567aad",
        "text": "Транзитивті қалыпты форма"
      },
      {
        "id": "5bbe4722-94a0-4c09-92df-9aff27921033",
        "text": "X пен Y жиындарының ортақ элементі мүлдем болмаса (X ∩ Y = ∅)"
      },
      {
        "id": "f9dd8f75-ea77-4ae0-894d-cb4b1cbd4dc0",
        "text": "JOIN операторларының көбеюіне байланысты күрделі оқу сұраныстарының баяулауы"
      },
      {
        "id": "20a361dd-e892-4857-a88c-d7bac1f48503",
        "text": "Транзитивті тәуелділіктер болмауы тиіс"
      },
      {
        "id": "061c6eea-3c25-4315-bd51-368aae3da8f2",
        "text": "Әрбір детерминант кандидат кілт болуы керек"
      }
    ],
    "correctOptionIds": [
      "30bea953-9243-4bf8-8e0b-79bb34b1d7f9"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "67007706-9cdf-474b-a097-26dda908f864",
    "subjectId": "db",
    "text": "Армстронг аксиомаларындағы Рефлексивтілік (Reflexivity) ережесі нені білдіреді?",
    "options": [
      {
        "id": "b2536b1e-b847-4d7c-9fc1-67bc920a62a7",
        "text": "Егер Y жиыны X жиынының ішкі жиыны болса, онда X -> Y орындалады"
      },
      {
        "id": "d37c472b-8c43-47d0-bae5-39d73d44490d",
        "text": "Егер X -> Y болса, онда XZ -> YZ орындалады"
      },
      {
        "id": "c0e51873-07cb-44c5-85a2-1727e96b801f",
        "text": "Егер X -> Y және Y -> Z болса, онда X -> Z орындалады"
      },
      {
        "id": "d77fd833-b61b-4263-b909-2e66d9b541ba",
        "text": "Егер X -> Y болса, онда Y -> X орындалады"
      },
      {
        "id": "9a3667f9-6ddb-42ee-a1a8-a38968c795ac",
        "text": "Алан Тьюринг"
      },
      {
        "id": "e5593ee7-50cf-4af1-87d0-f2d130428884",
        "text": "А-ның әрбір мәніне В-ның тек бір ғана мәні сәйкес келеді"
      },
      {
        "id": "46996b6e-5417-48f4-8407-3c44d7bbf812",
        "text": "Кортеж (Tuple)"
      },
      {
        "id": "58f18879-8006-47ba-a30a-924fc2fb97db",
        "text": "Foreign Key болуы керек"
      }
    ],
    "correctOptionIds": [
      "b2536b1e-b847-4d7c-9fc1-67bc920a62a7"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "cbbefb03-10c5-4cf1-9b98-ceaf442d22fe",
    "subjectId": "db",
    "text": "Армстронг аксиомаларындағы Өсіру (Augmentation) ережесі нені білдіреді?",
    "options": [
      {
        "id": "bbcb9b84-77bc-41e7-a2cb-208dc42730b8",
        "text": "Егер X -> Y болса, онда кез келген Z үшін XZ -> YZ орындалады"
      },
      {
        "id": "a54f7a22-414e-48ae-b5dc-84a209077db0",
        "text": "Егер Y ⊆ X болса, онда X -> Y орындалады"
      },
      {
        "id": "7f6aab45-8375-4279-b1ff-2451a0148773",
        "text": "Егер X -> Y және Y -> Z болса, онда X -> Z орындалады"
      },
      {
        "id": "d98cb4c1-1f7f-408f-a89c-73f4be7e008b",
        "text": "Баған мәндерінің автоматты түрде өсуі"
      },
      {
        "id": "5fa6308c-9e4c-4af9-97f6-d00cde4a07ab",
        "text": "Егер кестеде бірнеше қиылысатын құрама кандидаттық кілттер болса"
      },
      {
        "id": "1c1b499e-21c7-4400-be78-e04814b56cdd",
        "text": "Көпмәнді тәуелділіктер (Multivalued Dependencies)"
      },
      {
        "id": "d200e12b-54d1-479a-8bb3-73f2630a197a",
        "text": "Ешқандай қасиет сақталмайды"
      },
      {
        "id": "a3446c42-a59c-4bd7-b8e3-ef4a69393d27",
        "text": "1NF + жартылай функционалдық тәуелділік жоқ"
      }
    ],
    "correctOptionIds": [
      "bbcb9b84-77bc-41e7-a2cb-208dc42730b8"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "468d7723-0ff2-411b-93a2-83757d0e327d",
    "subjectId": "db",
    "text": "Армстронг аксиомаларындағы Транзитивтілік (Transitivity) ережесі нені білдіреді?",
    "options": [
      {
        "id": "e027daed-7a63-4281-87fd-ce40b8bd9b2b",
        "text": "Егер X -> Y және Y -> Z болса, онда X -> Z орындалады"
      },
      {
        "id": "53108e91-70c8-45de-a171-b810bfa09f12",
        "text": "Егер Y ⊆ X болса, онда X -> Y орындалады"
      },
      {
        "id": "b2343c0d-57a8-4463-b9f8-41caa428e599",
        "text": "Егер X -> Y болса, онда XZ -> YZ орындалады"
      },
      {
        "id": "00371cdc-f84a-44a6-8176-a5c9d1cc3f4d",
        "text": "Көпмәнді тәуелділіктің орындалуын білдіреді"
      },
      {
        "id": "9b8dab0a-43bd-40ee-bdff-8c14156d83c4",
        "text": "Кестеде тек бірегей индекстер болуы керек"
      },
      {
        "id": "a11079f6-fb2d-44f5-ac8c-82297283ea2f",
        "text": "Суррогаттық кілт"
      },
      {
        "id": "43a55079-56cd-43b0-87ba-62fbb95d96e1",
        "text": "Күрделі атрибут"
      },
      {
        "id": "8422e310-c781-489f-a2a0-019384957ab6",
        "text": "Индексті өшіру кезіндегі сәтсіздік"
      }
    ],
    "correctOptionIds": [
      "e027daed-7a63-4281-87fd-ce40b8bd9b2b"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "66b4a969-2f00-4755-a5d5-c9fa85b361d2",
    "subjectId": "db",
    "text": "Армстронг ережелерінен туындайтын Біріктіру (Union) ережесі қандай?",
    "options": [
      {
        "id": "91c03800-b966-4d8c-a32a-68c726559fdf",
        "text": "Егер X -> Y және X -> Z болса, онда X -> YZ орындалады"
      },
      {
        "id": "2eb76e1e-4608-4c9b-864a-9138ad30e319",
        "text": "Егер X -> YZ болса, онда X -> Y және X -> Z орындалады"
      },
      {
        "id": "28f8671a-7073-46ad-b1ce-e9ff4b9e5475",
        "text": "Егер X -> Y және WY -> Z болса, онда WX -> Z орындалады"
      },
      {
        "id": "51b5fd82-2cc0-4898-92fe-45a52d7e9e90",
        "text": "Екі кестенің жолдарын біріктіруді білдіреді"
      },
      {
        "id": "20d823d4-f07b-4eeb-a5c1-26f52719cadf",
        "text": "Кілтке тәуелділік"
      },
      {
        "id": "6233662d-048d-46e8-8525-d2770649e6f7",
        "text": "Көпмәнді тәуелділік"
      },
      {
        "id": "4c432c9d-2aef-4dac-a790-95f9f163be03",
        "text": "Кесте 1NF-те болуы және кез келген кілттік емес атрибут бастапқы кілтке (әсіресе құрама кілтке) толық функционалды тәуелді болуы тиіс (ішінара тәуелділік болмауы керек)"
      },
      {
        "id": "2e0af0a1-7e30-45cc-a62c-d9c654dce523",
        "text": "A → B, ал B → C болса, A → C"
      }
    ],
    "correctOptionIds": [
      "91c03800-b966-4d8c-a32a-68c726559fdf"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "d73c966b-3ae1-47c1-af7a-7e9829f316f3",
    "subjectId": "db",
    "text": "Армстронг ережелерінен туындайтын Ыдырату (Decomposition) ережесі қандай?",
    "options": [
      {
        "id": "7385c59e-f40c-4b5b-8648-1e00b7e53f88",
        "text": "Егер X -> YZ болса, онда X -> Y және X -> Z орындалады"
      },
      {
        "id": "315fab2c-7625-4291-a34e-94d4fc4135df",
        "text": "Егер X -> Y және X -> Z болса, онда X -> YZ орындалады"
      },
      {
        "id": "307f5f08-a84c-4f52-af9e-fbce5e82d65a",
        "text": "Егер Y ⊆ X болса, онда X -> Y орындалады"
      },
      {
        "id": "6f82b4f7-8011-4dee-96bb-20ae373bfb9e",
        "text": "Кесте құрылымын жоюды білдіреді"
      },
      {
        "id": "be5f9abb-543f-4216-9dba-8408eeff1684",
        "text": "Ешқандай қасиет сақталмайды"
      },
      {
        "id": "4604a136-6ca0-43e1-ac6a-3190ed4a2463",
        "text": "А және В мәндері әрқашан тең болады"
      },
      {
        "id": "c4068bfa-ec44-49dd-bc5a-8f6a8cb048e2",
        "text": "(A, B) және (B, C) кестелеріне бөлу арқылы"
      },
      {
        "id": "376da3a1-9268-47de-8039-e5bc857afb11",
        "text": "Бөлуге болатын мән"
      }
    ],
    "correctOptionIds": [
      "7385c59e-f40c-4b5b-8648-1e00b7e53f88"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "f3c5e838-7192-4ed0-8557-525ede1ce2e7",
    "subjectId": "db",
    "text": "Армстронг ережелерінен туындайтын Псевдотранзитивтілік (Pseudotransitivity) ережесі қандай?",
    "options": [
      {
        "id": "ea1a5873-96d3-4bc2-a7e8-f547477dc251",
        "text": "Егер X -> Y және WY -> Z болса, онда WX -> Z орындалады"
      },
      {
        "id": "69a1098d-cfa5-42e5-b8d1-3aec9001ad9c",
        "text": "Егер X -> Y және Y -> Z болса, онда X -> Z орындалады"
      },
      {
        "id": "cbc766ce-e682-485d-905f-9e39a592166c",
        "text": "Егер X -> YZ болса, онда X -> Y орындалады"
      },
      {
        "id": "8b3f828f-2e00-4c48-b9c5-d4c5ea97d7b8",
        "text": "Транзитивті тәуелділікті толық терістеу"
      },
      {
        "id": "4e0aa30b-eb09-4aa6-a471-d670667a8639",
        "text": "Олардың бірі бастапқы кілт болса"
      },
      {
        "id": "47735c8d-1ca6-4b4c-a2fa-f5a745ed5701",
        "text": "Топ_ID"
      },
      {
        "id": "0b24cce6-fe63-4e32-895a-b4f59fbd6a7b",
        "text": "Y мәні X-ке функционалды тәуелді"
      },
      {
        "id": "280cb733-5ae2-4666-ba64-c265f39d59a9",
        "text": "Деректерді шифрлау"
      }
    ],
    "correctOptionIds": [
      "ea1a5873-96d3-4bc2-a7e8-f547477dc251"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "00a57cfb-afdf-4f69-a9fc-b0c67e28bcbf",
    "subjectId": "db",
    "text": "Функционалдық тәуелділіктің тұйықталуы (Closure of FD set - F+) деген не?",
    "options": [
      {
        "id": "52c6f500-0c51-4867-8381-47824b9ff053",
        "text": "Армстронг аксиомаларының көмегімен F жиынтығынан шығарылатын барлық функционалдық тәуелділіктер жиыны"
      },
      {
        "id": "8652a66f-0b89-43dc-934d-4a97ac6632ae",
        "text": "Кестедегі бастапқы кілттердің жалпы саны"
      },
      {
        "id": "888db070-7179-4018-8aff-2989c05fad2f",
        "text": "Транзакцияның сәтті аяқталу сәті"
      },
      {
        "id": "a6e0e4c0-a0c5-4891-9e57-45e9d92c1d0f",
        "text": "Индекстелген бағандардың жиынтығы"
      },
      {
        "id": "ded26a9e-e4a1-4532-89c1-99a21e56e7c1",
        "text": "Кестелерді біріктіру"
      },
      {
        "id": "8d8b7917-2250-443f-bade-5e4b4ff18f23",
        "text": "Primary Key бар"
      },
      {
        "id": "a4b95f72-d5bb-4df5-9afa-eda62587708b",
        "text": "Көп мәнді атрибуттар бар"
      },
      {
        "id": "36055daf-da4d-49b5-b514-5212672d4ed0",
        "text": "Транзакциялар болуы керек"
      }
    ],
    "correctOptionIds": [
      "52c6f500-0c51-4867-8381-47824b9ff053"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "6ef324e4-887f-4ee4-a1f7-ea611f4a8969",
    "subjectId": "db",
    "text": "Атрибуттар жиынының тұйықталуы (Attribute Closure - X+) не үшін қолданылады?",
    "options": [
      {
        "id": "d70c052c-fc4f-450e-b87d-729a7cb7c9eb",
        "text": "Берілген атрибуттар жиынтығының суперкілт немесе кандидаттық кілт екенін тексеру үшін"
      },
      {
        "id": "10f360b4-1588-4b98-974d-193db0fc4177",
        "text": "Кестедегі NULL мәндерді табу үшін"
      },
      {
        "id": "b997d613-fbcc-4d51-87f2-32581add1c72",
        "text": "Кестені физикалық файлдарға бөлу үшін"
      },
      {
        "id": "b1c129b9-d154-4ef2-acb4-efa2f710f24d",
        "text": "Сыртқы кілттің орындалуын тексеру үшін"
      },
      {
        "id": "72168e9b-1ecd-4785-b71d-86015c351dbe",
        "text": "Сыртқы кілт (Foreign Key)"
      },
      {
        "id": "b50ad0c1-6dcb-4f51-a9a6-ff7a055a6d4e",
        "text": "2NF + транзитивті тәуелділік жоқ"
      },
      {
        "id": "60c30599-a28d-4fbe-877a-f93993d42f65",
        "text": "Бөлуге болмайтын ең қарапайым мән"
      },
      {
        "id": "db47918e-c585-4b4e-8a73-829d9425c7ad",
        "text": "Егер X -> Y болса, онда кез келген Z үшін XZ -> YZ орындалады"
      }
    ],
    "correctOptionIds": [
      "d70c052c-fc4f-450e-b87d-729a7cb7c9eb"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "b791ff02-e3dc-47b8-bc2a-0a68de846823",
    "subjectId": "db",
    "text": "Егер X+ тұйықталуы кестенің барлық атрибуттарын қамтыса, X атрибуттар жиыны не болып табылады?",
    "options": [
      {
        "id": "96b73c7d-fb91-474d-bf99-95ddd8de544e",
        "text": "Сыртқы кілт (Foreign Key)"
      },
      {
        "id": "a2996047-75ab-41cf-bf00-1539e5e096be",
        "text": "Бос жиын"
      },
      {
        "id": "a134ecf0-5156-4909-b3ef-72af3a8411d9",
        "text": "Біріншілік емес атрибут"
      },
      {
        "id": "79bc0a19-a50c-41fd-b326-230d2cff5191",
        "text": "X бастапқы кілт болса"
      },
      {
        "id": "25565c8d-7361-46a1-8edb-f7cd395beda1",
        "text": "Кестенің 2NF-те болуы"
      },
      {
        "id": "549a8615-c71b-4dbc-96f6-680a686968df",
        "text": "Кестедегі барлық индекстерді жою"
      },
      {
        "id": "00d256b6-f646-4f6d-b4f1-2d27ce11becd",
        "text": "А-ның әрбір мәніне В-ның тек бір ғана мәні сәйкес келеді"
      },
      {
        "id": "f9bb5e3d-aa5e-4df8-8dca-c8d6fe5cc909",
        "text": "Толық тәуелділік"
      }
    ],
    "correctOptionIds": [
      "c4afe032-1b5d-493a-b4da-2664de024176"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "b732cd75-5cb7-4222-9f07-d18e07d056ec",
    "subjectId": "db",
    "text": "Минималды жабын (Minimal Cover / Canonical Cover) деген не?",
    "options": [
      {
        "id": "606b3014-752a-4de3-b74c-e843b8af8ed4",
        "text": "Ф-ға баламалы, бірақ ешқандай артық функционалдық тәуелділігі немесе артық атрибуты жоқ минималды FD жиыны"
      },
      {
        "id": "111da3fb-241f-4f94-b5eb-42718f47b3f0",
        "text": "Бастапқы кілт болып табылатын ең кіші баған"
      },
      {
        "id": "414d87ae-d082-432b-b811-a3807d831c2f",
        "text": "Дерекқордың ең аз орын алатын кестесі"
      },
      {
        "id": "1b731aa9-dcf1-434c-a44a-5322e8708634",
        "text": "Ең аз жазбасы бар кесте"
      },
      {
        "id": "793b5dbe-0e88-4766-8c30-fc7cee0c1b9c",
        "text": "Кестеге жаңа дерек енгізу үшін оған қатысы жоқ басқа да мәліметтерді міндетті түрде енгізуге мәжбүр болу"
      },
      {
        "id": "7125e3b5-9b1a-40b0-958b-bf72316bdd89",
        "text": "Жазбаны бірегей анықтайтын кез келген атрибуттар жиыны"
      },
      {
        "id": "ca8c4852-85fb-45f0-b898-cd1d6d05989e",
        "text": "Проекциялық-біріктіру қалыпты формасы (PJNF), біріктіру тәуелділігіне (join dependency) негізделген"
      },
      {
        "id": "5cf342cf-e772-41fd-a1be-c78da0fd4949",
        "text": "X пен Y тәуелсіз"
      }
    ],
    "correctOptionIds": [
      "606b3014-752a-4de3-b74c-e843b8af8ed4"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "085164c8-9134-4f4f-8a9b-a0291a0981c7",
    "subjectId": "db",
    "text": "Кестелерді ыдыратудағы (Decomposition) 'Lossless Join' (жоғалтусыз біріктіру) қасиеті нені білдіреді?",
    "options": [
      {
        "id": "dd5d462d-e4e1-4442-b32a-b0f9f91db62a",
        "text": "Ыдыратылған кестелерді қайтадан JOIN арқылы қосқанда алғашқы кестедегі деректер ешбір артық жолсыз дәл қалпына келуін"
      },
      {
        "id": "69a3b97c-db92-4b4a-b42f-238ac7b719bc",
        "text": "Ыдырату кезінде деректердің ешқайсысы өшпейтіндігін"
      },
      {
        "id": "76be23cc-89e4-440c-92f4-1bb0317a0ec7",
        "text": "Кестелерді біріктіргенде сұраныс уақытының жоғалмауын"
      },
      {
        "id": "7aedfe3c-b6ca-4bf5-92e7-f969c0687fde",
        "text": "Сыртқы кілттердің жойылмайтындығын"
      },
      {
        "id": "051832de-c5be-4d03-b67b-9fc583ba2eda",
        "text": "ЖСН"
      },
      {
        "id": "1fdb15fb-51b4-486e-a2dc-4dc314a6796d",
        "text": "Алан Тьюринг"
      },
      {
        "id": "3fab7752-8e1a-4dbb-b759-0f882dbf64d0",
        "text": "Бастапқы кілттің автоматты өшіп қалуын"
      },
      {
        "id": "6550e349-48a4-402a-ace1-e9118eb4e865",
        "text": "Бейтривиалды тәуелділік"
      }
    ],
    "correctOptionIds": [
      "dd5d462d-e4e1-4442-b32a-b0f9f91db62a"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "ddc31cdc-6dc8-4f05-b48f-a307250b42c3",
    "subjectId": "db",
    "text": "Кестені оның функционалдық тәуелділіктерін жоғалтпай ыдырату процесі қалай аталады?",
    "options": [
      {
        "id": "2adc706c-5f86-4b88-b28e-ff84d7656da4",
        "text": "Тәуелділікті сақтаушы ыдырату (Dependency Preserving Decomposition)"
      },
      {
        "id": "c94b10a1-9568-4301-ab07-36025d8fdb7d",
        "text": "Логикалық ыдырату"
      },
      {
        "id": "2cc379ee-d1f9-410f-9ef0-4d2da2a34e17",
        "text": "Денормализациялық ыдырату"
      },
      {
        "id": "3bf030ed-5141-4d8e-8be4-8d9ec50194de",
        "text": "Сызықтық ыдырату"
      },
      {
        "id": "bdfb4079-c800-49c6-b3a7-92c0e4b83b84",
        "text": "Суррогаттық кілт"
      },
      {
        "id": "4e002fbd-d96b-450c-8a84-286cd146dc47",
        "text": "Бастапқы кілт болып табылатын ең кіші баған"
      },
      {
        "id": "68a04593-24cd-4802-a1b7-cec591d9ebaf",
        "text": "Деректерді жою"
      },
      {
        "id": "c91f0382-6ac1-4cc1-8caa-f428b2984eb2",
        "text": "Деректер типін өзгерту кезіндегі қателік"
      }
    ],
    "correctOptionIds": [
      "2adc706c-5f86-4b88-b28e-ff84d7656da4"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "d9ddb2c0-055a-473a-9a13-ec05cb3ed8f5",
    "subjectId": "db",
    "text": "Ыдырату кезінде жалжал (артық) жолдардың (Spurious Tuples) пайда болу себебі не?",
    "options": [
      {
        "id": "18cf69b0-79f8-40c0-a616-9a3cf2d107fd",
        "text": "Сәйкес келмейтін, бастапқы кілт емес бағандар бойынша кестелерді дұрыс емес қосу (JOIN) жасау"
      },
      {
        "id": "0f4fc1a5-db07-408c-98be-a74608f3736b",
        "text": "Кестедегі индекстердің жетіспеушілігі"
      },
      {
        "id": "9e36a73e-624d-432b-9308-1ad809378114",
        "text": "Кестеде NULL мәндердің тым көп болуы"
      },
      {
        "id": "3f1d8167-e44c-4601-bd53-e93846f46ce6",
        "text": "Транзакциялардың сәтсіз орындалуы"
      },
      {
        "id": "2899cef8-1a72-4ed3-9b2f-6ad5d557ee11",
        "text": "Кестелердің шексіз санын"
      },
      {
        "id": "cf2206ba-1372-4961-bbb1-21b88c4dde42",
        "text": "2NF + транзитивті тәуелділік жоқ"
      },
      {
        "id": "de0aa59f-3634-4b98-a2c1-cfdeb44b2e53",
        "text": "X Y-ға тең емес"
      },
      {
        "id": "8278cb81-eeda-4a63-aacb-6d42e90c0064",
        "text": "Дерекқордың физикалық өлшемін шексіз үлкейту"
      }
    ],
    "correctOptionIds": [
      "18cf69b0-79f8-40c0-a616-9a3cf2d107fd"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "fe52148b-cfc6-493a-bf43-2f508ec3432e",
    "subjectId": "db",
    "text": "Біріншілік атрибут (Prime Attribute) деген не?",
    "options": [
      {
        "id": "bfa86f7e-1009-4f61-ba0b-a4a5fc1a0f20",
        "text": "Кез келген кандидаттық кілттің құрамына кіретін атрибут"
      },
      {
        "id": "3911b0f5-1f5f-4eaf-a0e8-35cdec174055",
        "text": "Тек бүтін сандық типті атрибут"
      },
      {
        "id": "317ee91b-cabc-4d05-bff4-d6a48ede154f",
        "text": "Кестенің ең бірінші бағаны"
      },
      {
        "id": "242db313-8fae-4c11-8450-ce8df76d6fc7",
        "text": "Ешқандай кілтке кірмейтін атрибут"
      },
      {
        "id": "ae8a712c-4db2-4c70-80b4-75c7aedad564",
        "text": "X-тің бір мәніне Y-тің бірнеше тәуелсіз мәндер жиыны сәйкес келеді және олар үшінші Z атрибутына тәуелсіз сақталады"
      },
      {
        "id": "f932842d-2157-464f-85b6-bc697cd8ea9b",
        "text": "Кестеде тек бір ғана баған болуы"
      },
      {
        "id": "03bec4f2-af79-4520-a62c-67ea73209d82",
        "text": "Y мәні X-ке функционалды тәуелді"
      },
      {
        "id": "0fb59960-c85c-4f47-be92-4b112510b9ac",
        "text": "Бастапқы кілтке сілтеме жасайтын атрибут"
      }
    ],
    "correctOptionIds": [
      "bfa86f7e-1009-4f61-ba0b-a4a5fc1a0f20"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "01c33eaf-d901-4eb0-9b1e-bea0296f3a94",
    "subjectId": "db",
    "text": "Біріншілік емес атрибут (Non-prime Attribute) деген не?",
    "options": [
      {
        "id": "b0506db0-f0ae-4214-9b08-62f412193100",
        "text": "Ешқандай кандидаттық кілттің құрамына кірмейтін атрибут"
      },
      {
        "id": "0fe86cf9-101c-41a6-b98c-b6a6b1221d3d",
        "text": "Бастапқы кілтке сілтеме жасайтын атрибут"
      },
      {
        "id": "9fc7ed0c-bfef-48ea-af5d-66439c96a592",
        "text": "Кестедегі екінші баған"
      },
      {
        "id": "e9cc0b80-6a0f-43c3-b3d1-7fa1ad7fb129",
        "text": "Мәндері тек NULL болатын баған"
      },
      {
        "id": "5a7eada1-ab9e-4438-b8d6-9f7ce3baf9c3",
        "text": "Y сыртқы кілт болса"
      },
      {
        "id": "95b2518d-068c-47e1-9bd0-d275192ea17a",
        "text": "Транзакциялар болуы керек"
      },
      {
        "id": "619d60ea-fe3d-4b0d-9d56-f65a46fa9f8e",
        "text": "X пен Y жиындарының ортақ элементі мүлдем болмаса (X ∩ Y = ∅)"
      },
      {
        "id": "b53c024a-7855-4969-9ab9-4383a7aee104",
        "text": "Транзитивті тәуелділік тудыратын (кілттік емес атрибутқа тәуелді) атрибуттарды жеке кестеге шығару"
      }
    ],
    "correctOptionIds": [
      "b0506db0-f0ae-4214-9b08-62f412193100"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "5409a322-18de-4af9-a1df-b8328b7027b3",
    "subjectId": "db",
    "text": "Функционалдық тәуелділік X -> Y тривиалды деп аталады, егер:",
    "options": [
      {
        "id": "7fa671c4-e417-4826-86ad-c962a3be52af",
        "text": "Y жиыны X жиынының ішкі жиыны болса (Y ⊆ X)"
      },
      {
        "id": "4273aaeb-f415-4220-b218-4a47ceabf4b9",
        "text": "Y жиыны мен X жиыны қиылыспаса"
      },
      {
        "id": "c710287c-c9d4-4850-ad4f-760ffc09a386",
        "text": "X және Y бос жиын болса"
      },
      {
        "id": "34acff9a-503e-4b9b-8cb4-ce259d01500d",
        "text": "X бастапқы кілт болса"
      },
      {
        "id": "054cee34-522d-479e-9fd3-00bf130e3ba1",
        "text": "Кестені толығымен өшіре алмау қатесі"
      },
      {
        "id": "f55c4a74-07b7-465d-b3a3-34f39528dde5",
        "text": "Дерек жаңарту қиын"
      },
      {
        "id": "ffa343b5-2a3e-43e6-8be7-fe66f7677d98",
        "text": "X пен Y-тің ортақ элементі тек біреу ғана болса"
      },
      {
        "id": "1f620c20-4132-42f1-b23b-814f71ed8d5e",
        "text": "Бастапқы кілтпен бірге ең көп дегенде екеу болады"
      }
    ],
    "correctOptionIds": [
      "7fa671c4-e417-4826-86ad-c962a3be52af"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "9adf3248-5c90-4d2a-aff1-9c95c6fc4af3",
    "subjectId": "db",
    "text": "Функционалдық тәуелділік X -> Y тривиалды емес (non-trivial) деп аталады, егер:",
    "options": [
      {
        "id": "9f3d41d6-5e4d-4e8d-afe1-a78e6ce8dd92",
        "text": "Y жиыны X жиынының ішкі жиыны болмаса (Y ⊈ X)"
      },
      {
        "id": "75b0acd5-cc4e-4942-8334-513d841d622e",
        "text": "Y ⊆ X орындалса"
      },
      {
        "id": "1933beb2-49ef-4b9d-881a-6c88778b7a01",
        "text": "X пен Y-тің ортақ элементтері болса"
      },
      {
        "id": "558604ac-5408-4863-bbf7-b1044fe7fd31",
        "text": "Y тек бірегей мәндерді қамтыса"
      },
      {
        "id": "31f289e3-f26a-4afd-90ef-752a0335768c",
        "text": "Толық тәуелділік"
      },
      {
        "id": "3b130a4b-b710-496a-806a-ce5d5cf51924",
        "text": "XZ -> Y"
      },
      {
        "id": "13923a02-52f5-4d3e-98c3-34c3af9e996d",
        "text": "Кестенің ең бірінші бағаны"
      },
      {
        "id": "b00d8729-5151-444b-a6b5-d3ad4fb4c30c",
        "text": "Кестедегі екінші баған"
      }
    ],
    "correctOptionIds": [
      "9f3d41d6-5e4d-4e8d-afe1-a78e6ce8dd92"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "36d7e662-4014-4260-b634-f23603f53961",
    "subjectId": "db",
    "text": "Функционалдық тәуелділік X -> Y толық тривиалды емес (completely non-trivial) деп аталады, егер:",
    "options": [
      {
        "id": "bfa3b6e1-befd-4837-984c-54524d455259",
        "text": "X пен Y жиындарының ортақ элементі мүлдем болмаса (X ∩ Y = ∅)"
      },
      {
        "id": "e2c05839-9313-4356-a6ca-ed5a4b080188",
        "text": "Y ⊆ X орындалса"
      },
      {
        "id": "5a49046f-5c3a-4255-84e7-0bfe2d9a2def",
        "text": "X пен Y-тің ортақ элементі тек біреу ғана болса"
      },
      {
        "id": "61a6d5c3-8dd6-4d56-93b3-bf85f29f54b8",
        "text": "Олардың бірі бастапқы кілт болса"
      },
      {
        "id": "347b6007-67a4-4225-b8d5-a99d080754ca",
        "text": "Бастапқы кілті жалғыз қарапайым атрибуттан тұратын 1NF кестесі"
      },
      {
        "id": "bee4d999-9011-483a-a8fe-95cea82854d5",
        "text": "Ыдырату кезінде деректердің ешқайсысы өшпейтіндігін"
      },
      {
        "id": "16f33602-9d34-408a-95be-87bbcdb40989",
        "text": "Кандидаттық кілт — минималды суперкілт, яғни оның құрамынан бірде-бір атрибутты алып тастауға болмайды"
      },
      {
        "id": "af32fca2-86ef-4b4e-b6c8-798737d1311a",
        "text": "Кестеде тек бірегей индекстер болуы керек"
      }
    ],
    "correctOptionIds": [
      "bfa3b6e1-befd-4837-984c-54524d455259"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "a4fa8eb5-3e07-4dff-a41f-a9eddc8d3808",
    "subjectId": "db",
    "text": "Кестені 2NF-ке келтіру үшін қандай әрекет жасалады?",
    "options": [
      {
        "id": "c1f51eec-17f1-451a-8ce8-08d1f290d3dd",
        "text": "Бастапқы кілттің бөлігіне ғана тәуелді атрибуттарды (жартылай тәуелділіктерді) жеке кестеге шығару"
      },
      {
        "id": "85e46279-58de-47e0-9b56-7ec3d7af70a8",
        "text": "Кестедегі барлық индекстерді жою"
      },
      {
        "id": "c188359c-1efa-4a09-8f6a-92e1c637e96b",
        "text": "Барлық мәтіндік бағандарды сандық бағанға ауыстыру"
      },
      {
        "id": "70d4c897-69d2-4282-bbcc-6dd4b86c86c8",
        "text": "Транзитивті тәуелділіктерді жеке кестеге шығару"
      },
      {
        "id": "a5919cb5-c86e-4481-a25f-1a961b9f2c1c",
        "text": "Транзитивті тәуелділікті жою"
      },
      {
        "id": "43344437-02a7-4bec-875d-cca1662e115b",
        "text": "Primary Key бар"
      },
      {
        "id": "2557a785-ff63-46e2-beb0-73e7ab424fd5",
        "text": "Армстронг аксиомаларына"
      },
      {
        "id": "42edfaba-0566-4488-a0f5-7742bb6683d1",
        "text": "2NF-ке (себебі ішінара тәуелділік болуы мүмкін емес)"
      }
    ],
    "correctOptionIds": [
      "c1f51eec-17f1-451a-8ce8-08d1f290d3dd"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "9bb89a11-88d2-4a1b-8ef7-cb20805c906f",
    "subjectId": "db",
    "text": "Кестені 3NF-ке келтіру үшін қандай әрекет жасалады?",
    "options": [
      {
        "id": "6cb99aa6-6aa9-40c6-add5-5211960abca9",
        "text": "Транзитивті тәуелділік тудыратын (кілттік емес атрибутқа тәуелді) атрибуттарды жеке кестеге шығару"
      },
      {
        "id": "4a895bcc-e852-44a3-a9b7-db3e0e9f2f99",
        "text": "Жартылай тәуелділікті жою"
      },
      {
        "id": "a6402b5a-ec8a-4705-888a-1204bd499247",
        "text": "Көпмәнді тәуелділіктерді жеке кестеге шығару"
      },
      {
        "id": "3db1bfcf-f474-4863-9b57-233beb217c7c",
        "text": "Кестелерді біріктіру"
      },
      {
        "id": "c15b9105-9bec-498c-ba01-a3fa0747e06f",
        "text": "Схема (Schema)"
      },
      {
        "id": "1eccb31b-7e9f-4c6c-8c7c-7c3b8d817ea4",
        "text": "Кестелердің шексіз санын"
      },
      {
        "id": "19f08261-8463-46b0-87a9-5548725d4666",
        "text": "Бастапқы кілт тек суррогаттық кілт болуы керек"
      },
      {
        "id": "739dd62f-af08-4acc-8266-aba976861e32",
        "text": "Толық тәуелділік"
      }
    ],
    "correctOptionIds": [
      "6cb99aa6-6aa9-40c6-add5-5211960abca9"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "e11165a9-390f-4e09-88f8-ea08954e6381",
    "subjectId": "db",
    "text": "Төмендегі кестелердің қайсысы әрқашан 2NF және 3NF талаптарына автоматты түрде сай болады?",
    "options": [
      {
        "id": "d4c69624-31d8-4bda-9a03-97775e01dcc2",
        "text": "Бастапқы кілті жалғыз қарапайым атрибуттан тұратын 1NF кестесі"
      },
      {
        "id": "3a6664b3-2579-4695-900f-cb8be22dc17e",
        "text": "Құрама бастапқы кілті бар кез келген кесте"
      },
      {
        "id": "5f9bb793-2c2d-4802-883b-1aea01470a8d",
        "text": "Индексі бар кез келген кесте"
      },
      {
        "id": "9e46b96a-7920-46b5-a234-7d4d2e4abba6",
        "text": "Тек сыртқы кілттері бар кесте"
      },
      {
        "id": "780bbf01-44a7-4b1e-98f5-21ba90a3e610",
        "text": "Ешқандай қалыпты формаға жатпайды"
      },
      {
        "id": "ef202350-b837-4132-a91b-fa1423610ef6",
        "text": "Кестелер санының көбеюіне байланысты JOIN амалдары жиілеп, кейбір оқу сұраныстарының баяулауы"
      },
      {
        "id": "2be80319-2c72-4b1b-8af8-1a1da3e1a58f",
        "text": "Оның барлық бағандары тек сандық типті болса"
      },
      {
        "id": "e1c16bcf-135a-473f-9123-898ad74a5421",
        "text": "Домендік-кілттік қалыпты форма (DKNF)"
      }
    ],
    "correctOptionIds": [
      "d4c69624-31d8-4bda-9a03-97775e01dcc2"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "5a3a94a7-3c68-449c-a7fd-aa57050a4d37",
    "subjectId": "db",
    "text": "Кесте 3NF-те болып, бірақ BCNF талабын бұзатын жағдай қашан туындайды?",
    "options": [
      {
        "id": "99a02aff-bafa-4847-98d2-0a0ee01bd9a0",
        "text": "Егер кестеде бірнеше қиылысатын құрама кандидаттық кілттер болса"
      },
      {
        "id": "08381b74-f77b-45b9-8a97-bb50b212ac8e",
        "text": "Егер кестеде тек бір кандидаттық кілт болса"
      },
      {
        "id": "10b951d5-3a24-482b-a564-2d5f8084965f",
        "text": "Егер кестеде сыртқы кілттер мүлдем болмаса"
      },
      {
        "id": "b541a0a9-821a-4bd2-881a-f75fa208173f",
        "text": "Егер кестеде транзитивті тәуелділік болса"
      },
      {
        "id": "a249dc65-e62b-440d-bb9c-3acd8fe7391a",
        "text": "Ньютон заңдарына"
      },
      {
        "id": "2614325f-05f4-4a4f-9c03-e93c83795cc2",
        "text": "X тек бір бағаннан тұрса"
      },
      {
        "id": "f4c95a17-7493-41e0-804d-40f24a929b89",
        "text": "Концептуалды жобалау кезеңінде"
      },
      {
        "id": "e7719eff-3ea0-4bac-b94e-8e6184998ee6",
        "text": "1NF"
      }
    ],
    "correctOptionIds": [
      "99a02aff-bafa-4847-98d2-0a0ee01bd9a0"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "9b5d8ace-9d8c-4d84-8989-ecb8ffdb0838",
    "subjectId": "db",
    "text": "3NF пен BCNF арасындағы басты айырмашылық қандай?",
    "options": [
      {
        "id": "039aea6a-cb69-4cf2-8e09-ba51c67dac8d",
        "text": "3NF-те X -> A тәуелділігі үшін А біріншілік (prime) атрибут болса рұқсат етіледі, ал BCNF-те А-ның қандай атрибут екеніне қарамастан X міндетті түрде суперкілт болуы тиіс"
      },
      {
        "id": "c76c0860-f5dd-4437-8ae4-6ff7aeac04f9",
        "text": "BCNF-те транзитивті тәуелділіктерге рұқсат беріледі"
      },
      {
        "id": "172c7975-423f-4bfb-b719-65c87481677d",
        "text": "3NF тек құрама кілттермен жұмыс істейді"
      },
      {
        "id": "9a1cd21a-f78a-4054-b5b1-9f4a56ddc355",
        "text": "Ешқандай айырмашылығы жоқ"
      },
      {
        "id": "8b41ccd5-b358-4363-b8e9-04ff3075d9d7",
        "text": "Ыдырату кезінде деректердің ешқайсысы өшпейтіндігін"
      },
      {
        "id": "e21f0b85-fb8c-48f4-b1bf-4e3ff948c8fb",
        "text": "Индекстелген бағандардың жиынтығы"
      },
      {
        "id": "6943f29f-fa29-4cf9-8eca-75e27fc6f77f",
        "text": "Кестеде тек INNER JOIN қолданылса"
      },
      {
        "id": "511ace81-f079-4526-a8a8-333e4c83904e",
        "text": "Иә, BCNF әрқашан екі қасиетті де толық сақтайды"
      }
    ],
    "correctOptionIds": [
      "039aea6a-cb69-4cf2-8e09-ba51c67dac8d"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "3644b80b-0b59-4a6e-ba0c-789431f2c69d",
    "subjectId": "db",
    "text": "Көпмәнді тәуелділік (Multivalued Dependency - MVD) қалай белгіленеді?",
    "options": [
      {
        "id": "de839002-fc12-41eb-a8c8-a4460bad5386",
        "text": "X ->-> Y"
      },
      {
        "id": "9557647e-0ea5-430d-b52b-ee95732a0ed8",
        "text": "X -> Y"
      },
      {
        "id": "c9fd16dc-7b3a-4e42-9d8c-d6b9ee24a94d",
        "text": "X => Y"
      },
      {
        "id": "5fd456a3-efe4-4137-b610-180070cd056f",
        "text": "X ~> Y"
      },
      {
        "id": "120b6d6a-e2f7-40c7-97f4-b56b9ee33feb",
        "text": "Ыдыратылған кестелерді қайтадан JOIN арқылы қосқанда алғашқы кестедегі деректер ешбір артық жолсыз дәл қалпына келуін"
      },
      {
        "id": "9bf4ab50-6332-47f7-b37d-9aa3d4f3f13a",
        "text": "Кестелерді біріктіру"
      },
      {
        "id": "a623c2c7-290a-49b7-84ab-b05b932ac59d",
        "text": "Кестелерді ыдыратуға (decomposition)"
      },
      {
        "id": "e91498d2-a823-4134-a706-1026d77c7c44",
        "text": "Функционалдық тәуелділіктердің санын көбейту үшін"
      }
    ],
    "correctOptionIds": [
      "de839002-fc12-41eb-a8c8-a4460bad5386"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "8d5c8e51-98b8-4975-ada7-d81d7f15b33a",
    "subjectId": "db",
    "text": "X ->-> Y көпмәнді тәуелділігі нені білдіреді?",
    "options": [
      {
        "id": "37f56735-d282-47f7-866d-40566d742ceb",
        "text": "X-тің бір мәніне Y-тің бірнеше тәуелсіз мәндер жиыны сәйкес келеді және олар үшінші Z атрибутына тәуелсіз сақталады"
      },
      {
        "id": "f62779de-b987-4669-996a-90457dca7d70",
        "text": "X-тің бір мәніне Y-тің тек бір ғана мәні сәйкес келеді"
      },
      {
        "id": "414bb28e-ec90-4563-9dbc-015178f12471",
        "text": "X пен Y арасындағы 1:1 байланысты"
      },
      {
        "id": "14a067ba-74c1-4112-9e1f-a3942d529f7b",
        "text": "Y атрибуты X-тің бастапқы кілті екенін"
      },
      {
        "id": "43772217-f8cc-4482-939e-68fe9155ea2c",
        "text": "Біріншілік (Prime) атрибуттар"
      },
      {
        "id": "a18fd0fd-3ed9-44fb-b953-46e6356eae71",
        "text": "Y сыртқы кілт болса"
      },
      {
        "id": "d37398f0-bb79-4e14-aa69-adfa70d1e52d",
        "text": "Кестедеге жазбаны бірегей анықтай алатын атрибут немесе атрибуттар жиынтығы (бірақ минималды болуы міндетті емес)"
      },
      {
        "id": "6fb2546d-53ca-4d44-816c-6f7423a24bd2",
        "text": "Артық деректерді азайту процесі"
      }
    ],
    "correctOptionIds": [
      "37f56735-d282-47f7-866d-40566d742ceb"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "c752c33a-e33a-4ce2-8cf3-9d5b436b9554",
    "subjectId": "db",
    "text": "4NF-тегі кестеде неше тәуелсіз көпмәнді тәуелділік сақталуы мүмкін?",
    "options": [
      {
        "id": "d332d093-56ef-4bc2-9144-aad94403367e",
        "text": "Тек бір ғана (егер олар көп болса, оларды жеке кестелерге бөлу керек)"
      },
      {
        "id": "6ea701fa-94cb-4795-b06d-d671d06a0d7f",
        "text": "Шексіз көп"
      },
      {
        "id": "9bce8689-1b48-44b3-b84c-9be58488be19",
        "text": "Екі"
      },
      {
        "id": "8d0edc29-742d-4fe7-9993-a7f07589aef0",
        "text": "Мүлдем сақталмауы керек"
      },
      {
        "id": "caca6d80-4fe3-4019-a210-0703027ebd8b",
        "text": "Кестелерді бөлу"
      },
      {
        "id": "5109e61f-b107-48b0-a8d9-87edb036dd53",
        "text": "ЖСН"
      },
      {
        "id": "af593d69-9a93-43b4-9a8e-93b6bbccf900",
        "text": "Сыртқы атрибуттар"
      },
      {
        "id": "7a3896b2-a132-4cdd-a190-eb7e77d39149",
        "text": "Индекс"
      }
    ],
    "correctOptionIds": [
      "d332d093-56ef-4bc2-9144-aad94403367e"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "c6252a06-c1c4-4fa9-865e-69935ecf70bf",
    "subjectId": "db",
    "text": "Кестеде Join Dependency (JD) бар деп аталады, егер:",
    "options": [
      {
        "id": "0be9fbd8-20ca-4b6f-bfe3-6029d05956ab",
        "text": "Кестені оның проекцияларына ыдыратқаннан кейін оларды қайта қосқанда алғашқы кесте дәл қалпына келсе (lossless join орындалса)"
      },
      {
        "id": "ae4fcea6-4f0d-47ad-94be-c4a8430b49d4",
        "text": "Кестеде екі немесе одан да көп сыртқы кілттер болса"
      },
      {
        "id": "f037eb53-bdc2-41de-9247-9156aa6cb53b",
        "text": "Кестеде тек INNER JOIN қолданылса"
      },
      {
        "id": "f218e444-03bb-4abc-a35d-b8e1becf8c75",
        "text": "Кестеде денормализация орын алса"
      },
      {
        "id": "1a875c59-f908-4770-9fa8-d648b62ce24a",
        "text": "(A, C) және (B, C) кестелеріне бөлу арқылы"
      },
      {
        "id": "e4fb800e-d5e1-49d5-adbc-9ced9e2be692",
        "text": "X-тің бір мәніне Y-тің тек бір ғана мәні сәйкес келеді"
      },
      {
        "id": "5cc8390e-5397-4b4a-ae22-9601f13d449a",
        "text": "X ->-> Y"
      },
      {
        "id": "a879cecd-b9d6-4f9f-9355-ae3a5773f871",
        "text": "X ~> Y"
      }
    ],
    "correctOptionIds": [
      "0be9fbd8-20ca-4b6f-bfe3-6029d05956ab"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "ec7ab38c-e211-48f0-9a48-4bc931050288",
    "subjectId": "db",
    "text": "Біріктіру тәуелділігін (Join Dependency) зерттейтін және оны шешетін қалыпты форма қайсысы?",
    "options": [
      {
        "id": "957758ff-55e1-4068-9c9f-d34c39ba91ef",
        "text": "5NF"
      },
      {
        "id": "021f0282-120d-4eea-a96c-e6b92c65a76c",
        "text": "4NF"
      },
      {
        "id": "aead21d1-d756-4c66-868c-03e4626f8c2f",
        "text": "3NF"
      },
      {
        "id": "001ca6ef-f178-44d5-bdb7-90b9b8bd5577",
        "text": "BCNF"
      },
      {
        "id": "4a13c11e-5599-43cc-824f-b94747631d00",
        "text": "Кесте 1NF-те болуы және кез келген кілттік емес атрибут бастапқы кілтке (әсіресе құрама кілтке) толық функционалды тәуелді болуы тиіс (ішінара тәуелділік болмауы керек)"
      },
      {
        "id": "819f1093-cba7-4249-9b10-0549c184934e",
        "text": "Егер кестеде бірнеше қиылысатын құрама кандидаттық кілттер болса"
      },
      {
        "id": "ff54b6f4-6377-4506-a9ad-84343d9f3a1e",
        "text": "Іздеу нәтижесі қате"
      },
      {
        "id": "a78580c1-af0d-4470-a41e-d6d9ebae361d",
        "text": "Y атрибуты X-тің бастапқы кілті екенін"
      }
    ],
    "correctOptionIds": [
      "957758ff-55e1-4068-9c9f-d34c39ba91ef"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "960cec89-4f9f-4b87-ad28-3175ea83d7c7",
    "subjectId": "db",
    "text": "Деректер қорын нормализациялаудың басты мақсаты не?",
    "options": [
      {
        "id": "ddb53404-2594-4ae6-99b1-772dbf71de17",
        "text": "Деректердің артықшылығын жою және жаңарту, қосу, өшіру аномалияларын болдырмау"
      },
      {
        "id": "31bae411-d1f1-4a38-b2a4-a76c2c7fa02d",
        "text": "Дерекқордың физикалық өлшемін шексіз үлкейту"
      },
      {
        "id": "59a49dc2-9f64-4d3a-9876-e7eb13b1b735",
        "text": "SQL сұраныстарының санын көбейту"
      },
      {
        "id": "63615a2c-29c1-4693-b597-40d7d99e2fe2",
        "text": "Кестелерге деректерді тез енгізу"
      },
      {
        "id": "f2f8b00d-caf5-436a-8f50-ee03b792e84d",
        "text": "Кестелерді ыдыратуға (decomposition)"
      },
      {
        "id": "e8567607-4e2d-460f-87ab-dc9947c4d14f",
        "text": "Тегі"
      },
      {
        "id": "3906b844-f6c6-42c7-9419-80858138819b",
        "text": "Кестедеге жазбаны бірегей анықтай алатын атрибут немесе атрибуттар жиынтығы (бірақ минималды болуы міндетті емес)"
      },
      {
        "id": "b0e904f4-2125-4f56-9f03-1a83dc25abc4",
        "text": "Y атрибуты X-тің бастапқы кілті екенін"
      }
    ],
    "correctOptionIds": [
      "ddb53404-2594-4ae6-99b1-772dbf71de17"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "99bdded2-b734-4786-87de-26168a47b0a3",
    "subjectId": "db",
    "text": "Қосу аномалиясы (Insertion Anomaly) деген не?",
    "options": [
      {
        "id": "2429d01e-a954-4769-b037-6f8f7cf448e5",
        "text": "Кестеге жаңа дерек енгізу үшін оған қатысы жоқ басқа да мәліметтерді міндетті түрде енгізуге мәжбүр болу"
      },
      {
        "id": "424f3099-48f3-4726-a1e8-fd28379e9c88",
        "text": "Кестеге бір уақытта екі жол қоса алмау қатесі"
      },
      {
        "id": "975f1215-386c-4179-b529-d265c5590a80",
        "text": "Жаңа бастапқы кілт қосу кезіндегі қателік"
      },
      {
        "id": "d5673a4c-d6b5-46a4-a04a-4d22f6cf9363",
        "text": "Сыртқы кілттің мәнін өзгерте алмау"
      },
      {
        "id": "f2bb45d8-15e9-49ae-832e-fc0f77ad8f35",
        "text": "Көпмәнді тәуелділіктерді (multivalued dependencies) жою"
      },
      {
        "id": "533fff2d-e870-46ff-87da-d8c878d7b22a",
        "text": "Ешқандай жаңа функционалдық тәуелділік құру мүмкін еместігін"
      },
      {
        "id": "7631fb70-ddb4-47e2-855f-dcc7fd7d4f02",
        "text": "X пен Y тәуелсіз"
      },
      {
        "id": "3fce0832-59c8-471a-aaa2-6ae0ffe4586c",
        "text": "Көпмәнді тәуелділіктер (Multivalued Dependencies)"
      }
    ],
    "correctOptionIds": [
      "2429d01e-a954-4769-b037-6f8f7cf448e5"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "d2d61352-750b-4cfc-9eef-d9f7b578c9a0",
    "subjectId": "db",
    "text": "Өшіру аномалиясы (Deletion Anomaly) деген не?",
    "options": [
      {
        "id": "2fc3dd02-b8dc-4465-a185-4cf7455ed380",
        "text": "Кестеден бір деректі жойған кезде оған тәуелсіз басқа да маңызды ақпараттың қоса жойылып кетуі"
      },
      {
        "id": "a80332ee-6837-4d5a-9039-50586026ddb9",
        "text": "Кестені толығымен өшіре алмау қатесі"
      },
      {
        "id": "a8951a0b-ed94-4ef3-b49b-3b7516f371bb",
        "text": "Сыртқы кілттің байланысын жоя алмау"
      },
      {
        "id": "7dfb3d80-5b32-497a-a408-53b9a5364785",
        "text": "Индексті өшіру кезіндегі сәтсіздік"
      },
      {
        "id": "0a2c1045-516d-45a0-aee1-06450c14a572",
        "text": "Сызықтық ыдырату"
      },
      {
        "id": "7cab769d-c68c-4d5d-ba3f-bb810a71762d",
        "text": "Индекстерді жылдам оқу үшін"
      },
      {
        "id": "d583dabe-7052-4287-acef-5bce5e6aa481",
        "text": "Егер Y ⊆ X болса, онда X -> Y орындалады"
      },
      {
        "id": "77f86a10-1e26-4012-8623-431c98148a63",
        "text": "Индекстелген бағандардың жиынтығы"
      }
    ],
    "correctOptionIds": [
      "2fc3dd02-b8dc-4465-a185-4cf7455ed380"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "10225e67-8075-4063-b98d-86f660657614",
    "subjectId": "db",
    "text": "Жаңарту аномалиясы (Update Anomaly) деген не?",
    "options": [
      {
        "id": "d8502d85-353d-44dc-8733-1590e4e1f139",
        "text": "Бір дерек бірнеше жерде қайталанғандықтан, оны өзгерткен кезде барлық жолдарда бірдей жаңартпаса, деректердің қайшылыққа (inconsistency) ұшырауы"
      },
      {
        "id": "994cad72-8d0d-4c29-b35e-57777f80261a",
        "text": "UPDATE сұранысының өте баяу орындалуы"
      },
      {
        "id": "766f6318-04e7-4686-9146-afb5e9a6c869",
        "text": "Бастапқы кілттің автоматты түрде өзгермеуі"
      },
      {
        "id": "579f3667-7cef-468d-8bdb-053168ff0bac",
        "text": "Деректер типін өзгерту кезіндегі қателік"
      },
      {
        "id": "5049dcdd-05be-4be2-bb46-32dbc75d485d",
        "text": "Егер кестеде тек бір кандидаттық кілт болса"
      },
      {
        "id": "12d87665-1e7d-47a8-acf7-a96efe893c89",
        "text": "Y жиыны X жиынының ішкі жиыны болмаса (Y ⊈ X)"
      },
      {
        "id": "c99a3496-79a2-4a9b-9f1b-0f110f25511b",
        "text": "1NF"
      },
      {
        "id": "637386da-a80d-4e7e-a8e6-958952fdd2c0",
        "text": "Егер Y ⊆ X болса, онда X -> Y орындалады"
      }
    ],
    "correctOptionIds": [
      "d8502d85-353d-44dc-8733-1590e4e1f139"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "c7ae3c49-063e-46bb-a47d-9704280a2aa0",
    "subjectId": "db",
    "text": "Нормализациялау процесі неге негізделген?",
    "options": [
      {
        "id": "7acc9182-95cd-42a0-bd23-48a63910bbdb",
        "text": "Кестелерді ыдыратуға (decomposition)"
      },
      {
        "id": "a7f64d69-f1e2-42ab-8e56-6ee2d9ff4c83",
        "text": "Кестелерді біріктіруге (merge)"
      },
      {
        "id": "e149a91e-20e6-49c4-acc6-687d97eaed6e",
        "text": "Жаңа бағандар қосуға (alter table)"
      },
      {
        "id": "f999d5ac-d2ba-4aae-bf0b-81294d8bd413",
        "text": "Дерекқор файлдарын шифрлауға"
      },
      {
        "id": "d3216395-a6df-4afb-b4e3-33c4b210c8c2",
        "text": "Кестеде тек INNER JOIN қолданылса"
      },
      {
        "id": "2c676d7a-b75f-4b24-83e9-03fbfea0d2b2",
        "text": "Тікелей тәуелділік"
      },
      {
        "id": "33319ea4-8487-4d61-a489-bf711f154a71",
        "text": "Оның барлық бағандары тек сандық типті болса"
      },
      {
        "id": "903275fa-aad3-4470-b185-d6c71a9e11f0",
        "text": "Кестенің толық нормализацияланғанын"
      }
    ],
    "correctOptionIds": [
      "7acc9182-95cd-42a0-bd23-48a63910bbdb"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "caf86958-e33d-460d-881f-e35da2672d28",
    "subjectId": "db",
    "text": "Денормализация қашан қолданылады?",
    "options": [
      {
        "id": "c21a74b3-e638-4925-8ce8-a8dec0507aaa",
        "text": "OLAP жүйелерінде немесе оқу сұраныстары тым көп және олардың жылдамдығы маңызды болған жағдайда"
      },
      {
        "id": "2c56ccd7-099e-47d0-8c75-f6f95caee27e",
        "text": "Жаңа дерекқорды алғаш рет жобалағанда"
      },
      {
        "id": "4dee4a11-00c8-48ad-bff5-cbf7a9197a50",
        "text": "Деректердің қауіпсіздігін арттыру қажет болғанда"
      },
      {
        "id": "0c76fa96-96d3-470e-9635-8693e081e0d6",
        "text": "Транзитивті тәуелділіктерді көбейту үшін"
      },
      {
        "id": "3e9f8d91-3331-4117-bfde-681ba18b271a",
        "text": "Бастапқы кілттің автоматты өшіп қалуын"
      },
      {
        "id": "b3afbcc9-6436-4406-9acf-51818be507e9",
        "text": "Кестелерді біріктіргенде сұраныс уақытының жоғалмауын"
      },
      {
        "id": "62203df5-ad3a-410c-bf88-48df710c0634",
        "text": "Иә, 3NF-те екі қасиет те әрқашан сақталады"
      },
      {
        "id": "87bb52ab-a63d-41e5-8a35-e1ce7fb4c0e0",
        "text": "Индекстерді жылдам оқу үшін"
      }
    ],
    "correctOptionIds": [
      "c21a74b3-e638-4925-8ce8-a8dec0507aaa"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "d5dd8709-b3bc-46e3-802a-cbf0545b726c",
    "subjectId": "db",
    "text": "Төмендегілердің қайсысы нормализациялаудың кемшілігі (жанама әсері) болып табылады?",
    "options": [
      {
        "id": "69ea2a11-ad1d-447b-9955-e0d9a7a29026",
        "text": "JOIN операторларының көбеюіне байланысты күрделі оқу сұраныстарының баяулауы"
      },
      {
        "id": "36769e87-102f-407e-b561-40a717b8033b",
        "text": "Деректердің қайталауының (redundancy) көбеюі"
      },
      {
        "id": "e93a604a-8041-4519-a58d-5573227ecc55",
        "text": "Жаңарту аномалияларының пайда болуы"
      },
      {
        "id": "60869286-eaf4-4fa8-b137-f7e9c6752935",
        "text": "Дерекқордың физикалық қауіпсіздігінің нашарлауы"
      },
      {
        "id": "dd0531c7-6a5c-40fd-a2e2-bfb2678be4f2",
        "text": "Жаңа дерекқорды алғаш рет жобалағанда"
      },
      {
        "id": "663e21f0-ca3c-411a-836c-550db8684650",
        "text": "Тек BCNF-ке өткенде ғана сақталады"
      },
      {
        "id": "4ac011e5-e812-40d0-b4ce-240c1d957482",
        "text": "Бейтривиалды тәуелділік"
      },
      {
        "id": "1b95f7b2-7d4d-4bd2-8f4c-5771718e7ec9",
        "text": "Сұраныс жылдамдығын арттыру"
      }
    ],
    "correctOptionIds": [
      "69ea2a11-ad1d-447b-9955-e0d9a7a29026"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "473e789e-5370-4c15-b270-c92c8a0062a7",
    "subjectId": "db",
    "text": "Кестенің барлық кандидаттық кілттерінің ішінен таңдап алынған жалғыз негізгі кілт қалай аталады?",
    "options": [
      {
        "id": "04f92ade-078d-4b77-8193-2f10c29a7123",
        "text": "Бастапқы кілт (Primary Key)"
      },
      {
        "id": "d619dd41-b4b4-4f93-8105-cf0253639d32",
        "text": "Суррогаттық кілт"
      },
      {
        "id": "0cd0acc7-2981-4941-abc0-c732aafccdc6",
        "text": "Сыртқы кілт"
      },
      {
        "id": "e716fde3-3597-4c98-a8c2-3638bf9d44f8",
        "text": "Суперкілт"
      },
      {
        "id": "1a93300d-2e4b-4b53-85a8-1f04692ea43d",
        "text": "Баған мәндерінің автоматты түрде өсуі"
      },
      {
        "id": "25c2a3ad-02a9-4d2e-8453-7ff555acacde",
        "text": "Кестеде бос ұяшықтардың көбеюін"
      },
      {
        "id": "926b2fd7-42e5-4661-a633-5f035d0e2aef",
        "text": "Көпмәнді тәуелділіктің орындалуын білдіреді"
      },
      {
        "id": "166e8fdf-afd6-4193-843c-0370b11a6b0c",
        "text": "Кесте 1NF-те болуы және кез келген кілттік емес атрибут бастапқы кілтке (әсіресе құрама кілтке) толық функционалды тәуелді болуы тиіс (ішінара тәуелділік болмауы керек)"
      }
    ],
    "correctOptionIds": [
      "04f92ade-078d-4b77-8193-2f10c29a7123"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "0036457c-0879-4e21-81ed-1af512cb5975",
    "subjectId": "db",
    "text": "Суперкілт (Superkey) деген не?",
    "options": [
      {
        "id": "9e50ffae-3f6e-4fa1-8ecd-35ca74077681",
        "text": "Кестедеге жазбаны бірегей анықтай алатын атрибут немесе атрибуттар жиынтығы (бірақ минималды болуы міндетті емес)"
      },
      {
        "id": "1151fc8a-23f9-49c5-8280-6b7672bcb41b",
        "text": "Тек бір бағаннан тұратын бастапқы кілт"
      },
      {
        "id": "e0645a3f-3371-4928-9523-14ba8e2c7fd9",
        "text": "Ең көп қолданылатын сыртқы кілт"
      },
      {
        "id": "7803b7d9-c70b-4e72-a363-77f0abce45fd",
        "text": "Дерекқордағы ең үлкен кесте"
      },
      {
        "id": "886e7c1d-f62b-465f-a36f-2f074117be08",
        "text": "Тегі"
      },
      {
        "id": "8073a555-cf6c-4258-b6e3-e93cb1a0be0e",
        "text": "Күрделі атрибут"
      },
      {
        "id": "ca1d2f28-d138-42ee-99e1-de0e50fb4ee4",
        "text": "Индекстерді жылдам оқу үшін"
      },
      {
        "id": "bff020f3-ad7a-481c-8b81-90311bf4cc61",
        "text": "Сыртқы кілттің мәнін өзгерте алмау"
      }
    ],
    "correctOptionIds": [
      "9e50ffae-3f6e-4fa1-8ecd-35ca74077681"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "9790db40-cb46-412b-a8e6-2729f31e317b",
    "subjectId": "db",
    "text": "Кандидаттық кілттің суперкілттен айырмашылығы неде?",
    "options": [
      {
        "id": "01714294-4a68-4d12-9c35-659d482ba074",
        "text": "Кандидаттық кілт — минималды суперкілт, яғни оның құрамынан бірде-бір атрибутты алып тастауға болмайды"
      },
      {
        "id": "dc0b99f3-cf3c-40b8-b568-9676d68680db",
        "text": "Кандидаттық кілт әрқашан суррогаттық кілт болады"
      },
      {
        "id": "555d93d8-4ebe-476c-afac-ce939b64ee9d",
        "text": "Суперкілт тек бір ғана бағаннан тұрады"
      },
      {
        "id": "ab4c8b0c-4340-404e-b607-2c9e51311e75",
        "text": "Ешқандай айырмашылығы жоқ"
      },
      {
        "id": "6ce1459b-7ca9-46d3-87bc-f30f97a82f81",
        "text": "Онда ешқандай бастапқы кілт болмаса"
      },
      {
        "id": "65dab0f5-eeab-4464-962c-f523be620abc",
        "text": "Көпмәнді тәуелділіктерді жеке кестеге шығару"
      },
      {
        "id": "07589324-ab06-482d-9a54-d00bdc2fba57",
        "text": "Алан Тьюринг"
      },
      {
        "id": "698ff918-5ae3-4e47-8e84-76c7374c2289",
        "text": "Кестеде тек 1:1 байланыстары болуы тиіс"
      }
    ],
    "correctOptionIds": [
      "01714294-4a68-4d12-9c35-659d482ba074"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "2f9e833f-f59b-4ef4-976c-2e6b5aab8c19",
    "subjectId": "db",
    "text": "Функционалдық тәуелділік X -> Y толық (Full Functional Dependency) деп аталады, егер:",
    "options": [
      {
        "id": "a4b19992-f6a4-4301-bad4-3a746ca77dfb",
        "text": "Y атрибуты X-ке тәуелді болып, бірақ X-тің ешқандай ішкі жиынына тәуелді болмаса"
      },
      {
        "id": "82607994-bce4-4bc0-9f4e-cd2328569e17",
        "text": "Y атрибуты X-тің кез келген бір бөлігіне тәуелді болса"
      },
      {
        "id": "9535f79c-60bb-46a9-a074-12ecaa31a091",
        "text": "X пен Y бірдей бағандар болса"
      },
      {
        "id": "7d2d195b-1578-4b5b-bd28-c0cb87e61a6a",
        "text": "X пен Y бастапқы кілт болса"
      },
      {
        "id": "16dabbd5-436d-4977-be78-6752308ce0c3",
        "text": "Транзитивті тәуелділіктерді толығымен жою"
      },
      {
        "id": "c35863aa-c722-4c08-9159-665315f47816",
        "text": "Транзитивті тәуелділіктер болмауы тиіс"
      },
      {
        "id": "c9343e8e-879c-4da0-bcb8-b835b0f287a8",
        "text": "Кесте құрылымының өзгермейтінін"
      },
      {
        "id": "b216beed-5d3c-412b-b67f-dccbcfd098b5",
        "text": "Кестеде NULL мәндердің тым көп болуы"
      }
    ],
    "correctOptionIds": [
      "a4b19992-f6a4-4301-bad4-3a746ca77dfb"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "bab9184e-8baf-422e-93d4-0eaa1a53aba4",
    "subjectId": "db",
    "text": "Функционалдық тәуелділік X -> Y жартылай (Partial Dependency) деп аталады, егер:",
    "options": [
      {
        "id": "04975059-38cd-46d8-8022-f90f68bccdc0",
        "text": "Y атрибуты құрама X кілтінің тек бір бөлігіне ғана тәуелді болса"
      },
      {
        "id": "17c7b4f9-0dca-43d6-979d-1241dc632dec",
        "text": "Y атрибуты X-ке толық тәуелді болса"
      },
      {
        "id": "25e56453-24e1-41c2-a11e-d4fbb484a957",
        "text": "X тек бір бағаннан тұрса"
      },
      {
        "id": "612d2c40-146d-4015-84f0-bfba0acf9867",
        "text": "Y сыртқы кілт болса"
      },
      {
        "id": "e02b2204-9ea0-4ea6-a961-5f0bddd3a97d",
        "text": "Мүлдем сақталмауы керек"
      },
      {
        "id": "2bd5f6a6-1825-4401-8741-26dad4b3b336",
        "text": "X бастапқы кілт болса"
      },
      {
        "id": "7e4e449a-a4e7-4c7d-916d-948f525d8032",
        "text": "Индекстерді жылдам оқу үшін"
      },
      {
        "id": "27695c4f-3587-44cc-920d-bafd5e522c63",
        "text": "Тек сыртқы кілттері бар кесте"
      }
    ],
    "correctOptionIds": [
      "04975059-38cd-46d8-8022-f90f68bccdc0"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "5fbc9592-2b54-4909-a12c-9fa02376718f",
    "subjectId": "db",
    "text": "Егер A -> B және B -> C болса (мұнда B -> A орындалмайды), онда A -> C қандай тәуелділік деп аталады?",
    "options": [
      {
        "id": "ae4e88e7-56d1-4b46-8dd3-a067b159b071",
        "text": "Транзитивті тәуелділік"
      },
      {
        "id": "afaa9ed2-cd81-481d-bf9d-b69167fa29ff",
        "text": "Жартылай тәуелділік"
      },
      {
        "id": "d7a2fa7e-ced0-4592-b438-e2d12a297535",
        "text": "Толық тәуелділік"
      },
      {
        "id": "dd010b12-6b50-496d-bc38-266484258e0d",
        "text": "Көпмәнді тәуелділік"
      },
      {
        "id": "ed7ac029-0af0-4e43-9031-876cd5231f24",
        "text": "Мүлдем сақталмауы керек"
      },
      {
        "id": "3482392b-5928-4d89-a386-cb4a2b843639",
        "text": "X ->-> Y"
      },
      {
        "id": "bfcdf55e-4212-4295-b121-48eb49ee9c00",
        "text": "JOIN операторларының көбеюіне байланысты күрделі оқу сұраныстарының баяулауы"
      },
      {
        "id": "fe8a881d-aa8a-48ea-abc1-338b0d4b76bc",
        "text": "X пен Y жиындарының ортақ элементі мүлдем болмаса (X ∩ Y = ∅)"
      }
    ],
    "correctOptionIds": [
      "ae4e88e7-56d1-4b46-8dd3-a067b159b071"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "8a5ae75e-9bca-454b-b253-7c1fda5961cb",
    "subjectId": "db",
    "text": "Кесте 1NF-те деп саналады, егер:",
    "options": [
      {
        "id": "dfa223cf-3a70-44d1-895a-be109fce9543",
        "text": "Оның барлық ұяшықтарында тек скалярлық (атомды) мәндер сақталып, массивтер немесе жиынтықтар болмаса"
      },
      {
        "id": "05bdfcff-fcb6-4307-a5f9-0c83751f4eca",
        "text": "Онда екі немесе одан да көп кесте біріктірілсе"
      },
      {
        "id": "d981247c-6de6-4e8c-ba32-0558a0de37e1",
        "text": "Онда ешқандай бастапқы кілт болмаса"
      },
      {
        "id": "ccfe9ab8-43b3-4170-8d8a-3dfb65599561",
        "text": "Оның барлық бағандары тек сандық типті болса"
      },
      {
        "id": "396443fe-571c-4e46-8f0e-67e5e883180a",
        "text": "Бойс-Кодд қалыпты формасы, суперкілтке негізделген"
      },
      {
        "id": "4b2a1762-569f-40a5-a289-4d1873e82e65",
        "text": "Қосымша ақпаратсыз жаңа дерек қосу мүмкін емес"
      },
      {
        "id": "daefb4b7-4aa8-44f5-be62-7a35bbc7794f",
        "text": "Ешқандай кілтке кірмейтін атрибут"
      },
      {
        "id": "3e234bd9-973e-4e11-b066-c5d39d9f4460",
        "text": "Көп мәнді атрибут"
      }
    ],
    "correctOptionIds": [
      "dfa223cf-3a70-44d1-895a-be109fce9543"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "ce22e353-ae4f-453f-86c3-1fce2238f136",
    "subjectId": "db",
    "text": "Келесі функционалдық тәуелділіктер берілген: A -> B, B -> C. Бұл кесте қай қалыпты формада (бастапқы кілт - А)?",
    "options": [
      {
        "id": "2523a104-9a14-4426-948d-dd4ed506d3da",
        "text": "2NF"
      },
      {
        "id": "61027043-ada3-4ea6-a80f-ca6ae5e72640",
        "text": "3NF"
      },
      {
        "id": "000e5b7a-814b-4255-b7c8-87779efa2d26",
        "text": "BCNF"
      },
      {
        "id": "5690035b-c49e-44c3-bcd0-77aae9637c1f",
        "text": "1NF"
      },
      {
        "id": "dace1029-1e5d-49e4-84a4-684d2951e567",
        "text": "4NF"
      },
      {
        "id": "959a0fcf-1cea-4fba-9849-f6df881e394d",
        "text": "Онда ешқандай бастапқы кілт болмаса"
      },
      {
        "id": "b91781b9-0b85-4783-8c00-a53553ae19ec",
        "text": "Кестеде тек бірегей индекстер болуы тиіс"
      },
      {
        "id": "e4c5de2c-5ad2-408b-bd4e-451cbc20ea2c",
        "text": "Y атрибуты X-тің бастапқы кілті екенін"
      }
    ],
    "correctOptionIds": [
      "2523a104-9a14-4426-948d-dd4ed506d3da"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "1a66702d-fc44-4a8f-82c6-fa9b71124be6",
    "subjectId": "db",
    "text": "Жоғарыдағы A -> B, B -> C кестесін 3NF-ке келтіру үшін қалай ыдыратады?",
    "options": [
      {
        "id": "9dce77ad-6217-4a6b-952b-11cb49c5049d",
        "text": "(A, B) және (B, C) кестелеріне бөлу арқылы"
      },
      {
        "id": "0e94fc4b-95f4-413e-9566-747cd6dda762",
        "text": "(A, C) және (B, C) кестелеріне бөлу арқылы"
      },
      {
        "id": "d9a8c46b-2ab0-45e7-aacd-ebc8ab8e24ba",
        "text": "Оларды бір кестеге біріктіру арқылы"
      },
      {
        "id": "7b9192b6-0afa-4fab-9079-20d9ff82a5c3",
        "text": "Жаңа С бағанын өшіру арқылы"
      },
      {
        "id": "95a5f424-f69c-42dc-930e-0d207203c0fc",
        "text": "Кез келген кандидаттық кілттің құрамына кіретін атрибут"
      },
      {
        "id": "93ba8d4b-c9c1-4877-8d63-b831f11438a2",
        "text": "Бөлуге болатын мән"
      },
      {
        "id": "c6ca4f1f-07be-4a05-bbb5-1f852fe91dab",
        "text": "Индексті өшіру кезіндегі сәтсіздік"
      },
      {
        "id": "fa96a887-86fc-477b-9e3c-42a522ef4c11",
        "text": "Бастапқы кілттің бөлігіне ғана тәуелді атрибуттарды (жартылай тәуелділіктерді) жеке кестеге шығару"
      }
    ],
    "correctOptionIds": [
      "9dce77ad-6217-4a6b-952b-11cb49c5049d"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "6016d45a-106c-474e-a49a-ed69385d0e09",
    "subjectId": "db",
    "text": "Берілген F функционалдық тәуелділіктер жиыны үшін оның closure (тұйықталуын) есептеу алгоритмі қандай аксиомаларға негізделген?",
    "options": [
      {
        "id": "d4f58643-a38e-4dd6-ab93-4051fb9081ce",
        "text": "Армстронг аксиомаларына"
      },
      {
        "id": "0219383c-9213-4f89-b8e0-187ba40f1ba0",
        "text": "Кодд ережелеріне"
      },
      {
        "id": "e304558b-2e0b-4a1a-a126-dfe21323a510",
        "text": "Ньютон заңдарына"
      },
      {
        "id": "6cf9b584-17b0-4853-9c2b-54e027215f0f",
        "text": "Декарт ережелеріне"
      },
      {
        "id": "4947ca7c-c7b8-4646-9ffa-618f616dcafd",
        "text": "Онда екі немесе одан да көп кесте біріктірілсе"
      },
      {
        "id": "2f970e64-fa04-4842-8fcf-7dae3b832325",
        "text": "X-тің бір мәніне Y-тің бірнеше тәуелсіз мәндер жиыны сәйкес келеді және олар үшінші Z атрибутына тәуелсіз сақталады"
      },
      {
        "id": "f82b7b79-df12-490c-8d2a-0959374e3aa0",
        "text": "Жартылай тәуелділік"
      },
      {
        "id": "a12748f4-85e3-4d59-a8ec-9ef781afc95b",
        "text": "Транзитивті тәуелділіктердің болуы"
      }
    ],
    "correctOptionIds": [
      "d4f58643-a38e-4dd6-ab93-4051fb9081ce"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "45b00ca5-133e-493b-9b03-ba0dcc5d1f67",
    "subjectId": "db",
    "text": "Егер X -> Y және Y -> Z болса, Армстронг аксиомасы бойынша қандай функционалдық тәуелділік шығады?",
    "options": [
      {
        "id": "b230661c-005c-44a9-9ef4-a0e97081aa59",
        "text": "X -> Z"
      },
      {
        "id": "03b11e3c-5364-435f-8ea9-f5dc519593de",
        "text": "Z -> X"
      },
      {
        "id": "6d2140c9-0086-4f57-a116-370398ec7341",
        "text": "Y -> X"
      },
      {
        "id": "b5761e98-5273-4c1b-a7f5-8441422d2d1d",
        "text": "XZ -> Y"
      },
      {
        "id": "d105ab5f-b914-4464-b85f-f62e170201be",
        "text": "Егер кестеде сыртқы кілттер мүлдем болмаса"
      },
      {
        "id": "9d82e415-e873-46ff-9c9f-ab7b1921fa1f",
        "text": "Артық деректер мен аномалияларды азайту"
      },
      {
        "id": "4db95e2d-4d10-44a8-a4c4-ee5e22f2fb41",
        "text": "Транзакциялардың сәтсіз орындалуы"
      },
      {
        "id": "42a08099-9460-4477-ad93-1b33a731d4ec",
        "text": "Кандидаттық кілттер мүлдем болмауы тиіс"
      }
    ],
    "correctOptionIds": [
      "b230661c-005c-44a9-9ef4-a0e97081aa59"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "fc0156f7-111f-4948-9695-52ef78f782e5",
    "subjectId": "db",
    "text": "Егер X -> Y болса, Армстронг бойынша XZ -> YZ ережесі қалай аталады?",
    "options": [
      {
        "id": "2b25a205-97dc-4431-b605-c0488b9be0b3",
        "text": "Аугментация (Augmentation)"
      },
      {
        "id": "177fc9cf-7410-4732-bc21-8d738e5d1aa5",
        "text": "Рефлексивтілік (Reflexivity)"
      },
      {
        "id": "4dffee98-bb45-4f2a-965e-a1b3f6e99b0e",
        "text": "Транзитивтілік (Transitivity)"
      },
      {
        "id": "dd98e963-cbb1-4487-bfda-7c9de1f79b2c",
        "text": "Ыдырату (Decomposition)"
      },
      {
        "id": "afbe497c-1bc4-46c3-99a3-87a5b52d8c7d",
        "text": "X Y-ға тең емес"
      },
      {
        "id": "6937ba0c-be94-4248-8fd2-efeccff473d2",
        "text": "Деректердің артықшылығын жою және жаңарту, қосу, өшіру аномалияларын болдырмау"
      },
      {
        "id": "7d981568-800a-4df3-b5ec-f6c71feb6d7b",
        "text": "Ең аз жазбасы бар кесте"
      },
      {
        "id": "9559f3be-2daa-4b02-856c-6cf220acceee",
        "text": "Транзитивті тәуелділік"
      }
    ],
    "correctOptionIds": [
      "2b25a205-97dc-4431-b605-c0488b9be0b3"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "869fc6fb-a093-4b5c-bee0-41cb04a7ad3e",
    "subjectId": "db",
    "text": "Егер X -> Y болса және Y ⊆ X болса, бұл қандай функционалдық тәуелділік?",
    "options": [
      {
        "id": "797896ac-32d6-4c48-b654-d0d989497ed1",
        "text": "Тривиалды тәуелділік"
      },
      {
        "id": "6e682332-cf82-483c-b094-40d4cd8b1e5c",
        "text": "Бейтривиалды тәуелділік"
      },
      {
        "id": "253a8591-2d6c-434f-9f9a-0417c48baa7a",
        "text": "Жартылай тәуелділік"
      },
      {
        "id": "6ee23d4e-0d5a-48bb-9cf1-dd194596a5b6",
        "text": "Транзитивті тәуелділік"
      },
      {
        "id": "ec17cb75-7516-46e0-a286-65a5f33ecf2a",
        "text": "Жаңа С бағанын өшіру арқылы"
      },
      {
        "id": "74967436-ce79-4d92-8c49-19ffb5cc6138",
        "text": "Бір дерек бірнеше жерде қайталанғандықтан, оны өзгерткен кезде барлық жолдарда бірдей жаңартпаса, деректердің қайшылыққа (inconsistency) ұшырауы"
      },
      {
        "id": "3d908f64-a4b8-4c42-9128-f6c2564fa32b",
        "text": "BCNF"
      },
      {
        "id": "00c722ce-1db5-4c21-9593-6d8281f1be5d",
        "text": "Суперкілт"
      }
    ],
    "correctOptionIds": [
      "797896ac-32d6-4c48-b654-d0d989497ed1"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "a97ee856-e06f-44bb-b486-3cfce5aa21ac",
    "subjectId": "db",
    "text": "Нормализациялау теориясындағы Chase алгоритмі не үшін қолданылады?",
    "options": [
      {
        "id": "b301bebd-8539-43e2-80e7-7c8a007373f0",
        "text": "Ыдыратудың lossless join (жоғалтусыз біріктіру) қасиетін тексеру үшін"
      },
      {
        "id": "b3ca1ad7-f337-4255-9a75-238f0bb679f7",
        "text": "Функционалдық тәуелділіктердің санын көбейту үшін"
      },
      {
        "id": "e14c70d8-c731-41f4-8951-f49345c911ad",
        "text": "Кестедегі индекстерді оңтайландыру үшін"
      },
      {
        "id": "cd4587cb-dbf6-4a8c-ab2e-ebade24b3ea5",
        "text": "Транзакцияларды бұғаттау үшін"
      },
      {
        "id": "f8fb14d8-d39d-4065-a44c-f4b98a1f4364",
        "text": "Егер X -> Y және Y -> Z болса, онда X -> Z орындалады"
      },
      {
        "id": "540ff9ba-b42d-41f1-a837-0ebcd884073a",
        "text": "Сыртқы кілттің байланысын жоя алмау"
      },
      {
        "id": "e7a5c60d-fb3d-4c63-af27-b1edb13ee3dc",
        "text": "Егер X -> Y болса, онда Y -> X орындалады"
      },
      {
        "id": "f570683f-3e42-40e0-9eb2-d7c5095348d9",
        "text": "Онда екі немесе одан да көп кесте біріктірілсе"
      }
    ],
    "correctOptionIds": [
      "b301bebd-8539-43e2-80e7-7c8a007373f0"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "7d23cbbb-2c3a-4be6-80c4-025988a07a51",
    "subjectId": "db",
    "text": "3NF-ке келтіру кезінде әрқашан lossless join және dependency preservation қасиеттеріне бірдей қол жеткізуге болады ма?",
    "options": [
      {
        "id": "6e0b0614-57a8-4b02-a419-40a02ee43803",
        "text": "Иә, 3NF-те екі қасиет те әрқашан сақталады"
      },
      {
        "id": "49421709-3a8b-47f3-9a88-27d72b3a67b8",
        "text": "Жоқ, ешқашан сақталмайды"
      },
      {
        "id": "dea2b1a2-117e-4357-adf5-a9e143900d0a",
        "text": "Тек сандық кестелерде ғана сақталады"
      },
      {
        "id": "f6a91e94-376b-4a82-968b-0053bcdb8255",
        "text": "Тек BCNF-ке өткенде ғана сақталады"
      },
      {
        "id": "13fa5b5a-1d69-49c3-b647-249ed3ef38f0",
        "text": "Атрибут барлық кілтке тәуелді"
      },
      {
        "id": "18e6f7d4-91b7-4764-8951-8f9fe87f8856",
        "text": "Тек сыртқы кілттері бар кесте"
      },
      {
        "id": "b883ccf9-5b99-4a8b-9504-d0a5d60dad95",
        "text": "Қосымша ақпаратсыз жаңа дерек қосу мүмкін емес"
      },
      {
        "id": "0d060325-3d97-474a-829d-222b741f0b0f",
        "text": "Суррогаттық кілт"
      }
    ],
    "correctOptionIds": [
      "6e0b0614-57a8-4b02-a419-40a02ee43803"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "be33c451-5c10-4945-a12a-7f3bf8bf073e",
    "subjectId": "db",
    "text": "BCNF-ке келтіру кезінде әрқашан lossless join және dependency preservation қасиеттеріне бірдей қол жеткізуге болады ма?",
    "options": [
      {
        "id": "761fc55a-091a-4eb1-9956-6ec8ab4112d7",
        "text": "Жоқ, BCNF-те кейде функционалдық тәуелділікті сақтау мүмкін болмайды (trade-off)"
      },
      {
        "id": "7f5d22c3-b09f-4488-869b-2ac2143cf670",
        "text": "Иә, BCNF әрқашан екі қасиетті де толық сақтайды"
      },
      {
        "id": "54ee4990-646a-44ff-8c90-e5211a8683cf",
        "text": "BCNF-те тек қана dependency preservation орындалады"
      },
      {
        "id": "76382dac-b14c-44fd-b7e9-0385299918fa",
        "text": "Ешқандай қасиет сақталмайды"
      },
      {
        "id": "41c34f98-56ec-4d1a-9a3f-12aa0a8c4ab0",
        "text": "Деректердің артықшылығын жою және жаңарту, қосу, өшіру аномалияларын болдырмау"
      },
      {
        "id": "b65faccc-19e6-4d8e-86be-34b964d2d35e",
        "text": "Оларды бір кестеге біріктіру арқылы"
      },
      {
        "id": "f494aa09-f24a-4587-88a3-d5b8f201cb8a",
        "text": "Транзитивті тәуелділіктер"
      },
      {
        "id": "237679e9-a51f-4d14-bebb-3c56e6c89909",
        "text": "2NF + транзитивті тәуелділік жоқ"
      }
    ],
    "correctOptionIds": [
      "761fc55a-091a-4eb1-9956-6ec8ab4112d7"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "d266a3e5-6f30-454d-9d19-673a43a304d0",
    "subjectId": "db",
    "text": "Функционалдық тәуелділікті сақтау (Dependency Preservation) неліктен маңызды?",
    "options": [
      {
        "id": "f9daa07e-de2c-4460-b857-617d23757da1",
        "text": "Деректерді қосқанда немесе өзгерткенде кестелерді JOIN жасамай-ақ, тұтастық шектеулерін тез тексеру үшін"
      },
      {
        "id": "9020a9e3-4b8d-491d-a808-4287a596f0fb",
        "text": "Индекстерді жылдам оқу үшін"
      },
      {
        "id": "18f37fbf-0432-4010-8f1e-286f491adf9d",
        "text": "Кестелердің санын азайту үшін"
      },
      {
        "id": "5d42d104-ebd6-4b33-8863-ce6d47efbcf5",
        "text": "Орын үнемдеу үшін"
      },
      {
        "id": "9acfaf70-daea-4a1b-bbef-1a0dee7b6a42",
        "text": "Транзитивті қалыпты форма"
      },
      {
        "id": "6a06ede4-2460-43bc-936d-44cfccd02ec6",
        "text": "Барлық атрибуттардың мәндері атомарлы (бөлінбейтін) болуы және қайталанатын топтардың болмауы"
      },
      {
        "id": "b085c060-b684-4ae7-adaa-0739d5bdcb18",
        "text": "Деректерді шифрлау"
      },
      {
        "id": "5c79bd95-542f-456f-ae60-7f12e13750eb",
        "text": "Бос жиын"
      }
    ],
    "correctOptionIds": [
      "f9daa07e-de2c-4460-b857-617d23757da1"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "51ab6e42-f32b-41b9-9767-799fa6dcab28",
    "subjectId": "db",
    "text": "Көпмәнді тәуелділіктің (MVD) болуы кестеде қандай негізгі аномалия туғызады?",
    "options": [
      {
        "id": "9bfddbce-21a9-4f8d-97aa-0f4318d94466",
        "text": "Деректердің тым көп қайталануын (redundancy) және сәйкессіздікті"
      },
      {
        "id": "2a1e7a1f-e339-44ee-a87a-e5c591dccb12",
        "text": "Сұраныстардың мүлдем орындалмай қалуын"
      },
      {
        "id": "0ab54a83-7f63-4c92-a65e-160cd3a9edcf",
        "text": "Бастапқы кілттің автоматты өшіп қалуын"
      },
      {
        "id": "16b2b06e-34fb-4d45-941e-95b6918f81d8",
        "text": "Кестеде бос ұяшықтардың көбеюін"
      },
      {
        "id": "1a840567-c410-421c-bc6b-056655627329",
        "text": "Кесте 2NF-те болуы және кілттік емес атрибуттардың арасында транзитивті тәуелділік болмауы тиіс"
      },
      {
        "id": "4bc38be5-066b-4690-bc75-cb081d2a8fd8",
        "text": "Бір дерек бірнеше жерде қайталанғандықтан, оны өзгерткен кезде барлық жолдарда бірдей жаңартпаса, деректердің қайшылыққа (inconsistency) ұшырауы"
      },
      {
        "id": "621fc103-54d1-4a80-9728-81145d5c1ac4",
        "text": "Кесте құрылымын жоюды білдіреді"
      },
      {
        "id": "0f0fd354-d2c3-4891-b016-274251288337",
        "text": "Логикалық жобалау кезеңінде"
      }
    ],
    "correctOptionIds": [
      "9bfddbce-21a9-4f8d-97aa-0f4318d94466"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "92cdb6b3-1fff-4c4c-ba63-c2e9ca423ae3",
    "subjectId": "db",
    "text": "4NF-ке келтіру үшін қандай әрекет орындалады?",
    "options": [
      {
        "id": "5e2161fb-d164-44c8-a810-2371a9156542",
        "text": "Тәуелсіз көпмәнді тәуелділіктерді бөлек кестелерге ыдырату"
      },
      {
        "id": "ac103d29-c681-43b2-87fd-14228a7cf895",
        "text": "Транзитивті тәуелділікті жою"
      },
      {
        "id": "1536fbaa-1e38-4e00-9258-02989b0ba0f0",
        "text": "Кестелерді біріктіру"
      },
      {
        "id": "191df605-5f00-4401-97ff-8b43de322f53",
        "text": "Кестеге жаңа бірегей индекс қосу"
      },
      {
        "id": "f8ef5de4-3816-4f56-877a-b1d1c3697a9e",
        "text": "Артық деректерді азайту процесі"
      },
      {
        "id": "8c837086-b7fb-43d1-afca-f2080883976e",
        "text": "Кестедегі NULL мәндерді табу үшін"
      },
      {
        "id": "7565c559-30cb-4f29-ad84-728fded04edb",
        "text": "Дерек жою мүмкін емес"
      },
      {
        "id": "3ccef4fd-4e48-48ff-90bf-27f44c61bd8d",
        "text": "X Y-ға тең емес"
      }
    ],
    "correctOptionIds": [
      "5e2161fb-d164-44c8-a810-2371a9156542"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "a4d8c84c-5fad-46fe-93d2-d9aeca0cfd79",
    "subjectId": "db",
    "text": "Кандидаттық кілттердің саны кестеде бірнешеу болуы мүмкін бе?",
    "options": [
      {
        "id": "2de6ca8d-b1f9-48cb-aa1f-c59664d0b6e9",
        "text": "Иә, бірақ бастапқы кілт тек біреу ғана болады"
      },
      {
        "id": "41136c85-40ac-47e1-ae70-60e997124379",
        "text": "Жоқ, тек біреу ғана болуы тиіс"
      },
      {
        "id": "977617eb-a636-4912-a4fd-80988cd2d254",
        "text": "Тек сандық кестелерде ғана бірнешеу болады"
      },
      {
        "id": "48a82e32-28aa-471e-8e08-0632dcf9c1d8",
        "text": "Бастапқы кілтпен бірге ең көп дегенде екеу болады"
      },
      {
        "id": "dc6a5a5a-9871-44e2-8e0f-317dc9701fd1",
        "text": "Егер X -> Y және Y -> Z болса, онда X -> Z орындалады"
      },
      {
        "id": "4aa02a45-6f07-4238-9c60-fa8fe55955cb",
        "text": "Кілтсіз тәуелділік"
      },
      {
        "id": "451bd077-9d22-4568-a821-620cd0de0097",
        "text": "Суперкілт"
      },
      {
        "id": "e7193123-a02d-4243-a1fa-00cdc8a6dfe3",
        "text": "Транзитивті тәуелділік тудыратын (кілттік емес атрибутқа тәуелді) атрибуттарды жеке кестеге шығару"
      }
    ],
    "correctOptionIds": [
      "2de6ca8d-b1f9-48cb-aa1f-c59664d0b6e9"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "98f81db4-a31c-4708-8f41-d88de33d9843",
    "subjectId": "db",
    "text": "Superkey мен Candidate Key арасындағы қатынасты қалай сипаттауға болады?",
    "options": [
      {
        "id": "fb817cc1-4faf-4e9d-94f1-0eee0e6381a1",
        "text": "Барлық кандидаттық кілттер суперкілт болып табылады, бірақ барлық суперкілттер кандидаттық кілт емес"
      },
      {
        "id": "422dd8e0-2135-4109-aa2e-986782a9f3df",
        "text": "Барлық суперкілттер кандидаттық кілт болады"
      },
      {
        "id": "f2a3fe40-3f38-44ff-b14d-d565c8717719",
        "text": "Олардың арасында ешқандай байланыс жоқ"
      },
      {
        "id": "f7e69a65-4498-4045-8dd2-d5d3d32fd7aa",
        "text": "Кандидаттық кілт әрқашан суперкілттен үлкен болады"
      },
      {
        "id": "0fa3abac-0190-4e6b-8062-e70395846d64",
        "text": "Сыртқы атрибуттар"
      },
      {
        "id": "f1ac10c9-c135-41da-926e-9a0228eeb0f5",
        "text": "Кестеде тек INNER JOIN қолданылса"
      },
      {
        "id": "bceb1ead-56f1-4490-a296-d1e5c8e65abe",
        "text": "Кез келген атрибут"
      },
      {
        "id": "13cf0a32-d493-41d5-84b9-7c99ad18e724",
        "text": "Егер X -> Y және X -> Z болса, онда X -> YZ орындалады"
      }
    ],
    "correctOptionIds": [
      "fb817cc1-4faf-4e9d-94f1-0eee0e6381a1"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "a2e5750c-b5f9-46cf-9caf-d2d0f627c26e",
    "subjectId": "db",
    "text": "Реляциялық модельде кестенің әрбір жолы (Row) қалай аталады?",
    "options": [
      {
        "id": "a8a4c26f-1e7e-48dd-b0d6-a70f4fa91646",
        "text": "Кортеж (Tuple)"
      },
      {
        "id": "7cab34b7-2818-4d24-b569-cf41d2fa2683",
        "text": "Атрибут (Attribute)"
      },
      {
        "id": "24d1ea39-488f-4898-91dc-0b1f97d2ba49",
        "text": "Домен (Domain)"
      },
      {
        "id": "5bdfb5f9-f905-4269-a020-93b9deefca64",
        "text": "Қатынас (Relation)"
      },
      {
        "id": "dddc4821-6e23-48eb-a778-a02e7e5a1f14",
        "text": "X пен Y бірдей бағандар болса"
      },
      {
        "id": "ea242b41-b937-42a9-a931-209274cb69dc",
        "text": "Y атрибуты құрама X кілтінің тек бір бөлігіне ғана тәуелді болса"
      },
      {
        "id": "88d455b0-fec2-4b0d-b1f9-4ac5591353bb",
        "text": "Транзитивті тәуелділік"
      },
      {
        "id": "419cedfd-e32a-48a9-aa58-86a659f403ca",
        "text": "Транзитивті тәуелділіктерді жою"
      }
    ],
    "correctOptionIds": [
      "a8a4c26f-1e7e-48dd-b0d6-a70f4fa91646"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "282e0207-2d71-4a63-b823-d5a630745ed2",
    "subjectId": "db",
    "text": "Реляциялық модельде кестенің бағаны (Column) қалай аталады?",
    "options": [
      {
        "id": "9460a356-b0ae-4353-aa41-93a1649456d2",
        "text": "Атрибут (Attribute)"
      },
      {
        "id": "1a4d14e8-6cf9-48d9-9fa1-941c7284bb65",
        "text": "Кортеж (Tuple)"
      },
      {
        "id": "c08297b5-e862-4cf4-bb23-3417b7d30c9d",
        "text": "Домен (Domain)"
      },
      {
        "id": "6c56a4bf-6899-4f70-be21-e0d918cae6d2",
        "text": "Схема (Schema)"
      },
      {
        "id": "cc2e2f67-8175-47d2-b369-b8963ce0e65d",
        "text": "Егер кестеде бірнеше қиылысатын құрама кандидаттық кілттер болса"
      },
      {
        "id": "fa50a37a-6ae0-427d-86c1-2874097475f1",
        "text": "Минималды кілт"
      },
      {
        "id": "4ec290ff-905f-4cbf-9006-291a38aaccdf",
        "text": "Тек бір бағаннан тұратын бастапқы кілт"
      },
      {
        "id": "edfb7663-8f81-494f-9179-029c49dcc451",
        "text": "Кестенің ең бірінші бағаны"
      }
    ],
    "correctOptionIds": [
      "9460a356-b0ae-4353-aa41-93a1649456d2"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "8ae2a40a-9df7-4d7d-abc0-7282d5628961",
    "subjectId": "db",
    "text": "Нормализация процесін жобалаудың қай кезеңінде орындаған дұрыс?",
    "options": [
      {
        "id": "29cb4550-4c95-41c2-8faf-bd52c4d9750d",
        "text": "Логикалық жобалау кезеңінде"
      },
      {
        "id": "0808f86e-8453-4f8f-b9d5-42aed9835830",
        "text": "Концептуалды жобалау кезеңінде"
      },
      {
        "id": "87edd02e-e5f3-4dc2-b9de-d7efb2aae683",
        "text": "Физикалық жобалау кезеңінде"
      },
      {
        "id": "c8020ce6-8fa4-40e2-aecd-483c88c1d896",
        "text": "Талаптарды жинау кезеңінде"
      },
      {
        "id": "df892a5d-2a8b-4761-b9ef-3bf63f26fb7c",
        "text": "Иә, бірақ бастапқы кілт тек біреу ғана болады"
      },
      {
        "id": "8f3e0fcf-6f2f-4f48-852f-424b64649758",
        "text": "Егер кестеде бірнеше қиылысатын құрама кандидаттық кілттер болса"
      },
      {
        "id": "bb946ccb-6cb3-4b24-b9f2-b9f78f6cbe2d",
        "text": "Y мәні X-ке функционалды тәуелді"
      },
      {
        "id": "3b32bb1a-63ad-4256-a2cc-4828aa1a6acb",
        "text": "Ыдырату (Decomposition)"
      }
    ],
    "correctOptionIds": [
      "29cb4550-4c95-41c2-8faf-bd52c4d9750d"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "df8f8088-aa54-4092-a257-4ee77954e4ab",
    "subjectId": "db",
    "text": "Егер кестеде кандидаттық кілттер құрамына кіретін атрибуттар ғана болса, мұндай атрибуттар қалай аталады?",
    "options": [
      {
        "id": "48f03d0f-6fce-412c-a6d4-f921c7fa7fb9",
        "text": "Біріншілік (Prime) атрибуттар"
      },
      {
        "id": "3099daaf-c99c-4d6f-bcd3-cac4c324987a",
        "text": "Екіншілік атрибуттар"
      },
      {
        "id": "c957250d-b6c5-46ff-a9db-f78bf7c9019d",
        "text": "Сыртқы атрибуттар"
      },
      {
        "id": "e4b6eafa-f40e-452d-88e3-1aa988c5ae3a",
        "text": "Туынды атрибуттар"
      },
      {
        "id": "604c649d-fc92-4cf6-ba7e-fb5946e3d422",
        "text": "Жаңа бағандар қосуға (alter table)"
      },
      {
        "id": "56bece5d-cd7c-4ccc-9ce3-6febce43fe17",
        "text": "Ешқандай айырмашылығы жоқ"
      },
      {
        "id": "8d18ce75-3e82-47db-a037-b37045e19527",
        "text": "Армстронг аксиомаларының көмегімен F жиынтығынан шығарылатын барлық функционалдық тәуелділіктер жиыны"
      },
      {
        "id": "5dff8bbd-c3cf-47c0-b3cf-87d1646b7d25",
        "text": "Y сыртқы кілт болса"
      }
    ],
    "correctOptionIds": [
      "48f03d0f-6fce-412c-a6d4-f921c7fa7fb9"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "3c577935-9e1c-47ea-ac07-ee1d2e4a601c",
    "subjectId": "db",
    "text": "Студенттер кестесінде (ЖСН, Тегі, Аты, Топ_ID) кандидаттық кілт қайсысы?",
    "options": [
      {
        "id": "7d429cc0-6431-4013-9146-7642e00f3bdb",
        "text": "ЖСН"
      },
      {
        "id": "b76eacd0-4846-4197-b1b4-b0d252526463",
        "text": "Тегі"
      },
      {
        "id": "b76fe9bf-e7a5-4410-8a9b-247c2be57582",
        "text": "Топ_ID"
      },
      {
        "id": "44253aef-d567-469c-8c0b-c13d277741df",
        "text": "Аты"
      },
      {
        "id": "196a073c-0b08-4974-a2eb-6c88341444ff",
        "text": "Кестенің ең бірінші бағаны"
      },
      {
        "id": "2f5ac810-c6c9-4170-b313-ed3aad20c9be",
        "text": "Кестеде сыртқы кілттер (FK) болмауы тиіс"
      },
      {
        "id": "efd5bbe3-2bb1-4cb8-9fa9-386f9f4c7e24",
        "text": "Кестені физикалық файлдарға бөлу үшін"
      },
      {
        "id": "b6ab980f-e346-4402-a4d7-6cf2e56b9ef3",
        "text": "Тек бір ғана (егер олар көп болса, оларды жеке кестелерге бөлу керек)"
      }
    ],
    "correctOptionIds": [
      "7d429cc0-6431-4013-9146-7642e00f3bdb"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "cf9d82be-d689-4510-a232-bb2da5b7a030",
    "subjectId": "db",
    "text": "Егер A -> B функционалдық тәуелділігі орындалса, бұл нені білдіреді?",
    "options": [
      {
        "id": "198ba545-f5c5-44a8-8c87-3e59ec021ac1",
        "text": "А-ның әрбір мәніне В-ның тек бір ғана мәні сәйкес келеді"
      },
      {
        "id": "cd64103d-2d78-4c70-86c9-a86c4a26b16b",
        "text": "А және В мәндері әрқашан тең болады"
      },
      {
        "id": "28237115-c1bc-407c-8540-cb5b6d895c0b",
        "text": "В бастапқы кілт болып табылады"
      },
      {
        "id": "9fc45e9b-c1e6-47cc-b03b-7dea95e30f67",
        "text": "А мәні өзгергенде В өзгермейді"
      },
      {
        "id": "1ae98c19-04f6-44b4-a1f8-836a9249c92f",
        "text": "BCNF-те транзитивті тәуелділіктерге рұқсат беріледі"
      },
      {
        "id": "78b5e9e1-e8ec-4169-a3cd-4f99dc237404",
        "text": "Барлық суперкілттер кандидаттық кілт болады"
      },
      {
        "id": "f17e605f-32f0-4174-9b07-6bbe2f155b28",
        "text": "Егер Y ⊆ X болса, онда X -> Y орындалады"
      },
      {
        "id": "f51a98a5-577d-428f-b566-52d8a42edbcf",
        "text": "Кестелерді бөлу"
      }
    ],
    "correctOptionIds": [
      "198ba545-f5c5-44a8-8c87-3e59ec021ac1"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "b29e8196-bfb6-4ee1-9bec-7f07033d49b4",
    "subjectId": "db",
    "text": "Армстронг аксиомаларының толықтығы (Completeness of Armstrong's Axioms) нені білдіреді?",
    "options": [
      {
        "id": "701477bb-fbe6-4e15-b1df-a40cf0eb1e79",
        "text": "F жиынтығынан логикалық түрде шығатын кез келген FD-ны осы аксиомалар арқылы дәлелдеуге болатындығын"
      },
      {
        "id": "c55f0ea6-63b7-44ee-9d00-004d4d4c8f2f",
        "text": "Аксиомалардың тек сандар үшін орындалатынын"
      },
      {
        "id": "ed3a0553-32ee-419a-a9b1-81c125eeb377",
        "text": "Ешқандай жаңа функционалдық тәуелділік құру мүмкін еместігін"
      },
      {
        "id": "b5b3a127-026e-48a9-9766-554d78f83169",
        "text": "Кестенің толық нормализацияланғанын"
      },
      {
        "id": "0270e43a-c152-4056-946d-f9318cb97d57",
        "text": "JOIN операторларының көбеюіне байланысты күрделі оқу сұраныстарының баяулауы"
      },
      {
        "id": "efc4c826-58fa-440a-b91a-7d41eb8f8e5e",
        "text": "А мәні өзгергенде В өзгермейді"
      },
      {
        "id": "67f32bca-58c1-4be2-aca7-0096faf342ae",
        "text": "Бөлуге болатын мән"
      },
      {
        "id": "1f8ecf2e-18cb-463f-9636-6c3ad6013ee1",
        "text": "Сыртқы кілттің орындалуын тексеру үшін"
      }
    ],
    "correctOptionIds": [
      "701477bb-fbe6-4e15-b1df-a40cf0eb1e79"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "1eb56d1e-f36d-4a2f-9223-00d2022303fc",
    "subjectId": "db",
    "text": "Армстронг аксиомаларының дұрыстығы (Soundness of Armstrong's Axioms) нені білдіреді?",
    "options": [
      {
        "id": "13cf5c20-5744-4896-ab14-49bbf13dd036",
        "text": "Осы аксиомалар арқылы шығарылған кез келген FD-ның ақиқат болатындығын"
      },
      {
        "id": "3e1b59d8-3ab6-47d0-8236-d7e54fb07259",
        "text": "Аксиомалардың қатесіз жазылуын"
      },
      {
        "id": "0b6497a0-6f5f-4ff6-9afc-2693a3fb15aa",
        "text": "Дерекқордың оңтайлы жұмыс істейтінін"
      },
      {
        "id": "398dcee1-59f0-475f-9d52-ceeb85a90c6c",
        "text": "Кесте құрылымының өзгермейтінін"
      },
      {
        "id": "05d96eea-4d27-4a04-93e2-63568b108667",
        "text": "Физикалық жобалау кезеңінде"
      },
      {
        "id": "d331a20e-de8c-4dfe-bc50-5667130b82e4",
        "text": "Кестедегі индекстерді азайту"
      },
      {
        "id": "f800dbce-3f8e-443f-a461-eb392bca511c",
        "text": "Функционалдық тәуелділіктердің санын көбейту үшін"
      },
      {
        "id": "67ff7d1c-73e2-451c-8de3-785171086896",
        "text": "Тек бір бағаннан тұратын бастапқы кілт"
      }
    ],
    "correctOptionIds": [
      "13cf5c20-5744-4896-ab14-49bbf13dd036"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "d78d532d-d91f-4bc9-ba38-262a033b3d47",
    "subjectId": "db",
    "text": "BCNF анықтамасын алғаш рет кім ұсынды?",
    "options": [
      {
        "id": "2e0c441a-2a97-486e-9ffd-5af1a8b0dcc2",
        "text": "Рэймонд Бойс және Эдгар Кодд (Raymond F. Boyce and Edgar F. Codd)"
      },
      {
        "id": "a0a34895-e735-4e47-b531-46f25fa5c3bf",
        "text": "Питер Чен"
      },
      {
        "id": "639b2279-77e3-43e3-8aef-fb150cb31c32",
        "text": "Алан Тьюринг"
      },
      {
        "id": "c0f53381-c39a-458e-8d5e-184daad5deaa",
        "text": "Дональд Кнут"
      },
      {
        "id": "dc8ef934-82e8-4261-942c-2f0b178c2d85",
        "text": "Транзитивті тәуелділіктердің болмауы"
      },
      {
        "id": "006fe774-d414-42f5-b26b-6a7010d95948",
        "text": "Оның барлық бағандары тек сандық типті болса"
      },
      {
        "id": "30a3988c-ab05-45a5-9c03-8da024213107",
        "text": "Тек сандық кестелерде ғана бірнешеу болады"
      },
      {
        "id": "8f58a451-fc75-4442-a70a-6aa23002911a",
        "text": "Кестелерді біріктіру"
      }
    ],
    "correctOptionIds": [
      "2e0c441a-2a97-486e-9ffd-5af1a8b0dcc2"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  },
  {
    "id": "85358301-7836-4f19-bf38-c435c6d4d869",
    "subjectId": "db",
    "text": "5NF нормализациясында Join Dependency неше кестені біріктіруді қарастырады?",
    "options": [
      {
        "id": "cae9ce2f-7df0-48eb-9dae-d40115218c20",
        "text": "Үш немесе одан да көп кестелерді"
      },
      {
        "id": "7161a98d-4173-46fb-a0ff-30401b8e9003",
        "text": "Тек екі кестені ғана"
      },
      {
        "id": "41ae91dc-c7b7-45db-b43e-3a2b56b74cc3",
        "text": "Кестелердің шексіз санын"
      },
      {
        "id": "2fb2b344-b382-4dd8-9fdc-7110f8f7ed4a",
        "text": "Бір кестенің өз-өзімен бірігуін"
      },
      {
        "id": "f467830e-10fe-48ca-92e9-45ec918ad732",
        "text": "Транзитивті тәуелділіктерді толығымен жою"
      },
      {
        "id": "008131c1-1884-461b-9b5f-7e789f572a3e",
        "text": "Бастапқы кілт (Primary Key)"
      },
      {
        "id": "25e2ac3c-5c06-452b-add8-90c4cd54b206",
        "text": "Кестедегі барлық индекстерді жою"
      },
      {
        "id": "041a1803-d72e-4b1c-bdb7-f123c77477ba",
        "text": "Жоқ, BCNF-те кейде функционалдық тәуелділікті сақтау мүмкін болмайды (trade-off)"
      }
    ],
    "correctOptionIds": [
      "cae9ce2f-7df0-48eb-9dae-d40115218c20"
    ],
    "type": "MULTIPLE",
    "topic": "Нормализация",
    "difficulty": "medium"
  }
] as Question[];
