import { Question } from '../../../../types';

// algo / Алгоритмдердің әртүрлі құрылымдарын бағдарламалау
export const algo3ProgrammingStructuresQuestions = [
  {
    "id": "0da8267d-cf92-4d39-8637-f9214610827d",
    "subjectId": "algo",
    "text": "Екі өлшемді массив дегеніміз не?",
    "options": [
      {
        "id": "07a68b7a-acd0-42b0-ad94-1c1d4f404b99",
        "text": "Цикл"
      },
      {
        "id": "56204832-3ef5-4e74-ab0e-57e3636da258",
        "text": "Кесте тәрізді массив"
      },
      {
        "id": "76b72265-28f6-4db6-9e1b-f9b2fc2ec2c8",
        "text": "Функция"
      },
      {
        "id": "7cbe3fef-4028-49ff-9511-c5d2a3a63cf7",
        "text": "Бір жолдық массив"
      }
    ],
    "correctOptionIds": [
      "56204832-3ef5-4e74-ab0e-57e3636da258"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "26050813-acd3-4cc8-ac0d-3b9609a858eb",
    "subjectId": "algo",
    "text": "switch-case операторы не үшін қолданылады?",
    "options": [
      {
        "id": "0ecd3903-3e36-4772-9155-9d7ad57303ba",
        "text": "Бірнеше мән бойынша таңдау"
      },
      {
        "id": "57259a7c-add4-485c-a16f-3b0e696b7054",
        "text": "Функция анықтау"
      },
      {
        "id": "65a3395c-d6c2-40d3-ae2a-19dbc69a74c4",
        "text": "Массив құру"
      },
      {
        "id": "9eebd7ce-229f-435c-ae29-0360600d6cde",
        "text": "Цикл құру"
      }
    ],
    "correctOptionIds": [
      "0ecd3903-3e36-4772-9155-9d7ad57303ba"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "2b3409a8-15d5-4c31-a938-6b5eb25165f1",
    "subjectId": "algo",
    "text": "while циклі қашан тоқтайды?",
    "options": [
      {
        "id": "23ffcbfb-657d-4d2f-a413-2d5088a8abe2",
        "text": "Әрқашан"
      },
      {
        "id": "373c6603-b5e5-4649-bc35-4822c5c1f888",
        "text": "Шарт true болғанда"
      },
      {
        "id": "ae70fb71-a95d-474b-b49e-6f0f126c1ccf",
        "text": "5 қайталаудан кейін"
      },
      {
        "id": "e0efc9c4-1c06-4fa7-b76b-3599c8dacb0e",
        "text": "Шарт false болғанда"
      }
    ],
    "correctOptionIds": [
      "e0efc9c4-1c06-4fa7-b76b-3599c8dacb0e"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "2f59a123-153c-4b8f-8045-0419c351041f",
    "subjectId": "algo",
    "text": "Массив дегеніміз не?",
    "options": [
      {
        "id": "23ebd0b1-955c-4da7-8e29-8aa99e23658c",
        "text": "Цикл түрі"
      },
      {
        "id": "33c51dde-7118-4191-8ab3-9bbaa4b7dd7f",
        "text": "Функция"
      },
      {
        "id": "979d4ec0-ba86-4069-a00c-2be19c34ef43",
        "text": "Бір типті элементтер жиыны"
      },
      {
        "id": "c1810c1b-3ac6-42d1-b890-fc7ce1e672b1",
        "text": "Бір айнымалы"
      }
    ],
    "correctOptionIds": [
      "979d4ec0-ba86-4069-a00c-2be19c34ef43"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "49f4790e-8e70-4555-8c6b-403bca366ad7",
    "subjectId": "algo",
    "text": "for циклінің құрылымы қандай?",
    "options": [
      {
        "id": "25ae2580-68d5-4c00-9315-2f43cf83073c",
        "text": "for(шарт)"
      },
      {
        "id": "8e63c79a-0243-41c9-befe-de55d9ed5339",
        "text": "for(инициализация; шарт; өзгерту)"
      },
      {
        "id": "adc3fd2d-e95f-4492-a4b9-65c348dcd0b8",
        "text": "for(санау)"
      },
      {
        "id": "f4aefd72-5a45-4675-99ac-27abf709e39b",
        "text": "for(әрекет)"
      }
    ],
    "correctOptionIds": [
      "8e63c79a-0243-41c9-befe-de55d9ed5339"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "51b92b5f-e0c7-42a5-86a8-9174a116e287",
    "subjectId": "algo",
    "text": "if-else операторы не үшін қолданылады?",
    "options": [
      {
        "id": "1c327daa-cb00-469d-8d7f-e69177d1990b",
        "text": "Шарт бойынша таңдау жасау"
      },
      {
        "id": "829cfd36-1667-47e4-bb49-8373bea72d85",
        "text": "Массивті сұрыптау"
      },
      {
        "id": "b7dc7674-fbe2-4afe-956c-195119a92f5d",
        "text": "Функция құру"
      },
      {
        "id": "daccffcd-0e8e-44e2-a671-580e9624e673",
        "text": "Цикл құру"
      }
    ],
    "correctOptionIds": [
      "1c327daa-cb00-469d-8d7f-e69177d1990b"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "5d78e1fb-565e-48d4-94b4-3665618d19c0",
    "subjectId": "algo",
    "text": "Nested loops (қабаттасқан циклдер) дегеніміз не?",
    "options": [
      {
        "id": "8bca0f3c-42c7-48e3-8c17-740150098930",
        "text": "Шартты оператор"
      },
      {
        "id": "92663fea-d96e-4ef8-8b89-2684fc2e4f10",
        "text": "Функция"
      },
      {
        "id": "a13836fd-55a7-43a3-8d5c-2c14f4fabb95",
        "text": "Цикл ішінде тағы бір цикл"
      },
      {
        "id": "e936f5b5-f95e-4f4f-806e-f620f44fd320",
        "text": "Бір цикл"
      }
    ],
    "correctOptionIds": [
      "a13836fd-55a7-43a3-8d5c-2c14f4fabb95"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "754ec4e8-1ce0-4652-8b63-639fafa4ec48",
    "subjectId": "algo",
    "text": "Массивтің индексі қай саннан басталады (C++)?",
    "options": [
      {
        "id": "6f225ee5-cab6-44c4-a427-9c9952d6085d",
        "text": "-1"
      },
      {
        "id": "95f6d833-c0f1-4d92-b987-0d25714ed66f",
        "text": "0"
      },
      {
        "id": "d0a43ee5-76e3-485d-a6d3-a592aee8cfa8",
        "text": "1"
      },
      {
        "id": "e6df9a30-0731-427f-b88e-4ee1de0c40eb",
        "text": "10"
      }
    ],
    "correctOptionIds": [
      "95f6d833-c0f1-4d92-b987-0d25714ed66f"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "95acb0d2-bdc7-4b90-a062-a604dd2e4f83",
    "subjectId": "algo",
    "text": "for, while, do-while — бұлар қандай құрылымдар?",
    "options": [
      {
        "id": "2fa07d8f-b3d7-49b7-92ff-85f590645e10",
        "text": "Циклдік құрылымдар"
      },
      {
        "id": "a3f56d3a-0047-467c-9ca5-e1bb40f482b3",
        "text": "Массивтер"
      },
      {
        "id": "c3797678-904d-4b68-a791-944d88d85930",
        "text": "Шартты операторлар"
      },
      {
        "id": "f82871e0-6f09-4370-b5ea-5f483510b398",
        "text": "Функциялар"
      }
    ],
    "correctOptionIds": [
      "2fa07d8f-b3d7-49b7-92ff-85f590645e10"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "f3955703-e616-4bac-8989-cb3debd9bd04",
    "subjectId": "algo",
    "text": "do-while циклі while-дан немен айырмашылығы?",
    "options": [
      {
        "id": "16fd16ab-4d2f-4296-9c8f-e4f92da9f3d3",
        "text": "Кем дегенде 1 рет орындалады"
      },
      {
        "id": "55cb1eae-619c-47a4-84ad-504e4f9a3e5e",
        "text": "Айырмашылық жоқ"
      },
      {
        "id": "74c02213-5c99-4602-923d-98f7f1100b6c",
        "text": "Ешқашан орындалмайды"
      },
      {
        "id": "812e8559-399d-4aff-b342-15b1f591ab7d",
        "text": "Жылдамырақ"
      }
    ],
    "correctOptionIds": [
      "16fd16ab-4d2f-4296-9c8f-e4f92da9f3d3"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "0aa95463-b34a-4785-a140-8d81bc3a71ac",
    "subjectId": "algo",
    "text": "Цикл ішіндегі break операторының қызметі қандай?",
    "options": [
      {
        "id": "a9182d90-562f-419e-8dca-2421cfd20a42",
        "text": "Циклдің жұмысын бірден тоқтатып, одан шығып кету"
      },
      {
        "id": "fab727b0-2da1-4350-9c9c-be3e2fe3691f",
        "text": "Келесі қадамға бірден өту"
      },
      {
        "id": "6ff385a5-749d-4f1c-b2f0-c05ab105521d",
        "text": "Бағдарламаны толық өшіру"
      },
      {
        "id": "74a082ee-d9a8-4bdd-a6e6-1652095fc7fd",
        "text": "Функциядан мән қайтару"
      }
    ],
    "correctOptionIds": [
      "a9182d90-562f-419e-8dca-2421cfd20a42"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "6dcefc62-b9e8-48e1-8c9b-9dacdef4ea15",
    "subjectId": "algo",
    "text": "Цикл ішіндегі continue операторының қызметі қандай?",
    "options": [
      {
        "id": "1f8335f7-c9e3-4098-80d0-16da4796cf70",
        "text": "Циклдің ағымдағы қадамын өткізіп жіберіп, келесі итерацияға бірден көшу"
      },
      {
        "id": "d0a54daa-5fb2-4546-9203-576b14c2716e",
        "text": "Циклді мүлдем тоқтату"
      },
      {
        "id": "c2312406-48ce-4826-8e30-7a900100bf4f",
        "text": "Жаңа айнымалы құру"
      },
      {
        "id": "30202149-3659-41f0-9dd9-d6a981c82fd3",
        "text": "Рекурсияны іске қосу"
      }
    ],
    "correctOptionIds": [
      "1f8335f7-c9e3-4098-80d0-16da4796cf70"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "53ed4d35-4066-4530-ac43-9db5b5cf8db8",
    "subjectId": "algo",
    "text": "do-while циклінің while циклінен басты ерекшелігі неде?",
    "options": [
      {
        "id": "821b1937-8dff-44d4-8ce8-4b68b4064ba5",
        "text": "Шарт соңында тексерілетіндіктен, цикл денесі кем дегенде 1 рет орындалады"
      },
      {
        "id": "3a7596c9-c193-43f5-813b-5a01bbdfd5af",
        "text": "Шарт басында тексеріледі"
      },
      {
        "id": "46757766-2a63-41e2-a0ff-4220886a7f7d",
        "text": "Тек нақты сандармен жұмыс істейді"
      },
      {
        "id": "7ef73457-4372-4ea4-aadb-91987d713c24",
        "text": "Ешқандай айырмашылығы жоқ"
      }
    ],
    "correctOptionIds": [
      "821b1937-8dff-44d4-8ce8-4b68b4064ba5"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "0c6dd807-1126-4542-983a-e87e48661a14",
    "subjectId": "algo",
    "text": "C++ тіліндегі бір өлшемді массив элементтері жадта қалай орналасады?",
    "options": [
      {
        "id": "63293d20-89fb-483f-bfa2-3636fd211d97",
        "text": "Бір-бірінен кейін тізбектей, үзіліссіз жад ұяшықтарында"
      },
      {
        "id": "6b04f5c9-194a-40ff-bf19-e57a4ba235c0",
        "text": "Жадтың кез келген бос жерлерінде шашырап"
      },
      {
        "id": "67d627d5-65f7-489f-8fa1-5a054f4c4af4",
        "text": "Тек динамикалық үйіндіде"
      },
      {
        "id": "5092b181-f45f-43f3-b2d9-5be505c726c0",
        "text": "Кесте түрінде"
      }
    ],
    "correctOptionIds": [
      "63293d20-89fb-483f-bfa2-3636fd211d97"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "3074d2f7-1521-4ad9-bbdb-e33b52c26cfa",
    "subjectId": "algo",
    "text": "C++ тілінде жиымның (массивтің) шекарасынан шығып кету (out of bounds) кезінде компилятор қандай қате шығарады?",
    "options": [
      {
        "id": "9ae42891-8151-4b3b-8776-e3c90ce9fbd5",
        "text": "Әдетте компиляция кезеңінде қате шықпайды, бірақ бағдарлама орындалғанда runtime error болуы мүмкін"
      },
      {
        "id": "74177a55-6403-40f0-a3b3-d69b7b0405d0",
        "text": "Компиляция кезеңінде міндетті түрде қате шығады"
      },
      {
        "id": "34f3414a-8849-4f17-b33f-e1372a9d4b13",
        "text": "Ешқандай қателік болмайды"
      },
      {
        "id": "581de9ee-0252-4bbf-925d-d491c04982a9",
        "text": "Тек ескерту шығады"
      }
    ],
    "correctOptionIds": [
      "9ae42891-8151-4b3b-8776-e3c90ce9fbd5"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "400dede3-b4c7-446c-a8a2-edf78cdca425",
    "subjectId": "algo",
    "text": "Алгоритмдердің қандай негізгі үш базалық құрылымы бар?",
    "options": [
      {
        "id": "1b00d239-2390-4716-81a6-040769647401",
        "text": "Сызықтық, тармақталу, циклдік"
      },
      {
        "id": "5413a680-cc75-4adb-b21e-a028b439d0a6",
        "text": "Рекурсивті, итеративті, модульдік"
      },
      {
        "id": "43981ef5-8022-41dc-9124-af3056b52805",
        "text": "Арифметикалық, логикалық, функционалдық"
      },
      {
        "id": "56518e90-6f65-4ae9-8e93-155faaa4bdd5",
        "text": "Массивтік, тізімдік, ағаштық"
      }
    ],
    "correctOptionIds": [
      "1b00d239-2390-4716-81a6-040769647401"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "c060d564-8519-4880-a5df-78593d5035b9",
    "subjectId": "algo",
    "text": "Сызықтық алгоритмдік құрылым дегеніміз не?",
    "options": [
      {
        "id": "e3058c88-43d7-4a1b-9a38-66b966374c1e",
        "text": "Әрекеттердің ешқандай шартсыз, жазылу ретімен бірінен кейін бірі тізбектеле орындалуы"
      },
      {
        "id": "42b44b70-d4b9-4c35-8802-10a46d8b7376",
        "text": "Әрекеттердің белгілі бір шартқа байланысты таңдалып орындалуы"
      },
      {
        "id": "3381d69e-fa74-43d6-a251-635229b2f094",
        "text": "Әрекеттердің бірнеше рет қайталанып орындалуы"
      },
      {
        "id": "b94d45c2-a838-4966-91a9-184bb447772d",
        "text": "Функцияның өзін-өзі шақыруы"
      }
    ],
    "correctOptionIds": [
      "e3058c88-43d7-4a1b-9a38-66b966374c1e"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "b8730813-c434-489a-a7d0-cd396e8cecd0",
    "subjectId": "algo",
    "text": "Тармақталу құрылымының сызықтық құрылымнан басты айырмашылығы қандай?",
    "options": [
      {
        "id": "990ce0f4-70ce-42c4-af83-bc95b014b700",
        "text": "Орындалу бағыты логикалық шарттың тексерілу нәтижесіне байланысты өзгереді"
      },
      {
        "id": "b7c49046-d9e4-46e5-84f5-3548ec619ff1",
        "text": "Ол жадтан мүлдем орын алмайды"
      },
      {
        "id": "2db31bae-e79d-47bb-809f-15447390b03f",
        "text": "Онда ешқандай айнымалы қолданылмайды"
      },
      {
        "id": "31174d82-6c5a-424f-aa66-73ea745722c7",
        "text": "Әрекеттер тек бір рет қана орындалады"
      }
    ],
    "correctOptionIds": [
      "990ce0f4-70ce-42c4-af83-bc95b014b700"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "01ae4d65-18b6-4625-8481-e4083c595967",
    "subjectId": "algo",
    "text": "Циклдік алгоритмдік құрылым дегеніміз не?",
    "options": [
      {
        "id": "5c380893-7337-49a5-a8a5-45fef0e43a43",
        "text": "Белгілі бір шарт орындалғанша бірнеше рет қайталанып орындалатын әрекеттер тізбегі"
      },
      {
        "id": "1e585f21-39d1-4d48-8eb3-1bc5058e6f85",
        "text": "Бағдарламаның тек басында ғана орындалатын код"
      },
      {
        "id": "4ba20dc4-e209-447e-b551-39d3fc97b406",
        "text": "Бағдарламаның тек соңында ғана орындалатын код"
      },
      {
        "id": "137dd4c1-e5c5-4482-8a4b-1e44c30ebcbf",
        "text": "Қателіктерді тексеретін арнайы құрылым"
      }
    ],
    "correctOptionIds": [
      "5c380893-7337-49a5-a8a5-45fef0e43a43"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "014b7fe7-894a-450a-9a99-e2dc4ff246a6",
    "subjectId": "algo",
    "text": "Counter-controlled (есептегішпен басқарылатын) цикл деген не?",
    "options": [
      {
        "id": "277a67a5-30dc-4a45-ae0a-2ac144f9d0cb",
        "text": "Қайталанулар саны алдын ала белгілі болатын және есептегіш айнымалы арқылы басқарылатын цикл (мысалы, `for`)"
      },
      {
        "id": "902451a0-05c0-4b51-8edb-57ac90ddd2be",
        "text": "Белгілі бір оқиға болғанша орындалатын цикл"
      },
      {
        "id": "349c7db8-1d58-4067-99c6-cc8433c55643",
        "text": "Шексіз орындалатын цикл"
      },
      {
        "id": "c3d91e5c-378d-4990-9aa4-0ddbb276306b",
        "text": "Тұтынушы енгізгенше күтетін цикл"
      }
    ],
    "correctOptionIds": [
      "277a67a5-30dc-4a45-ae0a-2ac144f9d0cb"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "60ae848c-a9b7-40f6-856c-4d26ab517965",
    "subjectId": "algo",
    "text": "Sentinel-controlled (белгі-анықтауышпен басқарылатын) цикл деген не?",
    "options": [
      {
        "id": "af836e49-3e5f-436e-8154-395a96b056c4",
        "text": "Қайталану саны белгісіз, бірақ арнайы бір белгілік мән (мысалы, -1 немесе 0) енгізілгенде тоқтайтын цикл"
      },
      {
        "id": "4e5316d9-0f83-4276-902c-f14c8d633a88",
        "text": "Тек 10 рет қана орындалатын цикл"
      },
      {
        "id": "213f02c7-c0dd-4546-9c54-c072d910ddb6",
        "text": "Тек оң сандармен жұмыс істейтін цикл"
      },
      {
        "id": "fb42a311-45c0-40dd-b771-22a6a56fca9d",
        "text": "Жүйенің жадын тазартатын цикл"
      }
    ],
    "correctOptionIds": [
      "af836e49-3e5f-436e-8154-395a96b056c4"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "3e2e4959-21e8-4837-a96d-f06de83596d8",
    "subjectId": "algo",
    "text": "C++ тілінде статикалық массив өлшемін айнымалы арқылы жариялауға бола ма (мысалы, `int n; cin >> n; int arr[n];`) (стандартты C++ бойынша)?",
    "options": [
      {
        "id": "a3afaafa-81fa-4198-89b5-57a52ef4b291",
        "text": "Жоқ, статикалық массив өлшемі компиляция кезеңінде белгілі тұрақты (const/constexpr) мән болуы тиіс"
      },
      {
        "id": "592a6ef6-91c6-464f-a30b-cc53cc4195a5",
        "text": "Иә, кез келген айнымалыны қолдануға болады"
      },
      {
        "id": "a52a2363-20a9-4e30-877b-4d92f18dd6c0",
        "text": "Иә, тек айнымалы теріс емес болса ғана болады"
      },
      {
        "id": "9616d53f-0013-43e2-93c7-1d1fb8512d0a",
        "text": "Тек Linux компиляторларында ғана рұқсат етілген, басқа компиляторларда рұқсат етілмейді"
      }
    ],
    "correctOptionIds": [
      "a3afaafa-81fa-4198-89b5-57a52ef4b291"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "57bf3bde-3b12-4b44-b41e-14f590355a69",
    "subjectId": "algo",
    "text": "Динамикалық массивтің статикалық массивтен басты артықшылығы қандай?",
    "options": [
      {
        "id": "4d3321fb-a7a7-4c04-acf0-ebabd8c27a0c",
        "text": "Оның өлшемін бағдарлама орындалып жатқанда (runtime) пайдаланушы енгізген санға байланысты анықтауға болады"
      },
      {
        "id": "6866ada0-d7a5-4065-b0c8-f54bffba963e",
        "text": "Ол автоматты түрде сұрыпталады"
      },
      {
        "id": "5414639f-b1be-48af-a23b-1879b9785b36",
        "text": "Оған кез келген типтегі элементтерді бір уақытта араластырып сақтауға болады"
      },
      {
        "id": "6b85efc6-89b6-4e14-84d3-45c5404af624",
        "text": "Ол жадтан мүлдем орын алмайды"
      }
    ],
    "correctOptionIds": [
      "4d3321fb-a7a7-4c04-acf0-ebabd8c27a0c"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "69dfea71-5860-4166-9cc5-d5c4a8ec9631",
    "subjectId": "algo",
    "text": "C++ тілінде 5 элементтен тұратын `int arr[5] = {1, 2};` массиві жарияланса, қалған 3 элементтің мәндері неше болады?",
    "options": [
      {
        "id": "ef47f63d-5322-4144-aaa5-625a0eda7750",
        "text": "0 болады (автоматты түрде нөлмен толтырылады)"
      },
      {
        "id": "aa41029e-d71e-4cbb-b693-24cebb703a81",
        "text": "Қоқыс (кездейсоқ) мәндер болады"
      },
      {
        "id": "51c39636-a5e4-4679-a1d8-4d957a1c109d",
        "text": "Компиляция қатесі туындайды"
      },
      {
        "id": "206e1bf8-33f5-4c35-b026-dda268b544d8",
        "text": "1 және 2 мәндері қайталанады"
      }
    ],
    "correctOptionIds": [
      "ef47f63d-5322-4144-aaa5-625a0eda7750"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "57af52a6-9a8f-446e-aa07-64cf6ea78e0e",
    "subjectId": "algo",
    "text": "Екіөлшемді `int arr[3][4];` массивінде барлығы неше элемент бар?",
    "options": [
      {
        "id": "adf0da7a-a49d-422c-b230-f8aa71f806a9",
        "text": "12"
      },
      {
        "id": "4a5a5e95-fa5b-446d-ba1f-fbd4dd046ac1",
        "text": "7"
      },
      {
        "id": "2e557934-d8fd-4e2a-a638-0d73928dd6be",
        "text": "3"
      },
      {
        "id": "105feb01-cf1c-409c-b067-4945664bc1ae",
        "text": "4"
      }
    ],
    "correctOptionIds": [
      "adf0da7a-a49d-422c-b230-f8aa71f806a9"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "eb90b0b2-edcc-462e-814c-a2001294cec4",
    "subjectId": "algo",
    "text": "Екіөлшемді `arr[i][j]` массивінің бас диагоналінде орналасқан элементтердің индекстеріне қандай шарт сәйкес келеді?",
    "options": [
      {
        "id": "75a3ad9e-f9c1-4d85-a937-9014e21cc730",
        "text": "i == j"
      },
      {
        "id": "bbc4f8ae-7e51-4506-879d-c412243e7023",
        "text": "i > j"
      },
      {
        "id": "43309c52-d8ab-4054-b6ac-492feb41b753",
        "text": "i < j"
      },
      {
        "id": "f22c3f57-9373-4511-a8a6-a18991e3e07e",
        "text": "i + j == N"
      }
    ],
    "correctOptionIds": [
      "75a3ad9e-f9c1-4d85-a937-9014e21cc730"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "f9dda30b-ac3b-4d39-b8ba-402e4c0b60a8",
    "subjectId": "algo",
    "text": "Екіөлшемді квадраттық `arr[N][N]` массивінің қосалқы диагоналінде (secondary diagonal) орналасқан элементтердің индекстеріне қандай шарт сәйкес келеді?",
    "options": [
      {
        "id": "b8d5080d-ebae-467b-ba83-a51da0200123",
        "text": "i + j == N - 1"
      },
      {
        "id": "27b7b62e-4472-49c8-8d20-ae64942a26be",
        "text": "i == j"
      },
      {
        "id": "69f24de4-6bf6-4f4c-b610-8bfb6f3370bb",
        "text": "i > j"
      },
      {
        "id": "0383b338-dfaf-4c8c-914f-6ecc09d77699",
        "text": "i - j == 1"
      }
    ],
    "correctOptionIds": [
      "b8d5080d-ebae-467b-ba83-a51da0200123"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "c6ebe989-85d0-40ca-a88e-9b74907d7520",
    "subjectId": "algo",
    "text": "Екіөлшемді квадраттық `arr[N][N]` массивінің бас диагоналінен жоғары орналасқан элементтерге қандай шарт сәйкес келеді?",
    "options": [
      {
        "id": "0629be48-4745-47e1-acb8-6cfeeeb39338",
        "text": "i < j"
      },
      {
        "id": "47d78981-e125-4ec6-9fb4-d80fb1de113a",
        "text": "i > j"
      },
      {
        "id": "78153606-4a14-4879-9440-723585ff8b13",
        "text": "i == j"
      },
      {
        "id": "d6e6ea4f-cd22-46c0-9493-5c87f0cf4a8a",
        "text": "i + j < N"
      }
    ],
    "correctOptionIds": [
      "0629be48-4745-47e1-acb8-6cfeeeb39338"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "06d298b4-2643-452d-8a26-6069e4012e9b",
    "subjectId": "algo",
    "text": "Екіөлшемді квадраттық `arr[N][N]` массивінің бас диагоналінен төмен орналасқан элементтерге қандай шарт сәйкес келеді?",
    "options": [
      {
        "id": "e37f1e2f-33ed-4172-9dd2-afd8851fd559",
        "text": "i > j"
      },
      {
        "id": "d9b5bbc6-eb85-4574-b784-c170b9ee0348",
        "text": "i < j"
      },
      {
        "id": "9871e67c-5911-4561-bef0-9d7faaae0a80",
        "text": "i == j"
      },
      {
        "id": "9cc3feba-26c1-4c49-a270-cbf3f5fb78e4",
        "text": "i + j > N"
      }
    ],
    "correctOptionIds": [
      "e37f1e2f-33ed-4172-9dd2-afd8851fd559"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "ae0720d1-970f-481e-aa5f-32c7f8bfceae",
    "subjectId": "algo",
    "text": "Массив элементтерін кері ретпен орналастыру (reverse/invert array) үшін қандай алгоритм оңтайлы?",
    "options": [
      {
        "id": "6f09ead1-e369-4f26-a03f-e553b416dd75",
        "text": "Массивтің басынан және соңынан бастап элементтерді ортасына жеткенше өзара алмастыру (swap)"
      },
      {
        "id": "194e2814-a508-4700-b988-d520b6fb4168",
        "text": "Массивті жаңа массивке екі рет көшіру"
      },
      {
        "id": "e3eb88dd-5b6a-4691-b4a8-e7d38d7ef52e",
        "text": "Элементтерді сұрыптау функциясын шақыру"
      },
      {
        "id": "a045888e-9fe6-4994-a07f-12b5b1bccd13",
        "text": "Массив элементтерін оңға бір қадамға жылжыту"
      }
    ],
    "correctOptionIds": [
      "6f09ead1-e369-4f26-a03f-e553b416dd75"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "dab1eff0-71a3-4577-8bd3-191d9801aea0",
    "subjectId": "algo",
    "text": "Массивті цикл ішінде оңға қарай циклдік жылжыту (cyclic shift right by 1) деген не?",
    "options": [
      {
        "id": "20874afa-9799-4d98-8cb3-7ed11ea79bd7",
        "text": "Массивтің соңғы элементін уақытша сақтап, қалған элементтерді оңға жылжытып, бірінші орынға соңғы элементті қою"
      },
      {
        "id": "f3f10692-cc6c-44b3-91d6-daf8564376c6",
        "text": "Массив элементтерінің барлығына 1-ді қосу"
      },
      {
        "id": "8441b2c5-7a9f-419f-8ecd-e6adf70f88b1",
        "text": "Массивтің бірінші және соңғы элементтерін өшіру"
      },
      {
        "id": "2cb7fab6-1498-4cce-91ed-b3b021f77642",
        "text": "Массивтің барлық элементтерін сұрыптау"
      }
    ],
    "correctOptionIds": [
      "20874afa-9799-4d98-8cb3-7ed11ea79bd7"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "a914ea0c-fb08-47cb-92de-d3b5abb7dfc8",
    "subjectId": "algo",
    "text": "Массив элементтерінің ең үлкен мәнін (maximum) табу алгоритмі қалай жұмыс істейді?",
    "options": [
      {
        "id": "3805f4bf-20fa-46dc-81ba-316732e36bb5",
        "text": "Бірінші элементті максимум деп алып, қалған элементтермен кезекпен салыстыра отырып, үлкен мән кездессе оны жаңарту"
      },
      {
        "id": "e7b32c41-7ab9-4b36-81d4-92daa159ad57",
        "text": "Барлық элементтерді қосып, элементтер санына бөлу"
      },
      {
        "id": "22f9ff9e-0d41-4488-bf19-56c1b8bcc618",
        "text": "Массивтің тек соңғы элементін тексеру"
      },
      {
        "id": "ff25e281-2d14-457c-9468-116e05978343",
        "text": "Массив элементтерін биттік түрлендіру"
      }
    ],
    "correctOptionIds": [
      "3805f4bf-20fa-46dc-81ba-316732e36bb5"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "b05686b2-85f4-471c-aa43-291487450409",
    "subjectId": "algo",
    "text": "Сызықтық іздеу (linear search) алгоритмінің орташа уақыттық күрделілігі қандай?",
    "options": [
      {
        "id": "a5715e4e-bcf3-4605-9c07-313d7d055926",
        "text": "O(N)"
      },
      {
        "id": "05ccdb72-ad4d-4b78-a4a8-908becd7f28d",
        "text": "O(log N)"
      },
      {
        "id": "4c51995d-3025-48be-bc4e-f6d7683a1ad3",
        "text": "O(N^2)"
      },
      {
        "id": "0d98ce96-4c15-4aed-9b66-76f611026e34",
        "text": "O(1)"
      }
    ],
    "correctOptionIds": [
      "a5715e4e-bcf3-4605-9c07-313d7d055926"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "1b76b306-c7d9-47f1-85c5-924550e70710",
    "subjectId": "algo",
    "text": "Екіөлшемді массив элементтерін жолдар бойынша жадта сақтау тәртібі (Row-major order) деген не?",
    "options": [
      {
        "id": "0d4c1ffd-4ce1-4e61-8cf7-69a81643efdb",
        "text": "Жадта алдымен бірінші жолдың барлық элементтері, сосын екінші жол, т.с.с. тізбектеліп орналасуы"
      },
      {
        "id": "2c3beb40-7da0-4259-bdd6-10f5173fc25b",
        "text": "Жадта алдымен бірінші бағанның барлық элементтері, сосын екінші баған орналасуы"
      },
      {
        "id": "c5070bc9-58f5-48ff-8ad8-2bfb78fff9cb",
        "text": "Элементтердің кездейсоқ ретпен орналасуы"
      },
      {
        "id": "e45fd142-5be9-408d-8655-cb0a4414b16c",
        "text": "Тек квадраттық матрицалар үшін ғана қолданылатын тәртіп"
      }
    ],
    "correctOptionIds": [
      "0d4c1ffd-4ce1-4e61-8cf7-69a81643efdb"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "91ed8862-32e8-4be6-a8d1-7d13a5564e7e",
    "subjectId": "algo",
    "text": "Екіөлшемді массив элементтерін бағандар бойынша жадта сақтау тәртібі (Column-major order) қандай бағдарламалау тілдеріне тән?",
    "options": [
      {
        "id": "9881c915-1947-4222-bbda-aad5082a32b7",
        "text": "Fortran, MATLAB"
      },
      {
        "id": "efeeb00e-a688-414d-86ec-d34b90832851",
        "text": "C, C++"
      },
      {
        "id": "dc9f331f-e208-417f-a558-6e7bbcac7498",
        "text": "Python, Java"
      },
      {
        "id": "04394825-e03d-4c00-9167-9993d6dd3423",
        "text": "Pascal, C#"
      }
    ],
    "correctOptionIds": [
      "9881c915-1947-4222-bbda-aad5082a32b7"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "dd3701ac-8368-414a-953a-5ecdedc0bac6",
    "subjectId": "algo",
    "text": "C++ тіліндегі `std::vector` контейнері мен қарапайым статикалық массивтің негізгі айырмашылығы неде?",
    "options": [
      {
        "id": "8cb97a5f-a6e0-4a40-8cce-4d465a96b549",
        "text": "`std::vector` - өлшемін автоматты түрде өзгерте алатын динамикалық массив"
      },
      {
        "id": "ca4ffe4c-be77-4481-adf0-da28039e4bd2",
        "text": "`std::vector` жадтың стек сегментін ғана қолданады"
      },
      {
        "id": "9c958584-335c-49f5-bec8-ce0bb9a43891",
        "text": "Қарапайым массив тек сандарды, ал вектор тек мәтінді сақтайды"
      },
      {
        "id": "c6fcb48b-d6a0-485b-964a-ff0b83f9d630",
        "text": "Ешқандай айырмашылығы жоқ"
      }
    ],
    "correctOptionIds": [
      "8cb97a5f-a6e0-4a40-8cce-4d465a96b549"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "357bdfbf-c157-4a7f-8e0c-fc184b81c044",
    "subjectId": "algo",
    "text": "Тармақталған алгоритмдердегі `nested if` (кірістірілген шарттар) не үшін қажет?",
    "options": [
      {
        "id": "af80147e-9a97-46ab-ad4a-fa88434693df",
        "text": "Бірнеше шарттардың бір уақытта немесе ретімен орындалуын тереңірек тексеру үшін"
      },
      {
        "id": "79084f51-cdd5-4e9c-b3dd-b4c27f8c1996",
        "text": "Кодты жылдам компиляциялау үшін"
      },
      {
        "id": "7f8d2454-ec89-4a1b-869e-de44c5278f66",
        "text": "Жаһандық айнымалыларды локализациялау үшін"
      },
      {
        "id": "de908cb0-172b-41fc-bb6e-aedc5f750b77",
        "text": "Тек цикл жұмысын жеделдету үшін"
      }
    ],
    "correctOptionIds": [
      "af80147e-9a97-46ab-ad4a-fa88434693df"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "e1bfeea7-4e66-43bb-a001-e876ed7701db",
    "subjectId": "algo",
    "text": "Циклдің шексіз орындалуының (infinite loop) негізгі себебі қандай?",
    "options": [
      {
        "id": "76f29de3-5487-4dce-9616-7d08d6aad571",
        "text": "Циклдың тоқтау шартының ешқашан жалған (false) мәнге ие болмауы"
      },
      {
        "id": "6e155740-fa50-4bc1-b443-f9de96fbf882",
        "text": "Цикл ішінде `break` қолданылуы"
      },
      {
        "id": "6ea55eb1-98c5-42ca-aa7f-d9743c4bb806",
        "text": "Массив өлшемінің тым үлкен болуы"
      },
      {
        "id": "5de6e9c0-7d22-4147-9cf5-dec1c602a73f",
        "text": "Компьютер жадының аз болуы"
      }
    ],
    "correctOptionIds": [
      "76f29de3-5487-4dce-9616-7d08d6aad571"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "8d52fc44-7a06-4e02-b779-36e14b066385",
    "subjectId": "algo",
    "text": "Сызықтық алгоритм құрылымында бағдарламаның орындалу бағытында айрықтар (branching) бола ма?",
    "options": [
      {
        "id": "a9953b5c-75ec-4974-8f96-6f5041171300",
        "text": "Жоқ, ешқандай айрықтар мен таңдаулар болмайды, код басынан соңына қарай бір бағытпен өтеді"
      },
      {
        "id": "949b8b64-3450-4862-a86c-70e262d2a683",
        "text": "Иә, шарт бойынша бөлініп отырады"
      },
      {
        "id": "634b58ae-4f9b-44cf-b31d-b2ba69a76c9c",
        "text": "Тек қателік болғанда ғана бөлінеді"
      },
      {
        "id": "1236bdd4-a2d6-4ce7-b9ca-3e7228c36ec0",
        "text": "Иә, циклдер арқылы кері қайтады"
      }
    ],
    "correctOptionIds": [
      "a9953b5c-75ec-4974-8f96-6f5041171300"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "024c2cdb-0bf4-444d-842d-6e5989e78c35",
    "subjectId": "algo",
    "text": "Төмендегі алгоритмдік құрылымдардың қайсысы циклге жатпайды?",
    "options": [
      {
        "id": "4e4756f1-a2e5-45f3-a0ec-676ed1eda06a",
        "text": "Selection (if-else)"
      },
      {
        "id": "565053f3-cae1-4e76-9acd-4a3b95fe2f07",
        "text": "Iteration (while)"
      },
      {
        "id": "5767c4ce-a959-4970-b63d-e8e0b49c1fdd",
        "text": "For-loop"
      },
      {
        "id": "03a5e79d-9fe7-4147-b918-bf3a17962956",
        "text": "Do-while"
      }
    ],
    "correctOptionIds": [
      "4e4756f1-a2e5-45f3-a0ec-676ed1eda06a"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "3082b71b-0f1a-4278-9421-77a8f6ae3eb5",
    "subjectId": "algo",
    "text": "Екіөлшемді матрицаны транспонирлеу (transpose) дегеніміз не?",
    "options": [
      {
        "id": "a49fb4b9-2b00-4596-94e4-995bab1b542a",
        "text": "Матрицаның жолдары мен бағандарының орындарын өзара алмастыру"
      },
      {
        "id": "8aa478aa-f0de-47de-863b-820a5ac8fb7b",
        "text": "Матрица элементтерін нөлге теңестіру"
      },
      {
        "id": "31c0e5e2-c764-423e-a908-a49a75fd3ff0",
        "text": "Матрицаның тек оң элементтерін табу"
      },
      {
        "id": "4c85e1f1-af31-461f-8de8-70eef17ff3f5",
        "text": "Матрицаны бірінші жолы бойынша сұрыптау"
      }
    ],
    "correctOptionIds": [
      "a49fb4b9-2b00-4596-94e4-995bab1b542a"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "ba01e892-2bd3-45d5-99a6-db1f3e58851c",
    "subjectId": "algo",
    "text": "Төмендегі өрнек орындалғаннан кейін `x` мәні неше болады?\n`int x = 0; for (int i = 0; i < 5; i += 2) { x += i; }`",
    "options": [
      {
        "id": "d1143f90-13b6-461e-9569-065362b7daac",
        "text": "6 (i = 0, 2, 4 мәндері үшін 0 + 2 + 4 = 6)"
      },
      {
        "id": "ef2dfd07-0d7d-446c-9f72-3840ada7f5ed",
        "text": "10"
      },
      {
        "id": "98da6321-802d-4675-8250-3f2ec08f1677",
        "text": "8"
      },
      {
        "id": "8a2a62f3-858e-4b95-b859-217f98d282ae",
        "text": "4"
      }
    ],
    "correctOptionIds": [
      "d1143f90-13b6-461e-9569-065362b7daac"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "e53474f9-6591-4362-a597-4938b0d7df9e",
    "subjectId": "algo",
    "text": "Төмендегі код орындалғаннан кейін `count` мәні нешеге тең болады?\n`int count = 0; for(int i=0; i<3; i++) { for(int j=0; j<2; j++) { count++; } }`",
    "options": [
      {
        "id": "2b3f8073-38c2-4cd5-8dfc-1ab8f39a509b",
        "text": "6"
      },
      {
        "id": "0a903ce1-021a-4acf-a4da-c9407f3ecb7a",
        "text": "5"
      },
      {
        "id": "9b824e6f-32e0-4fed-ab99-e2692ed19fdb",
        "text": "3"
      },
      {
        "id": "50ce11fa-6068-485c-8016-77b4d76a5b03",
        "text": "2"
      }
    ],
    "correctOptionIds": [
      "2b3f8073-38c2-4cd5-8dfc-1ab8f39a509b"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "29296f10-f4d5-4600-88ef-b141e1738458",
    "subjectId": "algo",
    "text": "Қабаттасқан (кірістірілген) циклдердің уақыттық күрделілігі (ішкі және сыртқы цикл өлшемдері N болса) әдетте қандай болады?",
    "options": [
      {
        "id": "502706c7-69d0-4179-9ce1-4ce74d4200f4",
        "text": "O(N^2)"
      },
      {
        "id": "9258bd0f-4c40-4b1d-821d-a67bdf136dbb",
        "text": "O(N)"
      },
      {
        "id": "d0c9eeec-3106-407c-a3f0-42aa3528faee",
        "text": "O(log N)"
      },
      {
        "id": "a097e235-3314-4ef6-be70-d6a9376990f7",
        "text": "O(N log N)"
      }
    ],
    "correctOptionIds": [
      "502706c7-69d0-4179-9ce1-4ce74d4200f4"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "c09fc4b9-c9c9-43d0-b27f-3f35e7e864f3",
    "subjectId": "algo",
    "text": "C++ тілінде массив элементтерін қолмен көшірмей, жылдам көшіру үшін қай стандартты функция қолданылады?",
    "options": [
      {
        "id": "115e2bc4-5eb4-452c-ad2d-887716c8078c",
        "text": "std::copy() немесе memcpy()"
      },
      {
        "id": "8c7db1fa-e83b-4ed1-9bc4-ed8703d7aad7",
        "text": "std::move()"
      },
      {
        "id": "b6dcd90a-c618-4c6e-bcb6-6c73b15e7c2a",
        "text": "std::clone()"
      },
      {
        "id": "03825879-30a7-43fd-803b-8df0797e7619",
        "text": "std::duplicate()"
      }
    ],
    "correctOptionIds": [
      "115e2bc4-5eb4-452c-ad2d-887716c8078c"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "14abac2b-3503-4769-8650-880694854a09",
    "subjectId": "algo",
    "text": "Массив элементтерін өсу ретімен реттеу қалай аталады?",
    "options": [
      {
        "id": "c8655cfa-6407-4f1d-9561-2b0351ed0ed2",
        "text": "Сұрыптау (Sorting)"
      },
      {
        "id": "78dab987-8c91-4df8-bacd-b5f577473162",
        "text": "Іздеу (Searching)"
      },
      {
        "id": "03b16f96-9beb-42d5-9903-674fa46caaa8",
        "text": "Фильтрлеу (Filtering)"
      },
      {
        "id": "460891ef-f531-4cad-af75-1fbedb04fa7b",
        "text": "Сығу (Compression)"
      }
    ],
    "correctOptionIds": [
      "c8655cfa-6407-4f1d-9561-2b0351ed0ed2"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "a66aa7c0-0d5a-4157-8410-888524b2b56e",
    "subjectId": "algo",
    "text": "C++ тіліндегі `std::fill()` функциясы не істейді?",
    "options": [
      {
        "id": "cbe42047-4a01-4d3f-8e4f-01dde364c961",
        "text": "Массивтің берілген аралығын белгілі бір мәнмен толтырады"
      },
      {
        "id": "b005a333-e47c-4226-bdeb-f1c75fe70b66",
        "text": "Массивтен бос орындарды іздейді"
      },
      {
        "id": "fc4f983c-da5f-4806-a912-88c91017fe6c",
        "text": "Массив элементтерін жадтан өшіреді"
      },
      {
        "id": "8a55c64f-49d8-4f8c-bb91-f8d5a6548a67",
        "text": "Массивтің өлшемін автоматты түрде кеңейтеді"
      }
    ],
    "correctOptionIds": [
      "cbe42047-4a01-4d3f-8e4f-01dde364c961"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "9ea04af6-effe-40b2-b848-700866c4b22c",
    "subjectId": "algo",
    "text": "Екіөлшемді массив динамикалық түрде нұсқауыштарға нұсқауыш (`int**`) арқылы қалай құрылады?",
    "options": [
      {
        "id": "51074076-762c-4f75-9979-8b01931c3199",
        "text": "Жолдарға нұсқауыштар массивін құрып, содан кейін әр жолға бөлек динамикалық жад бөлу арқылы"
      },
      {
        "id": "b00ff518-3f40-4391-80b9-2934d1cc494b",
        "text": "Бір ғана `new int[N][M]` операторы арқылы тікелей"
      },
      {
        "id": "332756aa-3b7e-4959-9a2a-7bc4f4d27b6e",
        "text": "Стек сегментінен автоматты түрде бөлінеді"
      },
      {
        "id": "12c29153-aa20-4d15-99ae-9b99eb1ded98",
        "text": "Ол үшін тек статикалық массив қолданылады"
      }
    ],
    "correctOptionIds": [
      "51074076-762c-4f75-9979-8b01931c3199"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "64213d38-628e-4b97-b5bf-f98986e70a7f",
    "subjectId": "algo",
    "text": "`int** arr` арқылы бөлінген динамикалық екіөлшемді массив жадын дұрыс босату реті қандай?",
    "options": [
      {
        "id": "d2392aa7-d55b-4fde-8777-ac640307c983",
        "text": "Алдымен әр жолды (`delete[] arr[i]`) өшіріп, соңында нұсқауыштар массивінің өзін (`delete[] arr`) өшіру"
      },
      {
        "id": "4fbe66b5-7fa7-49dc-8891-ba08d70b4de4",
        "text": "Тек `delete[] arr` деп жазу жеткілікті"
      },
      {
        "id": "e0afb628-f53e-4c4a-bc5b-e7ae98c792bb",
        "text": "Жад автоматты түрде босатылады"
      },
      {
        "id": "dff803d4-154a-452a-8d36-35c899880617",
        "text": "Оларды кері ретпен, яғни алдымен `delete[] arr` өшіру керек"
      }
    ],
    "correctOptionIds": [
      "d2392aa7-d55b-4fde-8777-ac640307c983"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "3327861c-3a1a-48c5-b36c-533978f6f41d",
    "subjectId": "algo",
    "text": "Төмендегі цикл неше рет орындалады?\n`int i = 10; while(i > 0) { i /= 2; }`",
    "options": [
      {
        "id": "f7ffa4e8-69cc-4f41-b08f-6adb6e9ca6a2",
        "text": "4 рет (i мәндері: 5, 2, 1, 0 болады)"
      },
      {
        "id": "e0935699-242c-4f84-ad72-412c9a124340",
        "text": "10 рет"
      },
      {
        "id": "b794e4e9-a002-494e-917b-d736c51afeb1",
        "text": "Шексіз рет"
      },
      {
        "id": "8f6a011b-cd16-47eb-a6f2-9bf998dd60fb",
        "text": "0 рет"
      }
    ],
    "correctOptionIds": [
      "f7ffa4e8-69cc-4f41-b08f-6adb6e9ca6a2"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "20a44139-6267-4f0f-b6ac-934291e27d97",
    "subjectId": "algo",
    "text": "Алгоритмді өрнектеудің көрнекі графикалық түрі қалай аталады?",
    "options": [
      {
        "id": "ec6acb5c-8c56-4391-94e8-5d6ef7197588",
        "text": "Блок-схема (Flowchart)"
      },
      {
        "id": "95d248d2-f039-4384-9bb1-f17bb23a0b4b",
        "text": "Псевдокод"
      },
      {
        "id": "f2298f00-0c9e-41af-a355-832825027d05",
        "text": "Мәтіндік сипаттама"
      },
      {
        "id": "773c9cf7-5bb5-410c-9a2c-1d09dfe2ba43",
        "text": "Бағдарлама коды"
      }
    ],
    "correctOptionIds": [
      "ec6acb5c-8c56-4391-94e8-5d6ef7197588"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "567abdc2-57e5-4be8-9b1f-245647c73473",
    "subjectId": "algo",
    "text": "Блок-схемадағы ромб (diamond) геометриялық фигурасы нені білдіреді?",
    "options": [
      {
        "id": "ce6d5765-0e13-4c43-a978-a9d61e31496d",
        "text": "Шартты тексеруді және тармақталуды (Decision)"
      },
      {
        "id": "07f39ad8-9197-47ef-82b2-4f8017248d1e",
        "text": "Әрекетті немесе есептеуді (Process)"
      },
      {
        "id": "23ee486d-c9fd-4a45-859a-f814d2c01420",
        "text": "Алгоритмнің басы немесе соңын (Terminator)"
      },
      {
        "id": "9903b61f-45fb-4c1a-b1be-a1bf9f59a7d7",
        "text": "Деректерді енгізу/шығаруды (Input/Output)"
      }
    ],
    "correctOptionIds": [
      "ce6d5765-0e13-4c43-a978-a9d61e31496d"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "56b1d457-5be2-4b3d-a3d5-50235be83b59",
    "subjectId": "algo",
    "text": "Блок-схемадағы тік төртбұрыш (rectangle) фигурасы нені білдіреді?",
    "options": [
      {
        "id": "1d77ae84-9268-4872-9be5-00a64468a285",
        "text": "Әрекетті немесе есептеу процесін (Process)"
      },
      {
        "id": "ce752bad-0f47-4795-987d-dca732e0f7e1",
        "text": "Шартты тексеруді"
      },
      {
        "id": "e27cca2e-216d-4c5a-b5e3-63f640134f3c",
        "text": "Деректерді енгізуді"
      },
      {
        "id": "61f64e64-4b68-489b-b0c1-fcf3d56bb893",
        "text": "Алгоритмнің соңын"
      }
    ],
    "correctOptionIds": [
      "1d77ae84-9268-4872-9be5-00a64468a285"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "607ae976-e28f-4ea6-b800-06bc5f71dbad",
    "subjectId": "algo",
    "text": "Блок-схемадағы параллелограмм (parallelogram) фигурасы нені білдіреді?",
    "options": [
      {
        "id": "87073d86-dbd5-41b7-9bbe-eecf41a94f54",
        "text": "Деректерді енгізу немесе шығаруды (Input/Output)"
      },
      {
        "id": "88fdb673-6ab2-4986-8b81-6b17ee85e5e2",
        "text": "Есептеулерді"
      },
      {
        "id": "162d6818-ab20-45bc-95ca-8178efb68b10",
        "text": "Тармақталу шарттарын"
      },
      {
        "id": "e91cb75d-77ea-4c95-ab2b-a6a68c5fa632",
        "text": "Ішкі бағдарламаны шақыруды"
      }
    ],
    "correctOptionIds": [
      "87073d86-dbd5-41b7-9bbe-eecf41a94f54"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "4897e8fe-a699-4349-a002-95fef72c66bd",
    "subjectId": "algo",
    "text": "Блок-схемадағы сопақша (oval / capsule) фигурасы нені білдіреді?",
    "options": [
      {
        "id": "c594e796-aa45-4808-8f00-1da90701bcf6",
        "text": "Алгоритмнің басталуын немесе аяқталуын (Start/End)"
      },
      {
        "id": "309fbba7-3d02-4328-961d-f958f6c6184a",
        "text": "Шартты тексеруді"
      },
      {
        "id": "5080a996-62cb-4061-98fc-a753707e8af6",
        "text": "Есептеу процесін"
      },
      {
        "id": "07db83be-eb7c-4681-91af-c9b495d3c003",
        "text": "Деректерді басып шығаруды"
      }
    ],
    "correctOptionIds": [
      "c594e796-aa45-4808-8f00-1da90701bcf6"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "21f1a484-73a3-4591-9878-f8d116ab7ab8",
    "subjectId": "algo",
    "text": "Бағдарламалау тілінің синтаксистік ережелеріне бағынбайтын, бірақ алгоритм қадамдарын сипаттайтын бейресми тіл қалай аталады?",
    "options": [
      {
        "id": "f49d3d41-e9da-45b9-be96-17ce6d6e956c",
        "text": "Псевдокод (Pseudocode)"
      },
      {
        "id": "35c5c198-6d8d-413f-a338-5cc0eb4eb51b",
        "text": "Машиналық код"
      },
      {
        "id": "1fd4b34f-664b-4eea-a952-b0bcb85fe65b",
        "text": "Ассемблер тілі"
      },
      {
        "id": "3b8a43d2-be68-4de2-828f-1caf2c86655c",
        "text": "Компилятор тілі"
      }
    ],
    "correctOptionIds": [
      "f49d3d41-e9da-45b9-be96-17ce6d6e956c"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "702ecddd-8491-4461-b86e-d4c48b19a319",
    "subjectId": "algo",
    "text": "Төмендегі алгоритмдердің қайсысы сызықтық құрылымға жатады?",
    "options": [
      {
        "id": "27d863e7-c7e1-4eac-848c-042b069017b3",
        "text": "Екі санның қосындысын табу және нәтижесін шығару"
      },
      {
        "id": "1b4a5b86-0edf-4446-9edb-18cde6ef45eb",
        "text": "Екі санның үлкенін табу"
      },
      {
        "id": "b12df728-7542-4ae8-82ea-e4e2eca017ef",
        "text": "1-ден N-ге дейінгі сандардың қосындысын табу"
      },
      {
        "id": "b6302651-ce44-4355-ba06-5fab18207f2b",
        "text": "Квадрат теңдеуді шешу"
      }
    ],
    "correctOptionIds": [
      "27d863e7-c7e1-4eac-848c-042b069017b3"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "fc7b814a-6e12-4b05-804e-90878c965c0c",
    "subjectId": "algo",
    "text": "Тармақталудың қандай негізгі екі түрі бар?",
    "options": [
      {
        "id": "e1d9f15e-093a-40d7-a571-2db052634ad4",
        "text": "Толық (if-else) және toлық емес (тек if)"
      },
      {
        "id": "e328a41b-4ff6-4d95-91bb-d1c42487fa03",
        "text": "Сызықтық және циклдік"
      },
      {
        "id": "51d83880-213b-4b66-9d53-ae0826532946",
        "text": "Рекурсивті және итеративті"
      },
      {
        "id": "90a57a12-4c01-485c-9287-0b6f261c540c",
        "text": "Қарапайым және күрделі"
      }
    ],
    "correctOptionIds": [
      "e1d9f15e-093a-40d7-a571-2db052634ad4"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "23a1fff0-6552-46ee-a041-18267fe67948",
    "subjectId": "algo",
    "text": "C++ тіліндегі `std::vector` жиымында соңғы элементті қосу және өшіру операцияларының уақыттық күрделілігі қандай?",
    "options": [
      {
        "id": "9e01d43a-3853-4a76-9069-55e8bb93664a",
        "text": "Амортизацияланған O(1)"
      },
      {
        "id": "adadcf72-4ce4-410c-957e-218d6cd8509c",
        "text": "O(N)"
      },
      {
        "id": "a09c7486-c706-4945-86ae-4a305fced05d",
        "text": "O(log N)"
      },
      {
        "id": "6f37c1a3-eff2-497f-8411-fa156ffff3e4",
        "text": "O(N^2)"
      }
    ],
    "correctOptionIds": [
      "9e01d43a-3853-4a76-9069-55e8bb93664a"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "840eacaf-be2c-4134-8080-618c79bfd84b",
    "subjectId": "algo",
    "text": "Массивтің белгілі бір индексіндегі элементке қол жеткізудің (access) уақыттық күрделілігі қандай?",
    "options": [
      {
        "id": "78190e56-cfa2-4647-8511-3a6362b61aa0",
        "text": "O(1) (тұрақты уақыт)"
      },
      {
        "id": "a5208d24-4ea1-4e73-b15c-a193552669d1",
        "text": "O(N)"
      },
      {
        "id": "3fbb512e-2469-4430-8825-0dd2544cf2a5",
        "text": "O(log N)"
      },
      {
        "id": "a4c98935-9e30-4c43-8e23-37153826e1ca",
        "text": "O(N^2)"
      }
    ],
    "correctOptionIds": [
      "78190e56-cfa2-4647-8511-3a6362b61aa0"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "c8cdbdee-4fba-4dcf-a8c3-0331f925aca7",
    "subjectId": "algo",
    "text": "Массивтен белгілі бір мәнді іздегенде ең нашар жағдайда (worst-case) неше салыстыру орындалады?",
    "options": [
      {
        "id": "4224a864-4116-4847-8d5c-b909f8cdbe22",
        "text": "N (элементтер санына тең)"
      },
      {
        "id": "94095f8d-ff05-415c-9d6f-0a83b372e93f",
        "text": "log N"
      },
      {
        "id": "ce4b9c7c-98a9-4de8-9525-001a6c97379d",
        "text": "1"
      },
      {
        "id": "a8990c83-c26a-4d72-bf1e-354b8a638a07",
        "text": "N^2"
      }
    ],
    "correctOptionIds": [
      "4224a864-4116-4847-8d5c-b909f8cdbe22"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "b12e0f09-c86d-451a-8b8a-2f004737e976",
    "subjectId": "algo",
    "text": "Массив элементтерінің арифметикалық орташа мәнін табу үшін алдымен нені есептеу керек?",
    "options": [
      {
        "id": "6332e42c-2d34-4246-b9cc-c2f619ba45d4",
        "text": "Барлық элементтердің қосындысын"
      },
      {
        "id": "165b7de1-e856-4356-91fe-d5766f520232",
        "text": "Массивтің ең үлкен элементін"
      },
      {
        "id": "c3e7a12f-2bce-4a11-975d-56483ebd8137",
        "text": "Массив элементтерінің көбейтіндісін"
      },
      {
        "id": "9da836e1-3aa0-4aaf-956e-e82cda567ceb",
        "text": "Массивтің бірінші элементін"
      }
    ],
    "correctOptionIds": [
      "6332e42c-2d34-4246-b9cc-c2f619ba45d4"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "5fd9cb54-888d-47c8-bb39-f0565f84e482",
    "subjectId": "algo",
    "text": "Сызықтық іздеу алгоритмі үшін массив элементтерінің реттелген (сұрыпталған) болуы міндетті ме?",
    "options": [
      {
        "id": "aae0e187-dec8-46ab-a153-bab4e96247e5",
        "text": "Жоқ, сұрыпталмаған кез келген массивте жұмыс істей береді"
      },
      {
        "id": "e87ac79b-3836-44bd-9211-a404cb77149b",
        "text": "Иә, міндетті түрде өсу ретімен сұрыпталуы керек"
      },
      {
        "id": "9061ac06-dbdc-492e-a98b-5f6064b7120e",
        "text": "Иә, кему ретімен сұрыпталуы керек"
      },
      {
        "id": "b1acf13f-8464-4e11-ad40-874d05379f38",
        "text": "Тек оң сандар бойынша реттелуі тиіс"
      }
    ],
    "correctOptionIds": [
      "aae0e187-dec8-46ab-a153-bab4e96247e5"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "7dc44247-5e96-41fd-be8c-6ba5a511656f",
    "subjectId": "algo",
    "text": "Төмендегі кодтың нәтижесі қандай болады?\n`int a[3] = {1, 2, 3}; int *p = a; cout << *(p + 1);`",
    "options": [
      {
        "id": "3efd615a-5174-4440-9b11-3444d2f581ef",
        "text": "2"
      },
      {
        "id": "56b06ab8-4854-4430-9739-8ee433bc876b",
        "text": "1"
      },
      {
        "id": "56dae9e0-23f8-49f8-8703-9e0de6393eda",
        "text": "3"
      },
      {
        "id": "933d0066-19d6-4d74-b683-472ec5698e5a",
        "text": "Қате"
      }
    ],
    "correctOptionIds": [
      "3efd615a-5174-4440-9b11-3444d2f581ef"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "65c66fb3-c478-45ba-957b-086e9737c1ab",
    "subjectId": "algo",
    "text": "C++ тілінде массивті функцияға параметр ретінде бергенде не өтеді?",
    "options": [
      {
        "id": "be7b660a-8ab6-414f-ae39-7f93ea6c131f",
        "text": "Массивтің бірінші элементіне сілтейтін нұсқауыш (pointer) өтеді"
      },
      {
        "id": "b75a434c-96fd-4e8c-800b-59ac937f47b3",
        "text": "Массивтің толық көшірмесі жасалып өтеді"
      },
      {
        "id": "19974666-cbc7-4057-933b-f273af065eb1",
        "text": "Тек массивтің өлшемі өтеді"
      },
      {
        "id": "97fb2a26-f5ec-4083-ac72-c3af812879c5",
        "text": "Массив автоматты түрде динамикалық болады"
      }
    ],
    "correctOptionIds": [
      "be7b660a-8ab6-414f-ae39-7f93ea6c131f"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "5da04b27-28f1-4be5-ad97-4241f597cda7",
    "subjectId": "algo",
    "text": "Сұрыпталмаған массивтен ең кіші екінші элементті (second minimum) табу алгоритмінің тиімді уақыт күрделілігі қандай?",
    "options": [
      {
        "id": "5790b06d-61ea-4d18-91b8-6645a35f1129",
        "text": "O(N) (бір немесе екі өту арқылы ең кіші екі айнымалыны сақтау)"
      },
      {
        "id": "416f3823-e3b1-4e22-859a-b753af5ea948",
        "text": "O(N log N)"
      },
      {
        "id": "67d41807-913b-4a2f-83df-ed32f9d231ce",
        "text": "O(N^2)"
      },
      {
        "id": "265e766b-8bd9-4ad5-94e8-65ecd565e696",
        "text": "O(1)"
      }
    ],
    "correctOptionIds": [
      "5790b06d-61ea-4d18-91b8-6645a35f1129"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "9afb07e0-283e-4a61-9600-794ec9dc3594",
    "subjectId": "algo",
    "text": "Массив элементтерін оңға бір орынға циклдік жылжытқанда, соңғы элемент қай орынға барады?",
    "options": [
      {
        "id": "64125a19-04dc-454e-b479-6d627d2c7712",
        "text": "Бірінші орынға (индексі 0)"
      },
      {
        "id": "67ceea09-98d3-4675-afda-f328e2c90436",
        "text": "Екінші орынға"
      },
      {
        "id": "f39af15a-8fa0-4cd9-97fe-98ac35fb2b27",
        "text": "Массивтен шығып кетеді (жойылады)"
      },
      {
        "id": "4b59e0b9-8b1e-4212-9536-f4f9a5a1f441",
        "text": "Орнында қалады"
      }
    ],
    "correctOptionIds": [
      "64125a19-04dc-454e-b479-6d627d2c7712"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "b7f04382-7a07-4af3-8bc2-7265252d6061",
    "subjectId": "algo",
    "text": "Массив элементтерін солға бір орынға циклдік жылжытқанда (shift left by 1), бірінші элемент қай орынға барады?",
    "options": [
      {
        "id": "96cd264d-110a-4bd1-a43a-283401806350",
        "text": "Соңғы орынға (индексі N-1)"
      },
      {
        "id": "04c1224d-2bd4-41b2-a6c1-59cb3a986369",
        "text": "Екінші орынға"
      },
      {
        "id": "e82d33f7-2ea7-48b2-a0e0-3488ff6ef125",
        "text": "Өшіріледі"
      },
      {
        "id": "60b8ef87-98ff-4ce7-a730-c5ba59eb864d",
        "text": "Бірінші орында қалады"
      }
    ],
    "correctOptionIds": [
      "96cd264d-110a-4bd1-a43a-283401806350"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "1987d71f-8fee-49bd-a3ac-ecb2a1c5410d",
    "subjectId": "algo",
    "text": "Үш өлшемді `int arr[2][3][4];` массиві жадта барлығы неше байт орын алады (егер sizeof(int) = 4 байт болса)?",
    "options": [
      {
        "id": "dc89f614-7104-41a5-87e7-03f9bea3217f",
        "text": "96 байт (2 * 3 * 4 * 4 = 96)"
      },
      {
        "id": "1df4ceaf-4f03-4ea5-a832-630d8655a16d",
        "text": "24 байт"
      },
      {
        "id": "fe05850e-8920-495b-806e-34c49b184be7",
        "text": "48 байт"
      },
      {
        "id": "6af5f7b3-be06-47b1-9041-793f7878fe9e",
        "text": "192 байт"
      }
    ],
    "correctOptionIds": [
      "dc89f614-7104-41a5-87e7-03f9bea3217f"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "eb3a041b-257e-4799-b1d6-d0b261de2da1",
    "subjectId": "algo",
    "text": "Массивтің барлық элементтерінің көбейтіндісін табу алгоритмінде жинақтауыш айнымалының (product) бастапқы мәні неше болуы тиіс?",
    "options": [
      {
        "id": "f673bed8-fce8-4bde-bacf-c1cd1b405917",
        "text": "1"
      },
      {
        "id": "6ffefe91-0ded-4bac-bd8c-6d2cab789ae3",
        "text": "0"
      },
      {
        "id": "9ba23be5-6ae0-411c-896b-1791f6388d17",
        "text": "-1"
      },
      {
        "id": "c787b46d-bbdc-4df6-830d-da667ffa60e3",
        "text": "Массивтің бірінші элементі"
      }
    ],
    "correctOptionIds": [
      "f673bed8-fce8-4bde-bacf-c1cd1b405917"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "954db3af-2f30-4515-a4a9-b93b2b43cb0d",
    "subjectId": "algo",
    "text": "Массивтің барлық элементтерінің қосындысын табу алгоритмінде жинақтауыш айнымалының (sum) бастапқы мәні неше болуы тиіс?",
    "options": [
      {
        "id": "c25939c0-2a67-4c67-963e-91071acbf155",
        "text": "0"
      },
      {
        "id": "70b9e02b-09cb-44bb-98f1-dc5fa41a9368",
        "text": "1"
      },
      {
        "id": "c8439a63-3bcd-4180-920d-4dc6a3ee589c",
        "text": "Массивтің бірінші элементі"
      },
      {
        "id": "9f711a8a-7eed-4980-a07e-1a44cd34d80f",
        "text": "Kездейсоқ мән"
      }
    ],
    "correctOptionIds": [
      "c25939c0-2a67-4c67-963e-91071acbf155"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "24c9dbe6-0084-4ace-b6dd-072a512655fb",
    "subjectId": "algo",
    "text": "Төмендегі код орындалғаннан кейін `x` мәні қандай болады?\n`int x = 10; for (int i = 0; i < 5; i++) { if (i == 3) break; x++; }`",
    "options": [
      {
        "id": "4b24c3b9-4140-4728-8c4e-9067fd97b237",
        "text": "13 (i = 0, 1, 2 үшін орындалып өседі, i = 3-те цикл тоқтайды)"
      },
      {
        "id": "4e3d92e6-7c58-410f-a0c5-acaf62ca0ef4",
        "text": "15"
      },
      {
        "id": "b9845910-7e73-4213-8d0a-2ed2bfbea6d1",
        "text": "14"
      },
      {
        "id": "e2198823-0608-4f01-a314-f6ca8ae9a887",
        "text": "10"
      }
    ],
    "correctOptionIds": [
      "4b24c3b9-4140-4728-8c4e-9067fd97b237"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "f2c644e6-6c64-471b-b432-d45d2dcfb21d",
    "subjectId": "algo",
    "text": "Төмендегі код орындалғаннан кейін `x` мәні қандай болады?\n`int x = 10; for (int i = 0; i < 5; i++) { if (i == 3) continue; x++; }`",
    "options": [
      {
        "id": "6eee364b-8651-420a-910b-d39d0cdb8e5c",
        "text": "14 (i = 3-тен басқа барлық қадамда өседі, яғни 4 рет)"
      },
      {
        "id": "58a63056-d0e6-45d6-b937-a10112f0b4f8",
        "text": "15"
      },
      {
        "id": "7ea80c02-2e52-42b3-8788-b30c72e3c640",
        "text": "13"
      },
      {
        "id": "5772dca4-9bff-4572-8926-d52cf586f1f0",
        "text": "10"
      }
    ],
    "correctOptionIds": [
      "6eee364b-8651-420a-910b-d39d0cdb8e5c"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "6c1c2adc-bf2f-4382-9ff1-5c30523f13ba",
    "subjectId": "algo",
    "text": "Екіөлшемді `arr[i][j]` квадраттық матрицасында `i + j > N - 1` шарты қандай элементтерге тән (N - матрица өлшемі)?",
    "options": [
      {
        "id": "996dc715-a20b-42b9-ad43-fa6d328c98d7",
        "text": "Қосалқы диагональдан төмен орналасқан элементтерге"
      },
      {
        "id": "a960521b-afeb-4a4a-aea5-cfad6921e9e0",
        "text": "Қосалқы диагональдан жоғары орналасқан элементтерге"
      },
      {
        "id": "ee9b1e08-c60f-43ca-bc17-c5f2e6921065",
        "text": "Бас диагональдан жоғары элементтерге"
      },
      {
        "id": "81a97b06-e203-4203-ad62-ce8f79fffe53",
        "text": "Тек қосалқы диагональ бойындағы элементтерге"
      }
    ],
    "correctOptionIds": [
      "996dc715-a20b-42b9-ad43-fa6d328c98d7"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "e5373307-f477-4cb5-8cee-60a0cd07174a",
    "subjectId": "algo",
    "text": "Екіөлшемді `arr[i][j]` квадраттық матрицасында `i + j < N - 1` шарты қандай элементтерге тән (N - матрица өлшемі)?",
    "options": [
      {
        "id": "1b1e3a99-b320-4900-a5f3-db15212f99f9",
        "text": "Қосалқы диагональдан жоғары орналасқан элементтерге"
      },
      {
        "id": "add32f95-bd99-4e7d-af87-7406a75ce1d4",
        "text": "Қосалқы диагональдан төмен орналасқан элементтерге"
      },
      {
        "id": "c664e4f6-1757-4d88-a54c-a189cfb27a6c",
        "text": "Бас диагональ бойындағы элементтерге"
      },
      {
        "id": "2a7f1183-50ff-4b2c-8ae7-fbde1a2e6167",
        "text": "Тек бұрыштағы элементтерге"
      }
    ],
    "correctOptionIds": [
      "1b1e3a99-b320-4900-a5f3-db15212f99f9"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "efc66c8f-4471-4f3b-ac10-d8fd1be33ac1",
    "subjectId": "algo",
    "text": "Массивтің элементтеріне көрсеткіштер (нұсқауыштар) арқылы қол жеткізу тәсілі қалай аталады?",
    "options": [
      {
        "id": "ebdd58f9-1f4c-4aad-8794-0b8952944594",
        "text": "Нұсқауыштар арифметикасы (Pointer arithmetic)"
      },
      {
        "id": "a0511e02-164e-427c-a527-e5b8faf02aae",
        "text": "Индекстеу арифметикасы"
      },
      {
        "id": "adcc6018-ae03-4cdd-bca9-4d65c1f7603a",
        "text": "Динамикалық сұраныс"
      },
      {
        "id": "92abd8ad-78b9-4064-ad26-54ec658a85e2",
        "text": "Жадты реттеу"
      }
    ],
    "correctOptionIds": [
      "ebdd58f9-1f4c-4aad-8794-0b8952944594"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "58320cfe-bcf0-4998-bb21-74c5327bf41f",
    "subjectId": "algo",
    "text": "Төмендегі код нәтижесі нешеге тең?\n`int a[] = {10, 20, 30}; cout << *a + 5;`",
    "options": [
      {
        "id": "4939be55-72fe-4f8e-b73e-d4fe2db1d927",
        "text": "15 (*a бірінші элементті сілтейді, яғни 10, оған 5 қосылады)"
      },
      {
        "id": "648c9da6-30ec-4687-ae45-cacb781bd28d",
        "text": "35"
      },
      {
        "id": "222ce4cc-0944-4290-b847-6d6f4e286ac1",
        "text": "10"
      },
      {
        "id": "be86c889-670a-4eea-93c4-812b1b715158",
        "text": "Қате"
      }
    ],
    "correctOptionIds": [
      "4939be55-72fe-4f8e-b73e-d4fe2db1d927"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "b2972f41-d08e-4352-984a-dcfe09e81e07",
    "subjectId": "algo",
    "text": "Төмендегі код нәтижесі нешеге тең?\n`int a[] = {10, 20, 30}; int *p = a; cout << *(p + 2);`",
    "options": [
      {
        "id": "990ea28c-c38b-4f9a-9746-71db734315ad",
        "text": "30 (үшінші элементтің мәні)"
      },
      {
        "id": "c63407e2-070d-40db-888e-7527fc0fa833",
        "text": "10"
      },
      {
        "id": "198f4e21-d1f3-4159-9e06-c36de5df547d",
        "text": "20"
      },
      {
        "id": "b9f728e0-5d14-4a17-b922-5c538ebd79b6",
        "text": "Қате"
      }
    ],
    "correctOptionIds": [
      "990ea28c-c38b-4f9a-9746-71db734315ad"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "f7e45b54-5b53-46ce-8e38-17ad99646f66",
    "subjectId": "algo",
    "text": "C++ тіліндегі `std::array` (C++11) қарапайым массивке қарағанда қандай артықшылық береді?",
    "options": [
      {
        "id": "cb608619-c820-4c52-a516-0a2c77fa135e",
        "text": "Ол массив өлшемін қадағалайды, элементтерге қауіпсіз қол жеткізуді (`at()`) және STL алгоритмдерін қолдауды қамтамасыз етеді"
      },
      {
        "id": "dbee57ae-b61d-4fb1-bced-e914ba13221d",
        "text": "Оның өлшемін орындалу уақытында автоматты түрде кеңейтуге болады"
      },
      {
        "id": "e80cd4b9-e507-4d3e-89c5-62314d2f85c4",
        "text": "Ол жадты мүлдем алмайды"
      },
      {
        "id": "96c23696-1b45-47bb-98ad-b44eb31b073f",
        "text": "Оған кез келген типті араластырып жазуға болады"
      }
    ],
    "correctOptionIds": [
      "cb608619-c820-4c52-a516-0a2c77fa135e"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "799caf19-f949-4f32-82ba-45e1646050d5",
    "subjectId": "algo",
    "text": "Бір типті элементтерді басы мен соңынан кезекпен өңдеуге мүмкіндік беретін циклдік алгоритмдер қалай аталады?",
    "options": [
      {
        "id": "35f03b4e-85f3-49b8-90eb-23cd05b6fbbf",
        "text": "Екі нұсқауыш әдісімен жұмыс істейтін алгоритмдер (Two pointers approach)"
      },
      {
        "id": "4e98472c-c2d0-492e-9921-71063f6be057",
        "text": "Сызықтық алгоритмдер"
      },
      {
        "id": "5196d41a-039f-491e-bfdb-675436c93cef",
        "text": "Тармақталған жүйелер"
      },
      {
        "id": "17e20928-9bb7-417a-9bdf-2cb619396034",
        "text": "Биттік өңдеулер"
      }
    ],
    "correctOptionIds": [
      "35f03b4e-85f3-49b8-90eb-23cd05b6fbbf"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "3853bf6c-2f2a-4583-abe6-29811fb80ea3",
    "subjectId": "algo",
    "text": "C++ тілінде массивті `const` модификаторымен жариялау (`const int arr[5] = {1, 2, 3};`) нені білдіреді?",
    "options": [
      {
        "id": "9f1a38e5-e72a-4164-9e1c-8cc41cd9ed07",
        "text": "Массивтің кез келген элементін бағдарлама барысында өзгертуге тыйым салынады (тек оқуға болады)"
      },
      {
        "id": "f783b29e-0164-4915-885d-13b4380fbd12",
        "text": "Массив тек стекте сақталады"
      },
      {
        "id": "dd70eb17-2072-46a8-a9f9-f6b1072c6027",
        "text": "Массивтің элементтерін тек нөлге теңестіруге болады"
      },
      {
        "id": "6d20c3e5-2459-4035-9de5-61a8765a7e8f",
        "text": "Массив автоматты түрде өшіріледі"
      }
    ],
    "correctOptionIds": [
      "9f1a38e5-e72a-4164-9e1c-8cc41cd9ed07"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "3ab0eaae-cf78-4e44-9de7-098613ad4d1f",
    "subjectId": "algo",
    "text": "Төмендегі код орындалғаннан кейін `x` мәні қандай болады?\n`int x = 0; for (int i = 0; i < 3; i++) { for (int j = 0; j < 3; j++) { if (j == 1) break; x++; } }`",
    "options": [
      {
        "id": "9b9c38a6-8264-4550-8c14-356cbdde1baf",
        "text": "3 (әрбір ішкі цикл j = 1 болғанда тоқтайды, яғни тек j = 0 болғанда ғана x артады, 3 * 1 = 3)"
      },
      {
        "id": "67843562-2f67-4542-8f53-a12b6702891c",
        "text": "9"
      },
      {
        "id": "963b2093-9231-4eab-85c9-f1a00c858607",
        "text": "6"
      },
      {
        "id": "6e8874c8-98bb-4e02-82fb-0193faddedc5",
        "text": "0"
      }
    ],
    "correctOptionIds": [
      "9b9c38a6-8264-4550-8c14-356cbdde1baf"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "8632afd2-cafa-4bd9-959f-e65935967e6a",
    "subjectId": "algo",
    "text": "Қайталау саны алдын ала белгісіз, бірақ белгілі бір логикалық шарт сақталғанша орындалатын циклдер қалай аталады?",
    "options": [
      {
        "id": "bca163ba-65f1-4100-9b5a-41b5aefd1a79",
        "text": "Итерациялық (iterative) немесе шартты циклдер (while/do-while)"
      },
      {
        "id": "a5f72f66-8781-4066-8e97-07972b400ec5",
        "text": "Параметрлі циклдер (for)"
      },
      {
        "id": "a44a0390-f4f0-4abb-a165-87b7c6922da8",
        "text": "Сызықтық циклдер"
      },
      {
        "id": "d7483f31-b37a-4d0f-b2eb-6133a9b1385e",
        "text": "Тұрақты циклдер"
      }
    ],
    "correctOptionIds": [
      "bca163ba-65f1-4100-9b5a-41b5aefd1a79"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "9eae6d04-2761-45ed-99d1-88e78ae9bab8",
    "subjectId": "algo",
    "text": "C++ тілінде массив элементтерін жылдам өсу ретімен сұрыптау үшін қай стандартты функция қолданылады?",
    "options": [
      {
        "id": "d8d057db-f926-4a29-b6e3-9e733a27d75a",
        "text": "std::sort(arr, arr + size)"
      },
      {
        "id": "1c070610-06ff-488f-8e81-561f324b4774",
        "text": "std::arrange(arr)"
      },
      {
        "id": "9568b9cd-5170-4f99-82d7-ef4d25e08b86",
        "text": "std::filter(arr)"
      },
      {
        "id": "f4c0890d-a1b2-4fba-8a6b-f9d5c4f0b3b8",
        "text": "std::order(arr)"
      }
    ],
    "correctOptionIds": [
      "d8d057db-f926-4a29-b6e3-9e733a27d75a"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "ce54ff35-8d82-403e-aaa3-5e450c9d3638",
    "subjectId": "algo",
    "text": "`std::sort` функциясы қай тақырыптық файлда (library) орналасқан?",
    "options": [
      {
        "id": "47e634ae-339b-4aed-8b70-7ee28b4fffd7",
        "text": "<algorithm>"
      },
      {
        "id": "a631b249-76bf-4f68-a237-a4e59f0804de",
        "text": "<iostream>"
      },
      {
        "id": "06dfbeed-3265-4f13-9ac7-6a2ab8b94e12",
        "text": "<cmath>"
      },
      {
        "id": "85eb6af8-d140-42f0-9e4c-f95c6486f846",
        "text": "<vector>"
      }
    ],
    "correctOptionIds": [
      "47e634ae-339b-4aed-8b70-7ee28b4fffd7"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "b0bdddd3-1782-4584-9632-cee79cb6d5de",
    "subjectId": "algo",
    "text": "C++ тілінде массивтегі белгілі бір элементтің бар-жоғын тексеруге арналған екілік іздеу (binary search) қай жағдайда жұмыс істейді?",
    "options": [
      {
        "id": "fa910f89-7682-44d7-9765-f2e2180cc4e6",
        "text": "Тек массив элементтері алдын ала сұрыпталған (ordered) болса ғана"
      },
      {
        "id": "655c504e-01e2-471e-b259-0aefda0fd878",
        "text": "Массив элементтері сұрыпталмаған болса да жұмыс істейді"
      },
      {
        "id": "3d3d7c12-be10-48c4-b0af-6eb5711c39e0",
        "text": "Тек массив өлшемі 10-нан кіші болса"
      },
      {
        "id": "daca1ccd-7e07-46f1-bc32-c1ff5a48ce42",
        "text": "Тек екіөлшемді массивтер үшін жұмыс істейді"
      }
    ],
    "correctOptionIds": [
      "fa910f89-7682-44d7-9765-f2e2180cc4e6"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "f387a607-5ee2-4fd2-bf8b-38cd530d5a02",
    "subjectId": "algo",
    "text": "Екілік іздеу (binary search) алгоритмінің уақыттық күрделілігі қандай?",
    "options": [
      {
        "id": "57a6ec33-de0a-409c-854c-c5c41a01e168",
        "text": "O(log N)"
      },
      {
        "id": "4e5f7d7e-076d-4484-81a2-31a2d19bf2bc",
        "text": "O(N)"
      },
      {
        "id": "772c9382-ea90-4c13-b52b-05be8ebdad2b",
        "text": "O(N^2)"
      },
      {
        "id": "915eb674-1a35-4033-9250-d5ee4dbf6530",
        "text": "O(1)"
      }
    ],
    "correctOptionIds": [
      "57a6ec33-de0a-409c-854c-c5c41a01e168"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "d1e975e2-18c5-498a-8d57-adf1d2c84c7a",
    "subjectId": "algo",
    "text": "C++ тілінде екілік іздеуді жүзеге асыратын стандартты функция қалай аталады?",
    "options": [
      {
        "id": "bdbcba3b-5222-4fb9-b6e3-b8cb2321d5a3",
        "text": "std::binary_search()"
      },
      {
        "id": "5382d125-7d9b-4f80-a80b-db0b4037f850",
        "text": "std::bin_find()"
      },
      {
        "id": "21782169-38dc-4bd6-a4fe-d83b36fbbac3",
        "text": "std::search_binary()"
      },
      {
        "id": "f6069356-a42b-4f44-8ff8-eaf4714e42d2",
        "text": "std::quick_search()"
      }
    ],
    "correctOptionIds": [
      "bdbcba3b-5222-4fb9-b6e3-b8cb2321d5a3"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "e88bbd80-339b-40ba-993d-84eedf91f545",
    "subjectId": "algo",
    "text": "Сызықтық алгоритмді орындау барысында бағдарлама ағыны кері бағытқа немесе жоғары жолдарға қайта оралуы мүмкін бе?",
    "options": [
      {
        "id": "f075b651-e8b5-4277-9c8e-a615177b75b1",
        "text": "Жоқ, сызықтық алгоритмде орындалу бағыты тек қана алға қарай сызықты өтеді"
      },
      {
        "id": "7b7ac98b-1199-4336-bc31-8a080d7b59b8",
        "text": "Иә, мүмкін"
      },
      {
        "id": "0e13119a-af3c-47fe-a7a2-10bd959ec7d3",
        "text": "Тек функция шақырылғанда ғана болады"
      },
      {
        "id": "e3e04ad8-e7b6-413a-bf01-7cd704d05efd",
        "text": "Қателіктерді өңдеуде ғана қайтады"
      }
    ],
    "correctOptionIds": [
      "f075b651-e8b5-4277-9c8e-a615177b75b1"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "bc5a7c4a-c689-40ca-a900-5f96b9fd967f",
    "subjectId": "algo",
    "text": "Екіөлшемді квадраттық матрицаның бас диагональ бойындағы элементтерінің қосындысы қалай аталады?",
    "options": [
      {
        "id": "dd97c66c-7ee7-4994-8287-3170a9f8155f",
        "text": "Матрицаның ізі (Trace of matrix)"
      },
      {
        "id": "8764ed2f-22e1-4acb-9a83-bab9cdb75e13",
        "text": "Матрицаның анықтауышы (Determinant)"
      },
      {
        "id": "15bad127-895a-4507-9989-fcb8ca793205",
        "text": "Матрицаның нормасы"
      },
      {
        "id": "2b4a30ed-faa8-459e-831c-c2ae88b5690d",
        "text": "Матрицаның рангі"
      }
    ],
    "correctOptionIds": [
      "dd97c66c-7ee7-4994-8287-3170a9f8155f"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "300969a4-89c2-4482-a41a-8d538342977f",
    "subjectId": "algo",
    "text": "`switch` құрылымындағы `break` пен цикл ішіндегі `break`-тің басты айырмашылығы неде?",
    "options": [
      {
        "id": "0d4227b1-e7da-480b-8a0c-dcd91ace7d02",
        "text": "`switch`-тегі `break` тек switch-тен шығарады, ал цикл ішіндегі `break` бүкіл циклді тоқтатады"
      },
      {
        "id": "5c1ca46e-75cc-4866-969b-88b3dbcf4b34",
        "text": "Олардың арасында ешқандай айырмашылық жоқ"
      },
      {
        "id": "0d63e6b1-7a27-424f-8661-9f5c85a81134",
        "text": "Switch ішіндегі `break` бағдарламаны толық өшіреді"
      },
      {
        "id": "e2ab76b0-e9e5-41cf-a360-08766ab71b98",
        "text": "Цикл ішіндегі `break` тек келесі қадамды өткізіп жібереді"
      }
    ],
    "correctOptionIds": [
      "0d4227b1-e7da-480b-8a0c-dcd91ace7d02"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "10ad90ab-39c0-4183-bb76-16b67ecb7183",
    "subjectId": "algo",
    "text": "C++ тілінде цикл шарты міндетті түрде тек `bool` типін қайтаруы керек пе?",
    "options": [
      {
        "id": "f6042db8-aed5-477a-acd8-034427d79e55",
        "text": "Жоқ, логикалық мәнге түрлендірілетін кез келген скалярлық типті (мысалы, нөлге тең емес сан true, ал нөл false) қайтара алады"
      },
      {
        "id": "73c987a8-d345-4f64-9b6c-5956d1c3bc5e",
        "text": "Иә, тек қана `bool` типін қайтаруы тиіс"
      },
      {
        "id": "631416b0-85c1-4186-9565-e486a1cffa99",
        "text": "Тек бүтін оң сандарды қайтаруы керек"
      },
      {
        "id": "1f8d1c61-f49d-4f64-8c08-3cade0153bb6",
        "text": "Тек нұсқауыштарды қайтаруы тиіс"
      }
    ],
    "correctOptionIds": [
      "f6042db8-aed5-477a-acd8-034427d79e55"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "6d6f7c53-4f49-4824-a98f-cb730702586a",
    "subjectId": "algo",
    "text": "Массивті жаһандық (global) немесе локальді (local) етіп жариялаудың оның мүмкін болатын максималды өлшеміне әсері қандай?",
    "options": [
      {
        "id": "6c884c38-3c8b-41de-830d-b9e1d2b3fa1c",
        "text": "Жаһандық массив статикалық жадта орналасқандықтан әлдеқайда үлкен болуы мүмкін, ал локальді массив шектеулі Стек (Stack) өлшемімен шектеледі"
      },
      {
        "id": "06e1a617-ded5-4554-a0b8-b99b39675e7f",
        "text": "Локальді массив әлдеқайда үлкен болуы мүмкін"
      },
      {
        "id": "33f27d11-a526-4618-8437-b5e61922f9f4",
        "text": "Жаһандық немесе локальді болуы оның өлшеміне мүлдем әсер етпейді"
      },
      {
        "id": "70f2aab1-f003-4d86-9925-daaed07757b6",
        "text": "Локальді массив үйінді жадында құрылады"
      }
    ],
    "correctOptionIds": [
      "6c884c38-3c8b-41de-830d-b9e1d2b3fa1c"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "8f4d479d-7935-424b-8fcc-a02256add8fa",
    "subjectId": "algo",
    "text": "Массив атауының оның бірінші элементіне сілтейтін нұсқауышқа автоматты түрде айналу құбылысы қалай аталады?",
    "options": [
      {
        "id": "426f506c-c738-43d4-bb23-3a1cba00296a",
        "text": "Массивтің ыдырауы (Array decay)"
      },
      {
        "id": "6529fe76-d225-4818-898d-0c0b8e65ac81",
        "text": "Массивтің жойылуы"
      },
      {
        "id": "ed49adaf-2d25-45f1-9e96-beb259ad766d",
        "text": "Массивтің кеңеюі"
      },
      {
        "id": "08879ef6-aba2-4505-bb3e-9112822fdc3e",
        "text": "Массивтің сұрыпталуы"
      }
    ],
    "correctOptionIds": [
      "426f506c-c738-43d4-bb23-3a1cba00296a"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "daab7c8c-8c6b-4c2b-9063-1105ad12c591",
    "subjectId": "algo",
    "text": "C++ тілінде 5 элементтен тұратын `int arr[5] = {0};` массивінің `arr[5]` элементіне қол жеткізсек не орын алады?",
    "options": [
      {
        "id": "c2ea6519-7f73-4379-9ab2-1e97f0182436",
        "text": "Массив шекарасынан шығып кету (Out of bounds) қатесі / Анықталмаған әрекет (Undefined behavior)"
      },
      {
        "id": "744ec61f-1b20-48f4-9a24-4671ad1f55ac",
        "text": "Массивтің соңғы элементі (0) қайтарылады"
      },
      {
        "id": "66195b84-3ac9-41cd-99c4-f5a2ec21973d",
        "text": "Автоматты түрде жаңа элемент қосылып, оның мәні 0 болады"
      },
      {
        "id": "e4e7f700-818b-45c4-8c1a-bda995682bfb",
        "text": "Бағдарлама қалыпты түрде сәтті аяқталады"
      }
    ],
    "correctOptionIds": [
      "c2ea6519-7f73-4379-9ab2-1e97f0182436"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "582c5524-bf2d-436f-8448-4c6e3e8e0a65",
    "subjectId": "algo",
    "text": "C++ тілінде статикалық жарияланған массивтің өлшемін (элементтер санын) есептейтін дұрыс өрнек қандай?",
    "options": [
      {
        "id": "7ab884cc-dd72-41f0-a422-60a28cbfb020",
        "text": "sizeof(arr) / sizeof(arr[0])"
      },
      {
        "id": "cf94fdaf-243b-40d4-b4dc-5cd40f8dc3e1",
        "text": "sizeof(arr)"
      },
      {
        "id": "840ade8d-84c7-4571-abf8-74d15c654504",
        "text": "arr.length()"
      },
      {
        "id": "4cf3cf64-06da-4179-a162-3282f82bd0d9",
        "text": "arr.size()"
      }
    ],
    "correctOptionIds": [
      "7ab884cc-dd72-41f0-a422-60a28cbfb020"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "c406a2a4-bae9-4610-91d3-690cb1ff3323",
    "subjectId": "algo",
    "text": "Неліктен өте үлкен деректер жиынында сызықтық іздеудің орнына екілік іздеу қолданылады?",
    "options": [
      {
        "id": "a7dbab36-e4be-400c-94d6-97f913a5bb45",
        "text": "Екілік іздеу O(log N) уақытында жұмыс істейді, бұл O(N) сызықтық іздеуге қарағанда әлдеқайда жылдам"
      },
      {
        "id": "250c4ae4-9f1a-4e5c-8bae-18b139b2c81c",
        "text": "Екілік іздеу жадты мүлдем талап етпейді"
      },
      {
        "id": "ca7d0faa-884a-42c7-8978-2bd822811230",
        "text": "Екілік іздеу сұрыпталмаған массивтерде де тез жұмыс істейді"
      },
      {
        "id": "bb9b11ce-d500-4b36-9315-05ca1412984c",
        "text": "Сызықтық іздеу тек мәтіндер үшін қолданылады"
      }
    ],
    "correctOptionIds": [
      "a7dbab36-e4be-400c-94d6-97f913a5bb45"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "64bc5c03-f005-4521-90d2-016190497ed3",
    "subjectId": "algo",
    "text": "C++ тіліндегі `std::vector::push_back(val)` әдісі қандай әрекет орындайды?",
    "options": [
      {
        "id": "52e061e8-5925-4eb6-8553-834a75c4eb2f",
        "text": "Вектордың соңына жаңа элемент қосады және қажет болса жадты қайта бөледі"
      },
      {
        "id": "5deb2429-62a2-49d3-a807-b66f5ed28192",
        "text": "Вектордың басына жаңа элемент қосады"
      },
      {
        "id": "6e1cb437-9fd6-4af4-9898-bcc204c98325",
        "text": "Вектордың ең соңғы элементін өшіреді"
      },
      {
        "id": "3460f7d9-5791-45cd-9388-3df0decb54e8",
        "text": "Векторды өсу ретімен сұрыптайды"
      }
    ],
    "correctOptionIds": [
      "52e061e8-5925-4eb6-8553-834a75c4eb2f"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "89912996-d801-43fa-b726-1fd15abbf6df",
    "subjectId": "algo",
    "text": "Статикалық массив жарияланғаннан кейін оның өлшемін (сыйымдылығын) өзгертуге бола ма?",
    "options": [
      {
        "id": "7ae1cc9f-d9f7-41a5-8a9e-743dc020e97c",
        "text": "Жоқ, статикалық массивтің өлшемі жарияланғаннан кейін өзгермейтін тұрақты болып қалады"
      },
      {
        "id": "4e76a76e-292e-40ae-93e5-e3b12fedc6ea",
        "text": "Иә, `resize()` әдісі арқылы болады"
      },
      {
        "id": "205ba271-42df-4c58-b85e-2a470ef0ef00",
        "text": "Иә, оған жаңа элементтерді қосу арқылы автоматты түрде кеңейеді"
      },
      {
        "id": "33084fc7-1edd-45e6-9167-31b34cae6a2f",
        "text": "Тек оның элементтерін өшіргенде ғана өлшемі кішірейеді"
      }
    ],
    "correctOptionIds": [
      "7ae1cc9f-d9f7-41a5-8a9e-743dc020e97c"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  },
  {
    "id": "f5581b3c-0f99-4eed-92d8-e5224af715f0",
    "subjectId": "algo",
    "text": "Элементтерінің басым көпшілігі нөлге (немесе әдепкі мәнге) тең болатын матрицалар қалай аталады?",
    "options": [
      {
        "id": "3596d607-84b0-41a9-98f6-38a016970a6f",
        "text": "Сирек матрицалар (Sparse matrix)"
      },
      {
        "id": "cf739837-4873-4ae0-9536-da503fc64660",
        "text": "Тығыз матрицалар"
      },
      {
        "id": "1bf34b35-b3a2-41a9-8653-65697417d70f",
        "text": "Бірлік матрицалар"
      },
      {
        "id": "22753f37-6d0f-4abb-aa62-dcd73cc806ae",
        "text": "Нөлдік матрицалар"
      }
    ],
    "correctOptionIds": [
      "3596d607-84b0-41a9-98f6-38a016970a6f"
    ],
    "type": "SINGLE",
    "topic": "Алгоритмдердің әртүрлі құрылымдарын бағдарламалау",
    "difficulty": "medium"
  }
] as Question[];
