import { Question } from '../../../../types';

// db / Деректер қорын жобалау
export const db9DatabaseDesignQuestions = [
  {
    "id": "f22eb8b5-7de9-4216-8f7b-6564b1df68ff",
    "subjectId": "db",
    "text": "Деректер қорын жобалаудың концептуалдық кезеңінің басты нәтижесі не болып табылады?",
    "options": [
      {
        "id": "64df3c1f-8823-432b-a0ce-61410b3f57c5",
        "text": "ER-диаграммасы (нысандар мен байланыстар моделі)"
      },
      {
        "id": "7dee21e9-1ed6-4ca8-8b4e-fe063816d8fe",
        "text": "SQL CREATE TABLE сценарийлері"
      },
      {
        "id": "eaa84024-ba22-49b2-a2ea-02dd70766280",
        "text": "Кестелердің нормализациялануы"
      },
      {
        "id": "600b6d7f-a38b-47ea-8a22-17b12dd12526",
        "text": "Физикалық файлдар құрылымы"
      },
      {
        "id": "5fea107e-f7b6-4d2b-9854-3480984c786d",
        "text": "Деректері жоқ бос кесте"
      },
      {
        "id": "f445015e-6973-4596-b787-01bb4fcc3a99",
        "text": "Бірнеше кестеде қайталанатын баған"
      },
      {
        "id": "1aec7066-1d2a-4e30-abba-8541115dd7b0",
        "text": "Мәннің тек автоинкрементті болуы"
      },
      {
        "id": "8b631d0f-750a-41b9-89ad-35edbb4e34fd",
        "text": "Экспорттау"
      }
    ],
    "correctOptionIds": [
      "64df3c1f-8823-432b-a0ce-61410b3f57c5"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "b6fc5120-057c-4855-acc9-0cfb6723cf4a",
    "subjectId": "db",
    "text": "Деректер қорын жобалау кезеңдерінің дұрыс реттілігі қандай?",
    "options": [
      {
        "id": "e3544345-845c-454d-b36a-14e7ae67aa4f",
        "text": "Концептуалды -> Логикалық -> Физикалық"
      },
      {
        "id": "c6dfa0be-1694-42fb-b87e-f9cb168315bb",
        "text": "Физикалық -> Логикалық -> Концептуалды"
      },
      {
        "id": "44a84df8-7aa2-48c9-b48f-9c24658114f4",
        "text": "Логикалық -> Концептуалды -> Физикалық"
      },
      {
        "id": "56f7475b-b445-4a19-ab7a-05d9d7418f02",
        "text": "Концептуалды -> Физикалық -> Логикалық"
      },
      {
        "id": "dc703dc0-0b83-4e7b-8772-5497705ae452",
        "text": "Физикалық файлдар құрылымы"
      },
      {
        "id": "1c329ddb-d7b6-4ead-8b6e-115aba8b4abb",
        "text": "Байланыстың кардиналдық дәрежесін"
      },
      {
        "id": "9e182105-18a0-4791-bf7f-ced417e6d3d1",
        "text": "Кесте құрылымын автоматты түрде өзгерту үшін"
      },
      {
        "id": "1c68f0ba-c19b-4cbb-bf2b-49c66a4a7106",
        "text": "Болашақ дерекқорға қойылатын барлық функционалдық және ақпараттық талаптарды анықтау және жүйелеу"
      }
    ],
    "correctOptionIds": [
      "e3544345-845c-454d-b36a-14e7ae67aa4f"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "0eaafa97-ced5-46e9-afec-6e8ac703bf5f",
    "subjectId": "db",
    "text": "Жобалаудың физикалық кезеңінде (physical design) не анықталады?",
    "options": [
      {
        "id": "c8415b85-4c1c-4ab2-84ef-b9fefad1ffa2",
        "text": "Деректердің нақты ДҚБЖ-да сақталу құрылымы, индекстері және файлдық топтары"
      },
      {
        "id": "821200e0-47b0-4b36-ab26-347bf1bab15d",
        "text": "Нысандардың (Entity) өзара байланыстары"
      },
      {
        "id": "c3e578b2-6544-4a9c-98e5-ede145f95265",
        "text": "Кестелерді үшінші қалыпты формаға келтіру"
      },
      {
        "id": "61c276de-35c4-4f2c-875d-02ce09d99017",
        "text": "Бизнес-процестердің логикасы"
      },
      {
        "id": "1e58b3f2-4973-4d45-9f58-042740c254ee",
        "text": "Кестелер санын шектеу"
      },
      {
        "id": "33af6e78-85ee-4e9a-ade2-9f0a2ce6af87",
        "text": "Деректерді репликациялау үшін"
      },
      {
        "id": "b9c3c87a-7964-4bac-959a-e469cd506c16",
        "text": "Сыртқы кілтке NULL қояды"
      },
      {
        "id": "7fdf6efb-04f4-41c0-98bf-2e92c8fff720",
        "text": "Дерекқордың физикалық файлы"
      }
    ],
    "correctOptionIds": [
      "c8415b85-4c1c-4ab2-84ef-b9fefad1ffa2"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "hard"
  },
  {
    "id": "19233fa7-8497-4849-87a3-8ed5e259541e",
    "subjectId": "db",
    "text": "Логикалық жобалау кезеңінде (logical design) қандай әрекет орындалады?",
    "options": [
      {
        "id": "802097e8-d73b-4160-b2d0-1926d4f3edb5",
        "text": "Концептуалды модельді нақты деректер моделіне (мысалы, реляциялық кестелерге) бейімдеу"
      },
      {
        "id": "d5ea97f1-6b79-4be1-9d35-d3ff320335f4",
        "text": "Сервер жадысын баптау"
      },
      {
        "id": "bf0ccd88-b5b4-473d-97b6-25b845255b5f",
        "text": "SQL сұраныстарын оңтайландыру"
      },
      {
        "id": "eb766539-c91f-455e-aa2c-3625661907dd",
        "text": "Тұтынушылардың талаптарын жинау"
      },
      {
        "id": "33716bad-7c07-4663-b0c5-640168c9174e",
        "text": "Деректердің қауіпсіздік деңгейі"
      },
      {
        "id": "3ea1a504-c8d5-4a71-b153-63377a16f202",
        "text": "Бастапқы кілттің басқа атауы"
      },
      {
        "id": "5904252d-1165-436b-9d6c-e6d2d5823856",
        "text": "Сұраныстар орындалу жылдамдығын төмендету"
      },
      {
        "id": "5a28aef5-2aed-45b3-85d0-9ce17f255b8e",
        "text": "Джеймс Франклин"
      }
    ],
    "correctOptionIds": [
      "802097e8-d73b-4160-b2d0-1926d4f3edb5"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "f7d67c0b-d6ba-4791-bc8c-c4ffe30ae920",
    "subjectId": "db",
    "text": "Деректер қорын жобалау процесінің қай кезеңі белгілі бір ДҚБЖ типіне (мысалы, реляциялық) бағытталады, бірақ нақты өнімге (Oracle, PostgreSQL) тәуелсіз болады?",
    "options": [
      {
        "id": "927040cd-f6d0-48d5-8bea-769224cd4cac",
        "text": "Логикалық жобалау (Logical design)"
      },
      {
        "id": "2471c55b-9435-4b2e-a6c1-81e7501033ff",
        "text": "Концептуалды жобалау"
      },
      {
        "id": "069cd24d-31ac-4ba8-ae4b-a3b0d02f8750",
        "text": "Физикалық жобалау"
      },
      {
        "id": "9b6b5aea-d926-4da8-8a43-b5d4076aa9ff",
        "text": "Сыртқы жобалау"
      },
      {
        "id": "2c038910-812d-46c4-9d34-644a53676620",
        "text": "Программалық интерфейс"
      },
      {
        "id": "38f8b907-1f95-4b2f-ad1a-7f43360c9fe5",
        "text": "Логикалық немесе концептуалды деңгейді өзгертпей, деректердің дискіде сақталу тәсілін немесе индекстерін өзгерте алу мүмкіндігі"
      },
      {
        "id": "8f183ad9-84a5-4b7e-b559-01d42bb7619b",
        "text": "Триггерлер мен көріністер"
      },
      {
        "id": "ba9b6cab-687f-4b55-b459-1588422b0757",
        "text": "Дерекқордың физикалық файлы"
      }
    ],
    "correctOptionIds": [
      "927040cd-f6d0-48d5-8bea-769224cd4cac"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "97166bff-8f99-4b39-a38c-bf76ef35a7b7",
    "subjectId": "db",
    "text": "Нысан-байланыс диаграммасы (ERD) деректер қорын жобалаудың қай кезеңінде жасалады?",
    "options": [
      {
        "id": "c0fdabfe-00d3-4495-9c53-c26dc605bd32",
        "text": "Концептуалды жобалау (Conceptual design)"
      },
      {
        "id": "61ad5fb3-3e70-4394-b303-b07589523357",
        "text": "Физикалық жобалау"
      },
      {
        "id": "51fee033-f6bc-46f4-8720-ff40944edc46",
        "text": "Логикалық жобалау"
      },
      {
        "id": "57c7ec57-765a-4b38-92db-876a304f0537",
        "text": "Бағдарламалау кезеңі"
      },
      {
        "id": "49b382d4-1a0b-4879-b320-64b4df1c5dd4",
        "text": "Қос жиекті сопақшамен"
      },
      {
        "id": "537f0341-08d6-4b7c-a5dc-743db2cec7ae",
        "text": "Виртуалды көріністер (Views) арқылы"
      },
      {
        "id": "fd4b7b03-18bc-457b-aa1d-3ed083991ca6",
        "text": "ДҚБЖ өнімін таңдап орнату"
      },
      {
        "id": "0fbd6257-e954-4057-b417-cc281d29e181",
        "text": "Қос жиекті сопақшамен (Double Oval)"
      }
    ],
    "correctOptionIds": [
      "c0fdabfe-00d3-4495-9c53-c26dc605bd32"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "9245b148-18f4-438d-b747-f6d9aea5e43e",
    "subjectId": "db",
    "text": "Деректер қорын жобалаудағы денормализацияның басты мақсаты не?",
    "options": [
      {
        "id": "b73323d5-d9de-427e-88a2-ef7de64e0e56",
        "text": "Оқу сұраныстарының жылдамдығын арттыру (өнімділікті жақсарту)"
      },
      {
        "id": "1ce93e63-5403-4803-96ce-1ec46709512c",
        "text": "Жадты үнемдеу"
      },
      {
        "id": "2c470714-2fcc-480b-b9dd-9dd87db580ac",
        "text": "Деректердің тұтастығын күшейту"
      },
      {
        "id": "0a39acab-7980-4b21-8e0a-08c052287ae1",
        "text": "Кестелер санын көбейту"
      },
      {
        "id": "c1c257f5-82ed-4332-948b-1fa7a327e5b5",
        "text": "Кесте жолдарын белгілі бір шарт бойынша (мысалы, датасы немесе ID-і бойынша) бөлек файлдарға бөлу"
      },
      {
        "id": "96cbd657-3e7a-417c-a0b5-233f22d61612",
        "text": "Жазбаны бірегей сәйкестендіре алатын және бастапқы кілт болуға үміткер кез келген атрибут немесе атрибуттар жиынтығы"
      },
      {
        "id": "04c0bf69-fe35-4ae0-b0c6-c34692efc70d",
        "text": "Сервердегі жедел жадтың жетіспеуінен"
      },
      {
        "id": "27cdbfdb-6f5a-463c-8313-103f308ca5cf",
        "text": "Бизнес-процестердің логикасы"
      }
    ],
    "correctOptionIds": [
      "b73323d5-d9de-427e-88a2-ef7de64e0e56"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "8d7be69b-2f15-4032-b78b-d83ad1ea5a7b",
    "subjectId": "db",
    "text": "Физикалық жобалау кезеңінде шешілетін мәселеге не жатады?",
    "options": [
      {
        "id": "fa8ad85d-9ac2-402c-95d9-bdd522fd968c",
        "text": "Индекстерді таңдау, деректерді сақтау форматтарын баптау, кестелерді дискіге бөлу"
      },
      {
        "id": "199ab941-e3c7-4b5f-8e9a-7f98c1272a0d",
        "text": "Нысандарды және олардың қасиеттерін анықтау"
      },
      {
        "id": "02dc9709-5268-4c75-b646-e65dec342c82",
        "text": "Кестелерді 3NF-ке дейін қалыпқа келтіру"
      },
      {
        "id": "60ce1909-1c02-4d1d-8804-bfaeb51a1cff",
        "text": "Сыртқы кілттерді анықтау"
      },
      {
        "id": "9baf06f4-5cd3-4d68-8032-86d19b3efb4e",
        "text": "Локалды және желілік байланыстар"
      },
      {
        "id": "39765ca8-63bc-4de4-a22b-cc258c3c8649",
        "text": "Кестедегі үлкен және кіші жолдар"
      },
      {
        "id": "44efa882-cbdf-4817-8d72-0b60e67690b2",
        "text": "Бір (One / 1) қатынасын немесе міндетті қатысуды"
      },
      {
        "id": "bc36ccfd-59cb-4914-9c13-c87cb39dec9d",
        "text": "Прецеденттер диаграммасы (Use Case Diagram)"
      }
    ],
    "correctOptionIds": [
      "fa8ad85d-9ac2-402c-95d9-bdd522fd968c"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "dbf3d8c5-7495-44fd-bb67-f2bbaf93eb8a",
    "subjectId": "db",
    "text": "Деректер қорын логикалық жобалаудың басты мақсаты не?",
    "options": [
      {
        "id": "9904a2b5-f088-44d2-b67c-e83e9cffa259",
        "text": "Тұжырымдамалық модельді нақты деректер құрылымына (кестелерге, схемаларға) түрлендіру"
      },
      {
        "id": "4a903d11-cf4a-458c-a139-1a2d52b847e5",
        "text": "Деректерді дискіге жазу жылдамдығын баптау"
      },
      {
        "id": "7f019a32-0244-4978-b09e-873cd7e5f17a",
        "text": "ER диаграммасын құру"
      },
      {
        "id": "6b3ec79f-5608-44ee-8fa5-b8d5b624e726",
        "text": "Қолданушы интерфейсін жобалау"
      },
      {
        "id": "b0e4f3b7-6654-44bf-a879-0f198a5b89c5",
        "text": "Бірнеше қарапайым атрибуттарға бөлінетін атрибут (мысалы, Аты, Тегі, Әкесінің атынан тұратын Аты-жөні)"
      },
      {
        "id": "ef699b61-16b5-4f59-bf79-e9de372d5136",
        "text": "UNIQUE және CHECK шектеулері арқылы"
      },
      {
        "id": "1f34202a-b732-4eb1-8695-535f58604a2a",
        "text": "Ол сыртқы кілтпен байланыса алмайды"
      },
      {
        "id": "268dfce8-5d09-4fa4-82a8-4c314caee21b",
        "text": "Кестелер санын көбейту"
      }
    ],
    "correctOptionIds": [
      "9904a2b5-f088-44d2-b67c-e83e9cffa259"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "f4fcc83b-af5f-45ab-8192-80282b22820a",
    "subjectId": "db",
    "text": "Деректер қорын концептуалды жобалау кезеңі кімдердің қатысуымен және қандай деңгейде жүргізіледі?",
    "options": [
      {
        "id": "7cdfafca-e9a4-4167-bd8f-768aea48a675",
        "text": "Пәндік сала мамандарымен бірге бизнес-талаптар негізінде ДҚБЖ-ға тәуелсіз жоғары деңгейде"
      },
      {
        "id": "2ff70082-5019-46f3-8aeb-74af0323cca0",
        "text": "Тек бағдарламашылармен нақты SQL код деңгейінде"
      },
      {
        "id": "ce692220-1004-4a0f-a0b0-45f1971d71ab",
        "text": "Сервер әкімшілерімен аппараттық деңгейде"
      },
      {
        "id": "1e27be3c-1fc2-41ab-8bab-872730b3f02c",
        "text": "Тұтынушы интерфейсі деңгейінде"
      },
      {
        "id": "775fe400-2ea5-4de0-a20a-351743ba191a",
        "text": "Пайдаланушы интерфейсін құрады"
      },
      {
        "id": "ba765eb9-70e3-4131-a753-f8cf5413291e",
        "text": "Бірнеше мәнді бір уақытта сақтайтын атрибут"
      },
      {
        "id": "4fe4d73d-4579-4522-8ef0-dcb11b0b7324",
        "text": "Болашақ дерекқорға қойылатын барлық функционалдық және ақпараттық талаптарды анықтау және жүйелеу"
      },
      {
        "id": "a0bc9b50-ed52-400b-8e77-56df0ff68460",
        "text": "Айырмашылығы жоқ"
      }
    ],
    "correctOptionIds": [
      "7cdfafca-e9a4-4167-bd8f-768aea48a675"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "d71298ef-def6-4add-8d16-69d806c96ea1",
    "subjectId": "db",
    "text": "Деректер қорын концептуалды жобалау кезеңінде нысандар арасындағы байланыстың қандай түрлері сипатталады?",
    "options": [
      {
        "id": "0f751499-a91a-4a7f-bb4c-b80f45ec899d",
        "text": "1:1, 1:M және M:N байланыстары"
      },
      {
        "id": "537ad47b-8c5f-4cc4-b893-b4d0d1ca9faf",
        "text": "Локалды және желілік байланыстар"
      },
      {
        "id": "c80b172b-f06f-4840-8478-2a4617b3ccbd",
        "text": "Тек сыртқы кілттер арқылы байланыстар"
      },
      {
        "id": "657c1962-088e-4069-917d-e0d843a4b38f",
        "text": "Айырмашылық жоқ"
      },
      {
        "id": "4404f275-60c9-4391-bf11-edfc8d3a607a",
        "text": "Сұраныста JOIN дұрыс жазылмағанда"
      },
      {
        "id": "323e0b20-fc3d-43d3-8e5e-854593fded8b",
        "text": "Ол дерекқордың қауіпсіздігін бұзады"
      },
      {
        "id": "7bc9d0a0-eea4-4db3-9bef-04751beaa811",
        "text": "Мәннің тек автоинкрементті болуы"
      },
      {
        "id": "8d378cbd-3694-4462-852a-c0622317fce8",
        "text": "Пайдаланушының деректерді қабылдау ережелерін"
      }
    ],
    "correctOptionIds": [
      "0f751499-a91a-4a7f-bb4c-b80f45ec899d"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "ef13a2dc-8e24-4738-9616-7a21429425d3",
    "subjectId": "db",
    "text": "Көптің-көпке (M:N) байланысын реляциялық дереккорда логикалық деңгейде қалай жүзеге асырады?",
    "options": [
      {
        "id": "fb943fea-541a-4e60-9a16-d5817c0b8ab5",
        "text": "Аралық байланыстырушы кесте (junction table) құру және оған екі кестенің бастапқы кілттерін сыртқы кілт ретінде қосу арқылы"
      },
      {
        "id": "3adcea07-3efa-4fab-87ce-a658f0ab4276",
        "text": "Тікелей сыртқы кілт қосу арқылы"
      },
      {
        "id": "e17f376a-06f9-40e0-ae0a-0d25d754c02b",
        "text": "Екі кестені біріктіріп бір кесте жасау арқылы"
      },
      {
        "id": "cc0a7b56-ab91-431c-b803-bee920f0e608",
        "text": "Индекстер көмегімен"
      },
      {
        "id": "de12588d-9fd4-4e56-9868-43185ff29960",
        "text": "Тұжырымдамалық модельді нақты деректер құрылымына (кестелерге, схемаларға) түрлендіру"
      },
      {
        "id": "43d19caf-c82a-4c48-9aa5-4d7bbbe37997",
        "text": "Бір кестенің бастапқы кілті екінші кестеде сыртқы кілт (FK) әрі бірегей (UNIQUE) болып табылады"
      },
      {
        "id": "10d07035-06ea-4e15-b0d7-1fbf4d089677",
        "text": "Логикалық жобалауда"
      },
      {
        "id": "93ff42c6-d5d1-4a26-b9d5-0e2d89a58c6d",
        "text": "Ол ешқашан жадыдан орын алмайды"
      }
    ],
    "correctOptionIds": [
      "fb943fea-541a-4e60-9a16-d5817c0b8ab5"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "05c1aa53-0a59-4371-8a0c-abe8b7c80491",
    "subjectId": "db",
    "text": "Деректер қорын физикалық жобалау кезінде деректерді жылдам оқу үшін қандай құрылымдар жасалады?",
    "options": [
      {
        "id": "034436ab-d0ff-4a26-adf4-b0fd34812e3e",
        "text": "Индекстер (кластерленген және кластерленбеген)"
      },
      {
        "id": "55eb340f-79d0-4153-8eca-2ff1af69e242",
        "text": "Жаңа сыртқы кілттер"
      },
      {
        "id": "dca57900-4092-465b-a061-5595ab51a1fa",
        "text": "Қалыпты формалар (Normal Forms)"
      },
      {
        "id": "e0af1417-2b4b-415c-84b9-6507aaca871c",
        "text": "Триггерлер мен көріністер"
      },
      {
        "id": "dadd6e41-2b6f-47d5-b034-83a8a1f11e67",
        "text": "Сұраныстың орындалу жылдамдығын өлшейтін құрал"
      },
      {
        "id": "fde3e8ca-3f16-4afe-91a6-c627831d8ea0",
        "text": "Сервердегі жедел жадтың жетіспеуінен"
      },
      {
        "id": "aa469d82-0c73-4a97-abef-dbcbb1605fad",
        "text": "Деректердің жоғалуы салдарынан бүлінуі"
      },
      {
        "id": "1f5c65c1-95ce-4bea-ae53-0bf05774352d",
        "text": "Пәндік сала мамандарымен бірге бизнес-талаптар негізінде ДҚБЖ-ға тәуелсіз жоғары деңгейде"
      }
    ],
    "correctOptionIds": [
      "034436ab-d0ff-4a26-adf4-b0fd34812e3e"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "52826d14-3fbb-4be4-a658-1154c3317b77",
    "subjectId": "db",
    "text": "Логикалық модельді концептуалды модельден басты айырмашылығы неде?",
    "options": [
      {
        "id": "a8bc2aa2-5be8-4be9-bdad-92abfe1a301f",
        "text": "Логикалық модель нақты деректер моделінің типіне (мысалы, реляциялық) бағытталып, кестелер мен кілттер деңгейінде сипатталады"
      },
      {
        "id": "142aa761-fdf6-4965-9a8c-4c4b72c8832d",
        "text": "Логикалық модель ДҚБЖ-ға мүлдем тәуелді емес"
      },
      {
        "id": "3fd86cdc-9190-4c67-99ba-a66e0951622d",
        "text": "Концептуалды модель физикалық файлдар құрылымын сипаттайды"
      },
      {
        "id": "1bbf563b-eb05-469a-aacd-1a298cacd4d8",
        "text": "Айырмашылығы жоқ"
      },
      {
        "id": "f22508ab-81f3-44b7-bcbf-89147e8b0e12",
        "text": "Физикалық жобалау"
      },
      {
        "id": "66572db1-db36-45e4-b2ec-93cdcc8b9a50",
        "text": "Пайдаланушылардың парольдерін сақтау үшін"
      },
      {
        "id": "76564771-6117-4706-9705-a1c445f74422",
        "text": "Ол өте баяу сұрыпталады"
      },
      {
        "id": "cf62adf4-71cc-4cde-b38a-910baa6229b4",
        "text": "Байланыстың кардиналдық дәрежесін"
      }
    ],
    "correctOptionIds": [
      "a8bc2aa2-5be8-4be9-bdad-92abfe1a301f"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "24018cf5-2059-4b81-8dc2-74c969c493a7",
    "subjectId": "db",
    "text": "Деректер қорын концептуалды жобалау кезеңі кімдердің қатысуымен және қандай деңгейде жүргізіледі?",
    "options": [
      {
        "id": "ee54d9cb-3e33-4891-913c-b6584e3ae7f4",
        "text": "Пәндік сала мамандарымен бірге бизнес-талаптар негізінде ДҚБЖ-ға тәуелсіз жоғары деңгейде"
      },
      {
        "id": "00601788-3d0f-4801-bf36-afdebb8cfe0d",
        "text": "SQL сұраныстар деңгейінде"
      },
      {
        "id": "80ad2a76-89c6-47fc-ad97-e96bfbd8c532",
        "text": "Аппараттық деңгейде"
      },
      {
        "id": "4b1a42cf-96e6-4578-855b-61e8769b7194",
        "text": "Пайдаланушы интерфейсі деңгейінде"
      },
      {
        "id": "a8f309d7-5159-4f90-ae35-d1b72f0cd329",
        "text": "Бастапқы кілттердің санын"
      },
      {
        "id": "c8002942-bd32-40e4-a712-00eb99f3f01c",
        "text": "Айырмашылық жоқ"
      },
      {
        "id": "fe621b4d-944c-4990-a868-0d790036bd0d",
        "text": "Көк түспен"
      },
      {
        "id": "836a9a1c-f706-4273-9398-6790f64d6797",
        "text": "Үшбұрышпен"
      }
    ],
    "correctOptionIds": [
      "ee54d9cb-3e33-4891-913c-b6584e3ae7f4"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "c65a8efe-62c9-4803-a683-40b8895322bb",
    "subjectId": "db",
    "text": "Деректер қорын жобалаудың логикалық кезеңінде қандай ережелер қолданылады?",
    "options": [
      {
        "id": "9e992396-f346-4762-ac9c-ee19290ae4e5",
        "text": "Кестелерді қалыпқа келтіру (нормализация 1-3NF) ережелері"
      },
      {
        "id": "299eadaa-a16e-48b6-9dca-529a2689d3bd",
        "text": "SQL Server-де жад көлемін таңдау"
      },
      {
        "id": "f7143a35-5cbf-4854-a3fc-7879e83e549f",
        "text": "Файл топтарын құру"
      },
      {
        "id": "eebbb953-12cc-4ac1-840a-019490cccc30",
        "text": "Айырмашылық жоқ"
      },
      {
        "id": "6233ec9c-bc02-4cbe-a65c-b12bb83abdd3",
        "text": "Дерекқордың желіге қосылу міндеттілігін"
      },
      {
        "id": "df01c7a7-bbc8-4fa6-8768-90f913d6827e",
        "text": "Логикалық немесе концептуалды деңгейді өзгертпей, деректердің дискіде сақталу тәсілін немесе индекстерін өзгерте алу мүмкіндігі"
      },
      {
        "id": "f8b6e688-5f23-44da-b3c8-8fa8a9621dcb",
        "text": "Субтип кестесіндегі бастапқы кілт сонымен қатар супертип кестесіне сілтеме жасайтын сыртқы кілт (FK) болады"
      },
      {
        "id": "1cf76bba-1125-4a9e-98a9-0582d1c052f8",
        "text": "Сыртқы кілт болып табылатын атрибут"
      }
    ],
    "correctOptionIds": [
      "9e992396-f346-4762-ac9c-ee19290ae4e5"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "6993f105-dfba-4eb1-a77c-3374f9a12e86",
    "subjectId": "db",
    "text": "Деректер қорын концептуалды жобалау кезеңінде қолданылатын негізгі нысан байланысы (ER) моделінің авторы кім?",
    "options": [
      {
        "id": "6536bacf-76cb-46db-981a-f373c5a7de9e",
        "text": "Питер Чен (Peter Chen)"
      },
      {
        "id": "a770fcea-b83a-454d-9dab-74da70450edb",
        "text": "Эдгар Кодд (Edgar Codd)"
      },
      {
        "id": "ef585343-a206-40b9-8fe8-130109ac9824",
        "text": "Алан Тьюринг"
      },
      {
        "id": "fe69fcf7-5bea-47d9-a6ff-e137c4c32341",
        "text": "Дональд Кнут"
      },
      {
        "id": "2168e69b-150e-4e47-8f9f-04ff325091b6",
        "text": "DELETE PERMISSION UPDATE"
      },
      {
        "id": "c4b209ef-0103-40ce-a73c-ad42ec5b12f8",
        "text": "Деректерді тек қана сұрыптау"
      },
      {
        "id": "73e17a29-6854-4afb-b790-d61f2aa4fe57",
        "text": "Кестеге (Relation / Table)"
      },
      {
        "id": "94214ab1-a75e-4f79-80d7-3b1e68d65004",
        "text": "Кесте жолдарын диапазон бойынша бөлу"
      }
    ],
    "correctOptionIds": [
      "6536bacf-76cb-46db-981a-f373c5a7de9e"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "2b650b35-5f7a-4a7c-96d6-f5df651d386b",
    "subjectId": "db",
    "text": "Реляциялық дерекқорды физикалық деңгейде оңтайландыру (physical tuning) үшін не істеуге болады?",
    "options": [
      {
        "id": "7e4243d5-c347-446e-9ae1-d3fbef193946",
        "text": "Индекстер құру, деректерді секциялау (partitioning) және буфер көлемін баптау"
      },
      {
        "id": "1ac0346a-a520-4a3a-93d2-deb39b3f5f9c",
        "text": "Кестелерді 3NF-тен 1NF-ке түсіру"
      },
      {
        "id": "9da3af0d-c8bf-4da6-b2cd-d1d2d4583fc0",
        "text": "Бастапқы кілттерді өшіру"
      },
      {
        "id": "8bb66154-e96c-4955-8bba-34c3b975928a",
        "text": "Жаңа сыртқы кілттерді көбейту"
      },
      {
        "id": "4888bd88-eb65-4edd-a39b-aaa62d962df3",
        "text": "Класс диаграммасы (Class Diagram)"
      },
      {
        "id": "6356f7f5-fc91-4c2a-bb40-e2d91145813e",
        "text": "Ол тек бағдарламалаушыға түсінікті болады"
      },
      {
        "id": "d692347a-08c1-43ce-8d41-adfce82b334b",
        "text": "Жиі орындалатын SQL кодтарын дерекқор серверінде сақтап, жылдам орындау және қауіпсіздікті арттыру үшін"
      },
      {
        "id": "3db35830-26f7-43d2-b80e-ff0985c462d8",
        "text": "Бір нысанның қанша данасы екінші нысанның даналарымен байланыса алатынын көрсететін қатынас (мысалы, 1:1, 1:M, M:N)"
      }
    ],
    "correctOptionIds": [
      "7e4243d5-c347-446e-9ae1-d3fbef193946"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "6ec011aa-0655-4224-9872-7aa7672db73f",
    "subjectId": "db",
    "text": "Жобалау кезеңінде деректердің артықшылығын (redundancy) азайтудың басты мақсаты не?",
    "options": [
      {
        "id": "78744f4d-202b-44f9-bfaa-356b16c2eb4d",
        "text": "Деректерді жаңарту кезіндегі аномалияларды болдырмау және жадыны үнемдеу"
      },
      {
        "id": "8be4abd6-842b-4aaf-8507-6fb797b7034d",
        "text": "Сұраныстар орындалу жылдамдығын төмендету"
      },
      {
        "id": "2c485b17-6c39-435e-843f-59785307eff4",
        "text": "Кестелер санын шектеу"
      },
      {
        "id": "88b7b337-fe12-43a5-9938-f728b9886c60",
        "text": "Индекстерді азайту"
      },
      {
        "id": "5fe772f9-be77-4790-90fe-ae56da03c439",
        "text": "Деректерді басқару серверін"
      },
      {
        "id": "1e7e0a97-a247-4559-85d5-e5181a0d467a",
        "text": "Прецеденттер диаграммасы (Use Case Diagram)"
      },
      {
        "id": "ce512872-6af2-4d16-82b5-f8c130d3bc97",
        "text": "Кестедегі жазбаларды шифрлау"
      },
      {
        "id": "4e1056b1-89f4-4f2b-9200-a8ff74cc73ea",
        "text": "Индекстер құру, деректерді секциялау (partitioning) және буфер көлемін баптау"
      }
    ],
    "correctOptionIds": [
      "78744f4d-202b-44f9-bfaa-356b16c2eb4d"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "8faa2750-dd54-49a6-86be-1344f637bf12",
    "subjectId": "db",
    "text": "Нысанның атрибуты (Entity Attribute) деген не?",
    "options": [
      {
        "id": "d1a57503-5e7c-4ad0-bc25-f6eeda12def2",
        "text": "Нысанның белгілі бір қасиеті немесе сипаттамасы (мысалы, Студенттің Аты-жөні)"
      },
      {
        "id": "def34aaa-dc40-4f48-a588-e134dbd0e143",
        "text": "Нысандар арасындағы байланыс"
      },
      {
        "id": "62389d67-7856-42ec-b1ba-4b45793795b9",
        "text": "Жаңа кесте"
      },
      {
        "id": "d9dc2a74-cc17-4b41-a7c9-d6edc9f7315b",
        "text": "Бастапқы кілттің басқа атауы"
      },
      {
        "id": "687f7cdd-5421-4ede-9db2-e11839ffedf2",
        "text": "Қолданушы талаптары мен құжаттамаларды зерттеу (Requirements gathering)"
      },
      {
        "id": "f2c1a4df-a990-4497-b405-16dcc7828d2d",
        "text": "Constraints (UNIQUE, CHECK, NOT NULL, FK) шектеулері арқылы"
      },
      {
        "id": "20f717d4-5b8c-4d63-ba64-07c1806c627f",
        "text": "Бьерн Страуструп"
      },
      {
        "id": "480ed58b-482f-4f6b-b349-65282f16e027",
        "text": "Кестенің толығымен жойылу мүмкіндігі"
      }
    ],
    "correctOptionIds": [
      "d1a57503-5e7c-4ad0-bc25-f6eeda12def2"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "1d1bd7a6-9ed9-492a-a39b-9722ce226bd7",
    "subjectId": "db",
    "text": "Дерекқорды жобалаудың өмірлік циклінің дұрыс реттілігі қандай?",
    "options": [
      {
        "id": "4ece6704-ed00-4df3-bc66-8de1aa127690",
        "text": "Талаптарды талдау -> Концептуалды жобалау -> Логикалық жобалау -> Физикалық жобалау"
      },
      {
        "id": "6ce09a75-ad9f-4df3-a1ed-94fbdf62a78e",
        "text": "Логикалық жобалау -> Концептуалды жобалау -> Физикалық жобалау"
      },
      {
        "id": "9f3f9d55-5cbb-4071-b35b-bfbfd751e9cb",
        "text": "Код жазу -> Кесте құру -> Оңтайландыру"
      },
      {
        "id": "f7ac6817-4d58-4159-8666-11ce451033c0",
        "text": "Физикалық жобалау -> Талаптарды талдау -> Логикалық жобалау"
      },
      {
        "id": "c4b96a89-3ad4-4c1c-ba88-af5bbccf2499",
        "text": "Дерекқордың желілік қосылымына тәуелсіз болуы"
      },
      {
        "id": "93bd2050-0973-4553-8fbb-45debf6940c9",
        "text": "Деректерді жаңарту кезіндегі аномалияларды болдырмау және жадыны үнемдеу"
      },
      {
        "id": "2a18b58e-80f2-48d0-afdd-11a5f8435eba",
        "text": "Деректердің нақты ДҚБЖ-да сақталу құрылымы, индекстері және файлдық топтары"
      },
      {
        "id": "6c956122-0929-4239-903d-216200d578e9",
        "text": "Деректерді басқару серверін"
      }
    ],
    "correctOptionIds": [
      "4ece6704-ed00-4df3-bc66-8de1aa127690"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "4b5cf3e1-8157-43e9-935c-b14ec668b71c",
    "subjectId": "db",
    "text": "Дерекқорды концептуалды жобалау кезеңінің негізгі нәтижесі (шығысы) не?",
    "options": [
      {
        "id": "f1c62608-8353-4e36-b8f6-c8e2f27549bb",
        "text": "Дерекқордан тәуелсіз ER-модель (диаграмма)"
      },
      {
        "id": "724bce9d-23f4-45a8-ae61-4258b9ac0ba1",
        "text": "Нақты SQL кестелерінің скрипттері"
      },
      {
        "id": "e968d5ca-19a3-4759-8b23-8f00ac82db6d",
        "text": "Индекстерді құру жоспары"
      },
      {
        "id": "b5ddf96a-091e-4844-8d8a-7d80927b1fd2",
        "text": "Программалық интерфейс"
      },
      {
        "id": "fce02b60-3d94-46ed-8f7e-9285667932e1",
        "text": "Сыртқы кілт"
      },
      {
        "id": "edb6fbaf-db9b-49ce-ab35-7387e50b02b7",
        "text": "SQL кодтарын жылдам орындау"
      },
      {
        "id": "cbe39302-e4ce-46ae-9e70-955a41381187",
        "text": "Индекстер жұмысы тоқтайды"
      },
      {
        "id": "6dcb05e7-33d3-4e6a-987f-b1a160e0e7ae",
        "text": "Бастапқы және екіншілік кілттер жиынтығы"
      }
    ],
    "correctOptionIds": [
      "f1c62608-8353-4e36-b8f6-c8e2f27549bb"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "d2796193-8961-4197-b29c-8e105e05279a",
    "subjectId": "db",
    "text": "Дерекқорды логикалық жобалау кезеңінің мақсаты не?",
    "options": [
      {
        "id": "58633b85-f8bb-4691-a27b-8e045154507c",
        "text": "Концептуалды ER-модельді нақты бір деректер моделіне (мысалы, реляциялық схемаға) сәйкестендіру және қалыпқа келтіру (нормализация)"
      },
      {
        "id": "e0b030c0-ba05-4c0b-8ce4-ce0cb01db5e4",
        "text": "Дискідегі файлдарды орналастыру"
      },
      {
        "id": "193785fa-cf74-40f0-9d8f-eedd3747934a",
        "text": "SQL сервердің жадын баптау"
      },
      {
        "id": "a06cae7f-0b1f-42ec-a20f-9738c0008ab7",
        "text": "Пайдаланушыларға рұқсат беру"
      },
      {
        "id": "f0de56b2-5e18-475e-a962-c50d5da17a84",
        "text": "ER-диаграмманың құрылымын"
      },
      {
        "id": "f01f46a8-61a2-4846-8e19-1061c2f83064",
        "text": "Бизнес-процестердің логикасы"
      },
      {
        "id": "642cbb66-d5da-4a77-a24b-b59e23b048ca",
        "text": "Бір бағанға JSON форматында жазылады"
      },
      {
        "id": "20888bbd-74ad-46cd-92e0-a8210b8ed107",
        "text": "Сәйкестендіруші немесе Идентификациялаушы байланыс (Identifying Relationship)"
      }
    ],
    "correctOptionIds": [
      "58633b85-f8bb-4691-a27b-8e045154507c"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "fcdad2e6-62cb-43c8-b0e1-88319f35339b",
    "subjectId": "db",
    "text": "Дерекқорды физикалық жобалау кезеңінде қандай шешімдер қабылданады?",
    "options": [
      {
        "id": "cfe50878-c5bb-4db3-9f6b-0138ec984ae9",
        "text": "Деректерді сақтау форматтары, индекстеу стратегиялары, файлдық топтар және дискілік кеңістікті бөлу"
      },
      {
        "id": "1640f377-06cb-41c0-bd4d-849388598433",
        "text": "Нысандардың байланыс түртерін анықтау"
      },
      {
        "id": "54df92ab-ec35-417b-bf70-7738caaa2a97",
        "text": "Кестелерді 3NF-ке келтіру"
      },
      {
        "id": "b953cc2c-73e9-4633-b59d-781ed4f845e5",
        "text": "Қолданбаның бизнес логикасын жазу"
      },
      {
        "id": "39cba53a-6073-498c-973f-58c8fc3014c1",
        "text": "Логикалық жобалау -> Концептуалды жобалау -> Физикалық жобалау"
      },
      {
        "id": "83a8cc8e-5b30-4039-b646-b9b227d5c7d8",
        "text": "Ішкі және сыртқы"
      },
      {
        "id": "8e15b3b8-bd75-467b-bf2f-43711e828131",
        "text": "Сыртқы жобалау"
      },
      {
        "id": "6fe85546-8d64-46a5-8aeb-2dafe42b5ade",
        "text": "Екі кестенің бірігуі"
      }
    ],
    "correctOptionIds": [
      "cfe50878-c5bb-4db3-9f6b-0138ec984ae9"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "a1d5bb6b-ae46-4268-8ea8-f739982a074e",
    "subjectId": "db",
    "text": "Дерекқорды жобалауда денормализация (Denormalization) не үшін қолданылады?",
    "options": [
      {
        "id": "82859413-eceb-4e3e-8bdb-01cd18038a7c",
        "text": "Оқу сұраныстарының орындалуын жылдамдату үшін деректердің біраз артықшылығына (redundancy) саналы түрде жол беру"
      },
      {
        "id": "3a2348d5-9b57-4696-b7c1-0f99d63bb706",
        "text": "Кестелер санын шексіз көбейту үшін"
      },
      {
        "id": "f6ff3d47-48a4-4317-b6bf-3b3fa386b346",
        "text": "Тұтастық шектеулерін жою үшін"
      },
      {
        "id": "52d60eea-c3bc-48e7-8867-76836f029c9a",
        "text": "Жадыдан орын үнемдеу үшін"
      },
      {
        "id": "d76c311c-a502-497e-9626-86cdc7a520a3",
        "text": "Сыртқы кілт"
      },
      {
        "id": "2c44aa4e-9189-4edf-b6f9-cfe520beaf81",
        "text": "Тек бағдарламашылармен нақты SQL код деңгейінде"
      },
      {
        "id": "eb224c6f-34e3-40cd-a742-c505c663e159",
        "text": "Деректерді автоматты түрде толтырады"
      },
      {
        "id": "3d3e37c4-ddd0-4101-a7c9-fcc690222555",
        "text": "Кесте құрылымындағы индекстердің міндеттілігін"
      }
    ],
    "correctOptionIds": [
      "82859413-eceb-4e3e-8bdb-01cd18038a7c"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "0fe9bdfe-c8d7-4d64-8f86-4d3d5debaaaf",
    "subjectId": "db",
    "text": "Деректер қорындағы \"аномалиялар\" (жаңарту, жою, қосу аномалиялары) не себепті пайда болады?",
    "options": [
      {
        "id": "797ae652-9f03-4db2-9292-0f221a6997a2",
        "text": "Деректердің нашар жобалануы және олардың негізсіз артық (redundant) сақталуы салдарынан"
      },
      {
        "id": "47b9c68c-94c0-4d3e-8697-af9b53cc7e29",
        "text": "Индекстердің тым көп болуынан"
      },
      {
        "id": "88f64319-350a-475e-93b3-c9f0cd4c3fdc",
        "text": "SQL сұраныстарының қате жазылуынан"
      },
      {
        "id": "52a41895-06e9-41f7-8f3a-28c8f2672eb3",
        "text": "Сервердегі жедел жадтың жетіспеуінен"
      },
      {
        "id": "ab23a665-ebaf-4f25-9632-1c960342bcde",
        "text": "Дерекқордың физикалық файлы"
      },
      {
        "id": "9ff217cc-c874-4bfa-bca5-bf81e586698e",
        "text": "Тізбектілік диаграммасы (Sequence Diagram)"
      },
      {
        "id": "acf7da43-64b8-46d1-9daa-dad263046cf2",
        "text": "Жаңа сыртқы кілттерді көбейту"
      },
      {
        "id": "64d8a9e5-ed4d-4241-9c6f-2261ae87aede",
        "text": "Дерекқордың өлшемін тым үлкейтіп жібереді"
      }
    ],
    "correctOptionIds": [
      "797ae652-9f03-4db2-9292-0f221a6997a2"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "5784b0a6-ce47-44db-b096-07c6c01712b0",
    "subjectId": "db",
    "text": "Дерекқордың концептуалды моделінің басты ерекшелігі қандай?",
    "options": [
      {
        "id": "18e3ca4d-66a0-48f9-94bb-3ba770230eb3",
        "text": "Ол нақты ДҚБЖ бағдарламасына (Oracle, PostgreSQL, т.б.) және физикалық сақтау тәсіліне мүлдем тәуелсіз болады"
      },
      {
        "id": "140ca94b-e96f-43a6-831f-e8004e195393",
        "text": "Ол тек SQL Server-де жұмыс істейді"
      },
      {
        "id": "732e2fe3-405f-4fbf-b753-5ca71c918a5b",
        "text": "Онда тек сандық деректер сипатталады"
      },
      {
        "id": "72b2e9e4-6ab5-41ec-93c7-e628c5cfc6b0",
        "text": "Ол тек бағдарламалаушыға түсінікті болады"
      },
      {
        "id": "87400054-04e7-489e-a3ca-0accdd0d209b",
        "text": "Сыртқы кілтке (Foreign Key)"
      },
      {
        "id": "418b1381-af95-4ee7-adfe-61f194c019a8",
        "text": "Жеке жаңа кесте құрылып, оған телефон нөмірлері жол ретінде жазылады және сыртқы кілтпен байланыстырылады"
      },
      {
        "id": "dc17aa7f-8730-40ac-8c04-d97852cf82d0",
        "text": "Нысандардың байланыс түртерін анықтау"
      },
      {
        "id": "3aab24f5-e7cb-41b9-b67e-42195e8141e9",
        "text": "Қауіпсіздікті қамтамасыз ету үшін пайдаланушылар тобына құқықтарды оңай басқару"
      }
    ],
    "correctOptionIds": [
      "18e3ca4d-66a0-48f9-94bb-3ba770230eb3"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "8989d7ba-deec-453b-b8c1-b5b537be27f6",
    "subjectId": "db",
    "text": "Жобалау кезеңінде \"көпмәнді атрибут\" (мысалы, бір адамның бірнеше телефон нөмірі болуы) реляциялық кестеге қалай аударылады?",
    "options": [
      {
        "id": "74b326fb-17fa-4f5a-bddc-2ab792a2ee3d",
        "text": "Жеке жаңа кесте құрылып, оған телефон нөмірлері жол ретінде жазылады және сыртқы кілтпен байланыстырылады"
      },
      {
        "id": "1ba547d0-b201-470a-82c5-ae2a47d326cd",
        "text": "Телефондардың барлығы бір ұяшыққа үтір арқылы жазылады"
      },
      {
        "id": "62a6918c-4ea6-4142-974e-9849d29d9425",
        "text": "Кестеге телефон1, телефон2, телефон3 деп бірнеше баған қосылады"
      },
      {
        "id": "37fcc27d-c99a-4786-aba5-5d746aab7fa0",
        "text": "Мұндай атрибут мүлдем жойылады"
      },
      {
        "id": "111f1012-3b7f-41c2-bd40-6d91f3800ddb",
        "text": "Кестеге (Relation / Table)"
      },
      {
        "id": "f17edad4-2ae1-419c-bf6a-9c270ff05398",
        "text": "Triggers (триггерлер) және Stored Procedures (сақталатын процедуралар) арқылы"
      },
      {
        "id": "12d2253f-8f93-4c7e-b0a7-8535dd28d923",
        "text": "Қауіпсіздікті қамтамасыз ету үшін пайдаланушылар тобына құқықтарды оңай басқару"
      },
      {
        "id": "8705b97f-6469-4050-983d-1e118a3f26f6",
        "text": "Ата-аналық жазба жойылғанда FK бағанына оның әдепкі мәнін тағайындайды"
      }
    ],
    "correctOptionIds": [
      "74b326fb-17fa-4f5a-bddc-2ab792a2ee3d"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "3c499522-ebbf-4010-96f3-866e7798bb14",
    "subjectId": "db",
    "text": "Бастапқы кілтті таңдауда қандай критерий ең маңызды болып табылады?",
    "options": [
      {
        "id": "47f560bf-0d21-41e5-b0e5-cb68d44ac016",
        "text": "Мәннің өзгермейтіндігі (stability) және бірегейлігі (uniqueness)"
      },
      {
        "id": "2b02aa3f-eadb-4d16-9268-4985b9a6d0ac",
        "text": "Мәннің ұзындығының үлкен болуы"
      },
      {
        "id": "bf9df1b1-3150-42cc-a2ca-71213a32dc6e",
        "text": "Деректер типінің мәтіндік болуы"
      },
      {
        "id": "6de09b2f-e21e-497e-ae35-528d4be5942b",
        "text": "Мәннің тек автоинкрементті болуы"
      },
      {
        "id": "555e050a-c8f6-4f21-9fd9-4b74ea9a9993",
        "text": "ER-диаграммасы (нысандар мен байланыстар моделі)"
      },
      {
        "id": "379dd9d6-7fde-42c6-8396-6725bb4d9ec4",
        "text": "Аты-жөні бірегей емес (аттастар болуы мүмкін) және уақыт өте келе өзгеруі мүмкін"
      },
      {
        "id": "4f74954e-9c01-4d93-a637-b45894d62a04",
        "text": "Ішкі және сыртқы"
      },
      {
        "id": "dd424554-8442-4deb-a8cd-d2ea7d78a5c3",
        "text": "SQL кодтарын жылдам орындау"
      }
    ],
    "correctOptionIds": [
      "47f560bf-0d21-41e5-b0e5-cb68d44ac016"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "9aa5157e-86a2-4808-afd2-77678b31e1a7",
    "subjectId": "db",
    "text": "Сілтемелік тұтастықты (referential integrity) қамтамасыз ету қай кезеңде шешіледі?",
    "options": [
      {
        "id": "c8177210-d85f-45b1-abbc-e3ef769353b5",
        "text": "Логикалық жобалауда"
      },
      {
        "id": "29661468-e51d-4ca0-a96c-193fd9e0b939",
        "text": "Физикалық жобалауда"
      },
      {
        "id": "dade6ca0-ff02-48f5-8c92-0839938dff2b",
        "text": "Талаптарды жинау кезеңінде"
      },
      {
        "id": "acb7d577-f43f-4ae5-9a99-4b7e746c7278",
        "text": "Бағдарламалау кезеңінде"
      },
      {
        "id": "545cdb11-a40a-4d79-a02a-2b3929fa76ec",
        "text": "SQL кодтарын жылдам орындау"
      },
      {
        "id": "cf899d3b-3fd0-449f-81e3-a5f1d07fca2b",
        "text": "Бір бағанға JSON форматында жазылады"
      },
      {
        "id": "1128e3a6-7d86-4294-b146-650b460a148f",
        "text": "Логикалық схеманы өзгертпей, индекстерді өзгерту мүмкіндігі"
      },
      {
        "id": "87ad320c-b8ab-4334-a04a-a778bc94825a",
        "text": "Метадеректерді, яғни кестелер, бағандар және шектеулер туралы сипаттамаларды сақтау үшін"
      }
    ],
    "correctOptionIds": [
      "c8177210-d85f-45b1-abbc-e3ef769353b5"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "7421543c-e309-41e9-a936-422d26da10e5",
    "subjectId": "db",
    "text": "Деректер қорын жобалаудағы нысан (Entity) деген не?",
    "options": [
      {
        "id": "0c4f5ae5-84bd-4e99-802d-2a4577a76df9",
        "text": "Пәндік саланың дербес өмір сүретін және ақпарат сақталатын объектісі немесе түсінігі"
      },
      {
        "id": "324dd3da-6fbd-4afc-a6b9-3d956d76804f",
        "text": "Кестедегі нақты бір жол"
      },
      {
        "id": "6e2c51de-b652-457e-a011-c1e06b871646",
        "text": "SQL сұранысының атауы"
      },
      {
        "id": "615c4c2b-0afb-4583-bf56-c6bd96a67829",
        "text": "Дерекқордың сақтық көшірмесі"
      },
      {
        "id": "1dba49a2-b218-42a5-b6d7-2423c1691fff",
        "text": "Телефондардың барлығы бір ұяшыққа үтір арқылы жазылады"
      },
      {
        "id": "c6ffc581-aa49-4d96-815b-d2cb9a1512a7",
        "text": "Аты-жөні бірегей емес (аттастар болуы мүмкін) және уақыт өте келе өзгеруі мүмкін"
      },
      {
        "id": "2b110911-c897-4d3a-a8ed-4d2139632096",
        "text": "Тәуелді жазбаларды да бірге жояды"
      },
      {
        "id": "577da5bd-969c-49e4-a94e-bccf691304e3",
        "text": "Атрибуттары өте аз кесте"
      }
    ],
    "correctOptionIds": [
      "0c4f5ae5-84bd-4e99-802d-2a4577a76df9"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "ba696c64-b8e9-4080-bef6-f848c40d9602",
    "subjectId": "db",
    "text": "Composite Attribute (құрама атрибут) дегеніміз не?",
    "options": [
      {
        "id": "788537fa-30ad-49ef-a47f-5c7531e7ffe8",
        "text": "Бірнеше қарапайым атрибуттарға бөлінетін атрибут (мысалы, Аты, Тегі, Әкесінің атынан тұратын Аты-жөні)"
      },
      {
        "id": "12de0ca2-da3e-49af-bb44-a3bb96b08d2e",
        "text": "Бірнеше мәнді бір уақытта сақтайтын атрибут"
      },
      {
        "id": "1a0d9e79-1f7b-4890-873c-589b99ae805b",
        "text": "Сыртқы кілт болып табылатын атрибут"
      },
      {
        "id": "200118b2-288f-45af-b6b9-3229902aa1cc",
        "text": "Басқа атрибуттардан есептелетін мән"
      },
      {
        "id": "1d2e11d8-78b9-4d9b-91d9-16bba745ca4a",
        "text": "Қос жиекті ромбпен"
      },
      {
        "id": "ba025911-b59f-4134-9bf9-f720346ff4ea",
        "text": "Деректердің артықшылығы артады және жаңарту кезінде деректердің сәйкессіздігі (inconsistency) туындау қаупі жоғарылайды"
      },
      {
        "id": "4e185792-3f2b-4956-851a-eec97b13cff4",
        "text": "Тек қана сандық типті баған"
      },
      {
        "id": "c791c90a-377a-4675-a8ef-258020ed241c",
        "text": "Архивтелген деректерді"
      }
    ],
    "correctOptionIds": [
      "788537fa-30ad-49ef-a47f-5c7531e7ffe8"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "7f1e3a13-8816-43cf-8c10-c3288f0dab80",
    "subjectId": "db",
    "text": "Derived Attribute (туынды атрибут) деген не?",
    "options": [
      {
        "id": "1a2e9a50-366c-4486-bbeb-ac655f48628a",
        "text": "Мәні басқа атрибуттар арқылы есептелетін қасиет (мысалы, туған жылдан есептелетін Жасы)"
      },
      {
        "id": "610f2a31-3952-40fd-963b-72ac2091df0d",
        "text": "Жаңадан қосылған баған"
      },
      {
        "id": "086f6109-679a-4800-a603-9cd6cbe468ad",
        "text": "Бастапқы кілттен туындаған сыртқы кілт"
      },
      {
        "id": "94e071f5-5ff2-4de2-8abc-9a46e8134ee6",
        "text": "Бірнеше кестеде қайталанатын баған"
      },
      {
        "id": "8cd6e650-3efd-420e-a394-831b8da6eefc",
        "text": "Пайдаланушыларға рұқсат деңгейлерін тағайындау"
      },
      {
        "id": "a1605b59-4b31-4614-a3e3-79792cade8dc",
        "text": "Тек индекс қойылса ғана сақталады"
      },
      {
        "id": "59daa8b7-0142-4cb7-a675-83302d641f43",
        "text": "Денормализация"
      },
      {
        "id": "c7e261e2-e6c9-4275-acb2-865dc3ac1d00",
        "text": "Баған мәнінің бос (NULL) болуына рұқсат беру немесе бермеу (NOT NULL) қасиеті"
      }
    ],
    "correctOptionIds": [
      "1a2e9a50-366c-4486-bbeb-ac655f48628a"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "cbc6cd56-ffbc-4662-b802-7cd1191da300",
    "subjectId": "db",
    "text": "Сілтемелік бүтіндікті (FK) бұзбай өшіруді басқару үшін ON DELETE SET DEFAULT не істейді?",
    "options": [
      {
        "id": "af12770b-5e80-4d00-99ec-897187b11d6a",
        "text": "Ата-аналық жазба жойылғанда FK бағанына оның әдепкі мәнін тағайындайды"
      },
      {
        "id": "7dc2f28e-f9a1-482d-a65f-b862edb895bd",
        "text": "Жазбаны өшіруге тыйым салады"
      },
      {
        "id": "c5f98a09-bb4e-444a-a8cb-31c560f0dc97",
        "text": "Тәуелді жазбаларды да бірге жояды"
      },
      {
        "id": "2cc7895d-0977-40da-acab-595333c1da7e",
        "text": "Сыртқы кілтке NULL қояды"
      },
      {
        "id": "0d0f459c-c97c-4460-930a-8965ac790ecf",
        "text": "Толық (Total/Mandatory) және ішінара (Partial/Optional)"
      },
      {
        "id": "282b1115-edff-4b43-b324-730acdefe1eb",
        "text": "Кестелер санын шексіз көбейту үшін"
      },
      {
        "id": "be73ea93-fd7f-421c-95d0-97c630da054c",
        "text": "Сұраныстар жылдамдығы тым қатты төмендейді"
      },
      {
        "id": "5262b9eb-d67d-4e00-a4eb-09cad859f9da",
        "text": "Парциалды кілт немесе Дискриминатор (Partial Key / Discriminator)"
      }
    ],
    "correctOptionIds": [
      "af12770b-5e80-4d00-99ec-897187b11d6a"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "106c9858-9349-4155-84e6-2316bd35ad6b",
    "subjectId": "db",
    "text": "Деректер қорын жобалаудағы Data Dictionary (Деректер сөздігі) не үшін қолданылады?",
    "options": [
      {
        "id": "c84940de-7b6c-41a0-b66d-9a65b1f30821",
        "text": "Метадеректерді, яғни кестелер, бағандар және шектеулер туралы сипаттамаларды сақтау үшін"
      },
      {
        "id": "f9495e34-2f79-4822-8efe-9fabfc3c44a4",
        "text": "Пайдаланушылардың парольдерін сақтау үшін"
      },
      {
        "id": "0c83bc89-cb40-4c42-afb5-3617c998bce9",
        "text": "SQL сұраныстарын тез орындау үшін"
      },
      {
        "id": "5b2ca2d6-9a45-4084-bd05-a1d5cfc24fb2",
        "text": "Дерекқордың резервтік көшірмесін жасау үшін"
      },
      {
        "id": "2ede9da8-89a1-4fa2-8336-30b06f902a9b",
        "text": "Болашақ дерекқорға қойылатын барлық функционалдық және ақпараттық талаптарды анықтау және жүйелеу"
      },
      {
        "id": "2d6d92ae-cc8a-43ce-9ce1-5093fb6f20ec",
        "text": "Деректердің физикалық файлдық орналасуын"
      },
      {
        "id": "c7f67575-679d-4fdc-83f3-cd278cad8361",
        "text": "Қою (Bold) қаріппен және жұлдызшамен"
      },
      {
        "id": "515ad7db-d141-4cf1-a11d-b6d3bb17c690",
        "text": "Тек бағдарламашылармен нақты SQL код деңгейінде"
      }
    ],
    "correctOptionIds": [
      "c84940de-7b6c-41a0-b66d-9a65b1f30821"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "88522f05-c38a-476b-83dc-afea852559d9",
    "subjectId": "db",
    "text": "Жобалаудағы Тернарлық байланыс (Ternary Relationship) деген не?",
    "options": [
      {
        "id": "349df4f1-7370-4ccb-84e3-ead8a43b873c",
        "text": "Бір уақытта үш нысан арасында орнатылатын байланыс"
      },
      {
        "id": "23d1f336-ee77-454d-b0da-e47719f63d4e",
        "text": "Үш кестені біріктіретін JOIN түрі"
      },
      {
        "id": "df225759-5b32-47f1-9a50-02284c405700",
        "text": "Кестеде тек үш сыртқы кілттің болуы"
      },
      {
        "id": "b1df186e-cddc-4d41-880f-b76060ae0133",
        "text": "Үш рет қайталанатын байланыс түрі"
      },
      {
        "id": "0955e2ee-112b-4283-9b6c-edb41531e284",
        "text": "Бастапқы және екіншілік кілттер жиынтығы"
      },
      {
        "id": "9d44a19c-ddf5-4353-b5df-0bd08adef0a8",
        "text": "Индекстің барын"
      },
      {
        "id": "690c297f-ffb4-4f68-a7e8-163ecd6823a3",
        "text": "Сервер әкімшілерімен аппараттық деңгейде"
      },
      {
        "id": "b279cc25-639a-4688-b704-8a85339a21c7",
        "text": "Байланыстың кардиналдық дәрежесін"
      }
    ],
    "correctOptionIds": [
      "349df4f1-7370-4ccb-84e3-ead8a43b873c"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "c7ed645b-f67e-43b8-844e-5d6e83befe8e",
    "subjectId": "db",
    "text": "Әлсіз нысан (Weak Entity) деген не?",
    "options": [
      {
        "id": "1ef90cb5-e093-4983-8ff2-2ea8943dd45b",
        "text": "Өздігінен бастапқы кілті жоқ және оның өмір сүруі басқа күшті (иелік етуші) нысанға тәуелді болатын нысан"
      },
      {
        "id": "4fdca053-a4e8-4945-857c-1bc9bf3727fd",
        "text": "Атрибуттары өте аз кесте"
      },
      {
        "id": "66573ca5-661c-419e-a0d8-901a7ff3a7f0",
        "text": "Индекстелмеген кез келген кесте"
      },
      {
        "id": "53e2f789-b7fa-41a4-b37d-3415ade71d45",
        "text": "Деректері жоқ бос кесте"
      },
      {
        "id": "9880d98d-c4bc-4bfb-b424-0c151240cdfa",
        "text": "Деректердің физикалық дискіде сақталу тәсілін"
      },
      {
        "id": "cc383c1c-9c6a-4eac-b1ad-cf15fca9a91e",
        "text": "Тек дерекқор іске қосылған кезде"
      },
      {
        "id": "fc9a784f-5646-4e5b-b471-69a50dd3c01c",
        "text": "Тек сұраныс орындалғанда (SELECT)"
      },
      {
        "id": "50708461-1867-46c4-9f27-92a426b39c0e",
        "text": "Қос жиекті ромбпен (Double Diamond)"
      }
    ],
    "correctOptionIds": [
      "1ef90cb5-e093-4983-8ff2-2ea8943dd45b"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "20c45af2-3b98-4226-9e4d-1da0c330b65e",
    "subjectId": "db",
    "text": "Әлсіз нысанның күшті нысанмен байланысы қалай аталады?",
    "options": [
      {
        "id": "e61082df-a699-42c7-ae30-edb8223029f8",
        "text": "Сәйкестендіруші немесе Идентификациялаушы байланыс (Identifying Relationship)"
      },
      {
        "id": "c997217e-acdb-4d3b-bd7c-1e9c2f3bf921",
        "text": "Тәуелсіз байланыс"
      },
      {
        "id": "c91bda92-bd9a-41ed-91b4-3fd8866e5722",
        "text": "Рекурсивті байланыс"
      },
      {
        "id": "16ae73d6-b20d-4f1f-891f-7838c7dc3aa2",
        "text": "Көптен-көпке байланыс"
      },
      {
        "id": "2b0a578b-ba09-4f65-b934-97df6a72f687",
        "text": "Деректерді сақтау форматтары, индекстеу стратегиялары, файлдық топтар және дискілік кеңістікті бөлу"
      },
      {
        "id": "caff4ee1-7755-41b7-8622-e6dafc5e3486",
        "text": "Виртуалды көріністер (Views) арқылы"
      },
      {
        "id": "f9931c8a-f7f1-4bda-9223-0542ebdc682e",
        "text": "Тұжырымдамалық модельді нақты деректер құрылымына (кестелерге, схемаларға) түрлендіру"
      },
      {
        "id": "1f587770-ed1a-409d-99e3-3a3b5051c190",
        "text": "Жадты үнемдеу"
      }
    ],
    "correctOptionIds": [
      "e61082df-a699-42c7-ae30-edb8223029f8"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "c4de1f7c-14bf-4b99-8f4a-b86dc4d28ed7",
    "subjectId": "db",
    "text": "Әлсіз нысанда оның жазбаларын күшті нысанның кілтімен бірге бірегей ету үшін қолданылатын атрибут қалай аталады?",
    "options": [
      {
        "id": "73a2fb6a-eb97-421e-a864-32a970c8b544",
        "text": "Парциалды кілт немесе Дискриминатор (Partial Key / Discriminator)"
      },
      {
        "id": "d8c7f0af-c0c7-4a12-b7b3-1cc391df23d4",
        "text": "Суррогаттық кілт"
      },
      {
        "id": "5d695003-c795-47ce-b34e-39659617766a",
        "text": "Сыртқы кілт"
      },
      {
        "id": "f399a9f1-1b9d-4dbb-9860-f1b3e0088f3f",
        "text": "Суперкілт"
      },
      {
        "id": "05f32d35-8608-43dc-870c-17ea7528e4fd",
        "text": "GRANT SELECT ON table_name TO role_name"
      },
      {
        "id": "99eff012-3723-4b84-9c2e-3771c8611116",
        "text": "Кестелерді 3NF-ке келтіру"
      },
      {
        "id": "61ec52ba-56d6-4655-b99a-04476e60690f",
        "text": "SQL CREATE TABLE сценарийлері"
      },
      {
        "id": "d4dc7198-7701-4451-8bf1-f04898590d67",
        "text": "Дерекқордың орындалу уақытын тексереді"
      }
    ],
    "correctOptionIds": [
      "73a2fb6a-eb97-421e-a864-32a970c8b544"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "12c25e7f-5dc8-4ba2-b9bb-1980a05a7b9c",
    "subjectId": "db",
    "text": "ER-диаграммада әлсіз нысан қандай графикалық белгімен көрсетіледі?",
    "options": [
      {
        "id": "9cea44f1-8277-4f9b-aa3a-93957620d8a1",
        "text": "Қос жиекті тіктөртбұрышпен (Double Rectangle)"
      },
      {
        "id": "c16159f4-4508-4689-ba33-78c1d8f75432",
        "text": "Қос жиекті ромбпен (Double Diamond)"
      },
      {
        "id": "68520d75-98e5-4ec6-bf1a-5bb6869ae8ae",
        "text": "Штрихталған сопақшамен"
      },
      {
        "id": "def56042-1ff6-4740-94de-8f0b973b7308",
        "text": "Тік сызықпен"
      },
      {
        "id": "b5391592-2fc9-4d3a-ae5d-5a97601dd94c",
        "text": "Деректерді бірнеше серверге көшіру арқылы олардың қолжетімділігін және сенімділігін (fault tolerance) арттыру үшін"
      },
      {
        "id": "467881b0-c317-4635-96e9-a3984355bc56",
        "text": "Бір (One / 1) қатынасын"
      },
      {
        "id": "e5d0b727-1bf1-4bae-a42d-fc70cc945fa8",
        "text": "Пайдаланушы интерфейсін құрады"
      },
      {
        "id": "8af23ae9-0b9b-48d5-9839-d3a82fee7a6e",
        "text": "Кестелер арасындағы байланысты оңтайландыру"
      }
    ],
    "correctOptionIds": [
      "9cea44f1-8277-4f9b-aa3a-93957620d8a1"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "e7424835-3d28-4932-b5a7-c9c7b4964c15",
    "subjectId": "db",
    "text": "ER-диаграммада идентификациялаушы байланыс қандай белгімен көрсетіледі?",
    "options": [
      {
        "id": "6f424207-e4a2-4efd-b5c7-f452f7efacfc",
        "text": "Қос жиекті ромбпен (Double Diamond)"
      },
      {
        "id": "481cc00e-8f7c-4141-96f0-ea5081d7e7c5",
        "text": "Қос жиекті тіктөртбұрышпен"
      },
      {
        "id": "b008fed2-16d9-4730-ab7f-9cc924cfa833",
        "text": "Үшбұрышпен"
      },
      {
        "id": "5356801a-9a7a-460e-87f4-8fe48023b3c7",
        "text": "Сопақшамен"
      },
      {
        "id": "b114d4fd-1429-4ccd-a443-493158eece48",
        "text": "Бьерн Страуструп"
      },
      {
        "id": "bd4f43a1-7147-4259-9e94-30d3a5e46542",
        "text": "Кестелер санын шексіз көбейту үшін"
      },
      {
        "id": "a0eb4e22-46e1-46fa-ada6-da24e9936aae",
        "text": "Жалпы дерекқордың логикалық схемасын"
      },
      {
        "id": "91551b6d-cf79-4744-88aa-633c22f13c94",
        "text": "Сыртқы кілт"
      }
    ],
    "correctOptionIds": [
      "6f424207-e4a2-4efd-b5c7-f452f7efacfc"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "99e84601-49c0-4bb0-876d-728037d19c9b",
    "subjectId": "db",
    "text": "Нысанның байланысқа қатысу дәрежесі (Participation Constraint) қандай екі түрге бөлінеді?",
    "options": [
      {
        "id": "657648e0-9f31-4600-8430-787d528ae1e0",
        "text": "Толық (Total/Mandatory) және ішінара (Partial/Optional)"
      },
      {
        "id": "b0f9f445-84ee-4947-841c-fdcace2a38a9",
        "text": "Сызықтық және бейсызықтық"
      },
      {
        "id": "835c24d4-e5fd-4e24-b28f-0c412b784243",
        "text": "Бастапқы және екіншілік"
      },
      {
        "id": "809854b0-e59d-474d-ab56-33278072dd31",
        "text": "Ішкі және сыртқы"
      },
      {
        "id": "dbedd8ce-90d2-42ee-8a5f-8d61c00352f9",
        "text": "Итальялық (Italic) қаріппен"
      },
      {
        "id": "f66488e9-c0c2-46f7-b6ac-59aee61de41d",
        "text": "Индекстелмеген кез келген кесте"
      },
      {
        "id": "d0033413-763e-4c40-8c1a-73977e3b8038",
        "text": "Қос жиекті тіктөртбұрышпен"
      },
      {
        "id": "bddc8a93-a4cb-464e-b8a3-657337add8ef",
        "text": "Кестедегі үлкен және кіші жолдар"
      }
    ],
    "correctOptionIds": [
      "657648e0-9f31-4600-8430-787d528ae1e0"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "7aae5344-35fe-4cf3-a3af-fbb01ba670ff",
    "subjectId": "db",
    "text": "Талаптарды талдау кезеңінің басты мақсаты не?",
    "options": [
      {
        "id": "bcb8ebed-95c3-4eda-9c10-4cbd077f6d06",
        "text": "Болашақ дерекқорға қойылатын барлық функционалдық және ақпараттық талаптарды анықтау және жүйелеу"
      },
      {
        "id": "69c269b8-fb28-40bb-9125-b534e6478c6a",
        "text": "SQL кодтарын жылдам орындау"
      },
      {
        "id": "c18dc627-1a36-4d76-8a1c-541cdfbe62e2",
        "text": "Кестелерге деректер енгізу"
      },
      {
        "id": "7e0e646c-c5de-412c-ac87-4890f51c5048",
        "text": "ДҚБЖ өнімін таңдап орнату"
      },
      {
        "id": "8377932a-e1e8-41be-b0f6-1011ea57edd0",
        "text": "SQL сұраныстарын жазу"
      },
      {
        "id": "b6ea3a7c-fe13-4c8f-9b48-681f5c564dc8",
        "text": "Дерекқордың физикалық файлы"
      },
      {
        "id": "cbe083c6-6351-437c-9dfc-f0ab59098338",
        "text": "Пайдаланушыға негізгі кестенің тек рұқсат етілген бағандары мен жолдарын көрсетіп, құпия деректерді жасыру"
      },
      {
        "id": "0a298ef1-ddca-4618-bf85-026b8e33be2f",
        "text": "Аралық байланыстырушы кесте арқылы жүзеге асады"
      }
    ],
    "correctOptionIds": [
      "bcb8ebed-95c3-4eda-9c10-4cbd077f6d06"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "3069dac1-b50c-4624-a076-c10df6eae4c4",
    "subjectId": "db",
    "text": "Концептуалды модельді реляциялық модельге көшіргенде (mapping) нысан (Entity) неге айналады?",
    "options": [
      {
        "id": "c35721cb-1a5f-40bd-8aa8-034bcbcc2763",
        "text": "Кестеге (Relation / Table)"
      },
      {
        "id": "b2a689b9-e870-44cb-b3e8-d48cd6d7cf75",
        "text": "Бағанға (Attribute / Column)"
      },
      {
        "id": "1d24a358-fa1b-45e0-93e1-e4ede817a5cd",
        "text": "Жолға (Tuple / Row)"
      },
      {
        "id": "c6d7529d-86f7-40c4-94be-63f153d1b5ca",
        "text": "Сыртқы кілтке (Foreign Key)"
      },
      {
        "id": "c4d8763b-eb44-49ff-8ee3-10f07a6aad1b",
        "text": "Джеймс Франклин"
      },
      {
        "id": "717b004f-9994-4525-a652-d04d0f5c7314",
        "text": "Бірнеше кестеде қайталанатын баған"
      },
      {
        "id": "c3eb7406-7f4a-49d4-8ee9-c70a11927c5a",
        "text": "Физикалық файлдар құрылымы"
      },
      {
        "id": "6bb4a758-836c-4c39-9777-b6819b9cf896",
        "text": "Дерекқордың логикалық тұтастығын"
      }
    ],
    "correctOptionIds": [
      "c35721cb-1a5f-40bd-8aa8-034bcbcc2763"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "aecca623-8e2b-4ecf-b883-b71df316a898",
    "subjectId": "db",
    "text": "Composite Attribute (құрама атрибут) реляциялық кестеде қалай бейнеленеді?",
    "options": [
      {
        "id": "73ae13dc-0595-4938-87a6-ff42f6bc8d30",
        "text": "Оны құрайтын әрбір қарапайым атрибут жеке баған ретінде жазылады"
      },
      {
        "id": "ab2608c9-e27d-4403-8a86-58b64c3fe764",
        "text": "Бір бағанға JSON форматында жазылады"
      },
      {
        "id": "ce26fcd1-7d46-4757-8386-564035d64343",
        "text": "Мүлдем өшіріледі"
      },
      {
        "id": "f46a5837-a4b0-4d58-b79e-33df2d536d26",
        "text": "Жеке кесте ретінде бөлінеді"
      },
      {
        "id": "e8861317-e103-4ae0-be45-f970ee50d2dc",
        "text": "Тек триггерлер мен процедуралар арқылы"
      },
      {
        "id": "f411f4fe-1d46-4c3c-9df7-01c0792d4c8d",
        "text": "Ол тек SQL Server-де жұмыс істейді"
      },
      {
        "id": "f34fe55d-6e13-4036-8883-cadaea49a23c",
        "text": "Индекстер (кластерленген және кластерленбеген)"
      },
      {
        "id": "39b2e525-7be5-4002-8140-5147b64f8594",
        "text": "Домен (Domain)"
      }
    ],
    "correctOptionIds": [
      "73ae13dc-0595-4938-87a6-ff42f6bc8d30"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "8102b540-2b83-44f7-8ddb-cec87e421f57",
    "subjectId": "db",
    "text": "Multi-valued Attribute (көпмәнді атрибут) реляциялық модельге қалай көшіріледі?",
    "options": [
      {
        "id": "48fd0b84-e9cd-487c-8d31-c28190c5f930",
        "text": "Ол үшін жеке жаңа кесте құрылып, сыртқы кілт арқылы байланыстырылады"
      },
      {
        "id": "26714cf5-da3e-43b9-afb5-d3ba3fa86a50",
        "text": "Бір ұяшыққа үтір арқылы жазылады"
      },
      {
        "id": "6f6f568a-9e28-407b-8cd2-d71f7de262a5",
        "text": "Ол тек бастапқы кілт болады"
      },
      {
        "id": "d8781925-2d10-4209-8a55-790e1dc64651",
        "text": "Мәтіндік баған болып қала береді"
      },
      {
        "id": "30d45b69-a039-41c0-956b-2aecd5c7990f",
        "text": "Кестеге жаңа индекстер қосу"
      },
      {
        "id": "b98ac537-5c96-426b-98b4-345fe5d9d1b6",
        "text": "Жадты үнемдеу"
      },
      {
        "id": "e6278534-10ba-4c29-a5ae-93274c52bd7b",
        "text": "Қалыпты формалар (Normal Forms)"
      },
      {
        "id": "b8e687ad-5c9b-4374-b34f-7b89222c93f5",
        "text": "Оны құрайтын әрбір қарапайым атрибут жеке баған ретінде жазылады"
      }
    ],
    "correctOptionIds": [
      "48fd0b84-e9cd-487c-8d31-c28190c5f930"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "188aa6f7-ad26-4e53-baff-a1ce4451dc43",
    "subjectId": "db",
    "text": "Derived Attribute (туынды атрибут) әдетте дерекқор кестесінде сақталады ма?",
    "options": [
      {
        "id": "b6a694ca-ef63-423c-b071-9f8d07950370",
        "text": "Жоқ, ол орын үнемдеу үшін сақталмайды, сұраныс кезінде есептеледі"
      },
      {
        "id": "041802f3-e602-4381-b595-a84d4a713388",
        "text": "Иә, әрқашан міндетті түрде сақталады"
      },
      {
        "id": "380acdb6-a0ce-4f86-89f2-39f3a3fd6277",
        "text": "Тек сандық типті болса ғана сақталады"
      },
      {
        "id": "5f01df69-376b-4601-8d84-74e0e347cfb0",
        "text": "Тек индекс қойылса ғана сақталады"
      },
      {
        "id": "ecc31082-35e4-489f-af63-bc03ed201ea3",
        "text": "Схема (Schema)"
      },
      {
        "id": "1e9efb02-1414-45a4-a7fd-05ce59d40794",
        "text": "Тұтастық шектеулерін жою үшін"
      },
      {
        "id": "f91eb3dd-35cc-4c0a-b808-857af8cadb86",
        "text": "Кестенің толығымен жойылу мүмкіндігі"
      },
      {
        "id": "b0f7645f-fcec-4725-9afa-962cc56fcb0f",
        "text": "Концептуалды жобалау кезеңінде"
      }
    ],
    "correctOptionIds": [
      "b6a694ca-ef63-423c-b071-9f8d07950370"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "bccedf0e-680b-48e0-89e2-d7c4008207a1",
    "subjectId": "db",
    "text": "Реляциялық кестедегі бағандардың мүмкін мәндер жиынтығы қалай аталады?",
    "options": [
      {
        "id": "3d4e5451-da07-4318-a277-02f07127648c",
        "text": "Домен (Domain)"
      },
      {
        "id": "455f51c9-0384-494d-abcd-79600fbd5c06",
        "text": "Кортеж (Tuple)"
      },
      {
        "id": "f4acda86-6d7d-4f0f-9790-31b2c0713d52",
        "text": "Схема (Schema)"
      },
      {
        "id": "dc6be138-72ab-4c21-9167-46f2fc6b4467",
        "text": "Атрибут (Attribute)"
      },
      {
        "id": "d1bd13bb-4e85-4012-955f-c7ec8aebcfda",
        "text": "Тек индекс қойылса ғана сақталады"
      },
      {
        "id": "40514594-fbff-4b4b-a3aa-96fbfc3e4025",
        "text": "Индекстер көмегімен"
      },
      {
        "id": "2be75f56-023a-44c4-b187-d753808a7129",
        "text": "DENY UPDATE ON table_name TO user_name"
      },
      {
        "id": "7e363a45-71dd-44db-b258-3dbf940e704d",
        "text": "Бастапқы кілттен туындаған сыртқы кілт"
      }
    ],
    "correctOptionIds": [
      "3d4e5451-da07-4318-a277-02f07127648c"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "4eb5aa53-e428-448f-b442-95edc531047d",
    "subjectId": "db",
    "text": "Деректер қорын жобалауда нысан атрибутының доменін (Domain) анықтау не үшін қажет?",
    "options": [
      {
        "id": "6c9de4b9-f22d-49b0-960a-78b0be8aa58d",
        "text": "Бағанға тек рұқсат етілген типтегі және диапазондық мәндердің енуін бақылау (тұтастық үшін)"
      },
      {
        "id": "f0cbe391-81a1-462b-aa8f-b8daf08d2af0",
        "text": "Жолдардың санын арттыру үшін"
      },
      {
        "id": "1ca14fb6-238c-4950-b859-2b8aa19bae2d",
        "text": "Кестені тез өшіру үшін"
      },
      {
        "id": "f0e35aec-28a6-4128-ac53-72b799251b89",
        "text": "Бастапқы кілтті автоматты түрде тағайындау үшін"
      },
      {
        "id": "e193e155-4a66-4002-ad5f-ad05b965bd08",
        "text": "Оқу сұраныстарының жылдамдығын арттыру (өнімділікті жақсарту)"
      },
      {
        "id": "ddfa4700-8f05-4979-8d31-ff94eecacf41",
        "text": "Кестелердің нормализациялану деңгейін"
      },
      {
        "id": "8bf84cfd-a71b-4a83-bbb5-3458036ca838",
        "text": "Бастапқы кілттерді өшіру"
      },
      {
        "id": "aa8211fd-f684-485e-87e4-e9b2906d0a64",
        "text": "Қос жиекті тіктөртбұрышпен (Double Rectangle)"
      }
    ],
    "correctOptionIds": [
      "6c9de4b9-f22d-49b0-960a-78b0be8aa58d"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "33e7dd37-c039-4b2e-b73c-cc6552044b6b",
    "subjectId": "db",
    "text": "Сілтемелік тұтастық (Referential Integrity) қай кезде бұзылуы мүмкін?",
    "options": [
      {
        "id": "eabd1e1c-325d-4b5d-9fd8-1a19a381fc36",
        "text": "Сыртқы кілт мәні байланыстырылған кестедегі бастапқы кілттің ешбір мәніне сәйкес келмегенде"
      },
      {
        "id": "585ab417-5abd-49c3-8f34-6690bcf07dec",
        "text": "Бастапқы кілтте қайталанатын мәндер болғанда"
      },
      {
        "id": "823a2e7e-0903-4763-98cb-23cde8928e71",
        "text": "Кестеде бос ұяшықтар (NULL) көбейгенде"
      },
      {
        "id": "12a44b35-093c-4b86-9bc7-114a498398e2",
        "text": "Сұраныста JOIN дұрыс жазылмағанда"
      },
      {
        "id": "63f09ea8-b4fd-4d6d-88af-141a1b11a579",
        "text": "Жаңа сыртқы кілттер"
      },
      {
        "id": "4ec1327f-0e55-4be7-a4ee-37a614f3f2ac",
        "text": "Екі кестенің бағандары бірдей болуы тиіс"
      },
      {
        "id": "9cb5868b-81f1-42a4-b17a-45b3b1570933",
        "text": "Бірнеше мәнді бір уақытта сақтайтын атрибут"
      },
      {
        "id": "489a941b-683c-4347-94ee-38b0cd2c80c7",
        "text": "Тек сыртқы кілттерді басқару үшін"
      }
    ],
    "correctOptionIds": [
      "eabd1e1c-325d-4b5d-9fd8-1a19a381fc36"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "92dc24ee-58a0-4347-a67f-3fa6f75684c4",
    "subjectId": "db",
    "text": "Денормализацияны қолданудың кері әсері (кемшілігі) қандай?",
    "options": [
      {
        "id": "7c540d4b-5f91-46fb-a405-256cb89f9903",
        "text": "Деректердің артықшылығы артады және жаңарту кезінде деректердің сәйкессіздігі (inconsistency) туындау қаупі жоғарылайды"
      },
      {
        "id": "5e3df3f9-b7f9-4f16-8ec0-8e9ad1bb1bed",
        "text": "Сұраныстар жылдамдығы тым қатты төмендейді"
      },
      {
        "id": "5c37505c-48ec-4f92-86fe-b205f08d961e",
        "text": "Кестелер саны тым азайып кетеді"
      },
      {
        "id": "52e826e4-f3a9-48c4-9c51-cbca96d9dfda",
        "text": "Индекстер жұмысы тоқтайды"
      },
      {
        "id": "cefcd41c-d05f-49d4-a63d-c80893bdaa77",
        "text": "Оның деректер типі сандық емес"
      },
      {
        "id": "b043a343-3e15-492c-82e5-55e4ed6939db",
        "text": "Сервер жадын сатып алу"
      },
      {
        "id": "70740acb-79c3-4cc0-a05e-0a738881137d",
        "text": "Бірнеше бағанның бірігуінен құралған бастапқы кілт"
      },
      {
        "id": "00ac9bad-cf5f-4d34-a6bd-21b5eadeb4ac",
        "text": "DENY UPDATE ON table_name TO user_name"
      }
    ],
    "correctOptionIds": [
      "7c540d4b-5f91-46fb-a405-256cb89f9903"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "453e7d0d-0403-4a86-bfee-50afefe496e0",
    "subjectId": "db",
    "text": "Деректер қорын секциялау (Partitioning) деген не?",
    "options": [
      {
        "id": "a4e8c2ae-0d27-4af2-8802-4656516416dc",
        "text": "Үлкен кестелерді өнімділікті арттыру үшін дискіде кішігірім логикалық немесе физикалық бөліктерге бөлу"
      },
      {
        "id": "f1ec5490-f5b9-46a6-8bb9-714b446b4622",
        "text": "Кестені толық жойып, қайта құру"
      },
      {
        "id": "427bd557-496e-44d8-939c-7b77d03dd72e",
        "text": "Пайдаланушыларға рұқсат деңгейлерін тағайындау"
      },
      {
        "id": "d0dbdce3-264b-4e9f-8a02-408d09a1bf81",
        "text": "Деректерді басқа серверге көшіру"
      },
      {
        "id": "200717cc-c5ca-49aa-b2ed-3e07b416866d",
        "text": "Бірнеше кестеде қайталанатын баған"
      },
      {
        "id": "e570fdd4-17ef-4929-ae1d-ff396fce14c2",
        "text": "Кестені тез өшіру үшін"
      },
      {
        "id": "143fbb02-6612-4d74-a0e4-5ea13096f9c5",
        "text": "Бір кестенің бастапқы кілті екінші кестеде сыртқы кілт (FK) әрі бірегей (UNIQUE) болып табылады"
      },
      {
        "id": "8f25129b-2e31-4850-aa9f-d8cfcacc2041",
        "text": "Деректер туралы деректерді (кестелер құрылымы, типтері, шектеулері)"
      }
    ],
    "correctOptionIds": [
      "a4e8c2ae-0d27-4af2-8802-4656516416dc"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "35eaf6a5-c909-4846-91a1-05c8c2c1b5b3",
    "subjectId": "db",
    "text": "Көлденең секциялау (Horizontal Partitioning) деген не?",
    "options": [
      {
        "id": "2d06cf7b-1fc1-4f32-a1eb-6726c858a75f",
        "text": "Кесте жолдарын белгілі бір шарт бойынша (мысалы, датасы немесе ID-і бойынша) бөлек файлдарға бөлу"
      },
      {
        "id": "95a84ebe-100e-48cd-9005-bde36281378c",
        "text": "Кесте бағандарын бөлек кестелерге бөлу"
      },
      {
        "id": "282c43c6-405b-4992-b1cb-725c30cf66cb",
        "text": "Деректерді тек қана сұрыптау"
      },
      {
        "id": "c8b55e38-72d5-41ba-af60-5c3ae0871a7c",
        "text": "Кестеге жаңа индекстер қосу"
      },
      {
        "id": "6328f86b-5f8d-43f6-97e9-94ecc870ceb1",
        "text": "Жеке жаңа кесте құрылып, оған телефон нөмірлері жол ретінде жазылады және сыртқы кілтпен байланыстырылады"
      },
      {
        "id": "bfd128b9-c013-436a-a1cb-26774ccbaf14",
        "text": "Бір уақытта үш нысан арасында орнатылатын байланыс"
      },
      {
        "id": "2c68e699-fac7-47da-876e-a059bb949320",
        "text": "Кестедегі нақты бір жол"
      },
      {
        "id": "5b006afd-029d-429e-880c-693c652d6db6",
        "text": "Индекстер көмегімен"
      }
    ],
    "correctOptionIds": [
      "2d06cf7b-1fc1-4f32-a1eb-6726c858a75f"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "69aea8ba-0ef3-4bcb-b0c8-bb0135047948",
    "subjectId": "db",
    "text": "Тік секциялау (Vertical Partitioning) деген не?",
    "options": [
      {
        "id": "666638d4-f126-419e-9d3a-7a2f0202315f",
        "text": "Кесте бағандарын (мысалы, сирек қолданылатын немесе үлкен бағандарды) бөлек кестелерге бөлу"
      },
      {
        "id": "51b41303-7046-45db-84d3-f88c3a753980",
        "text": "Кесте жолдарын диапазон бойынша бөлу"
      },
      {
        "id": "2f5d53b0-8d83-4678-831c-d67bf127c1db",
        "text": "Дерекқордың логикалық схемасын өшіру"
      },
      {
        "id": "790dd987-4df5-4a7f-8061-c7691ec8af48",
        "text": "Бастапқы кілтті суррогаттық кілтпен алмастыру"
      },
      {
        "id": "65dd3d38-eb0b-4073-9afe-2a78df6e7a6d",
        "text": "Бір уақытта үш нысан арасында орнатылатын байланыс"
      },
      {
        "id": "994356bf-2648-4f40-bd0c-8f5c6dcce5c3",
        "text": "GRANT READ ON table_name TO role_name"
      },
      {
        "id": "ea548898-2eab-472a-81a3-3e07acd49b03",
        "text": "Программалық интерфейс"
      },
      {
        "id": "9ab84b48-21b9-40a5-b773-9b45e6d56e3c",
        "text": "Ол сыртқы кілтпен байланыса алмайды"
      }
    ],
    "correctOptionIds": [
      "666638d4-f126-419e-9d3a-7a2f0202315f"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "1a03c692-e221-49cc-82df-22e51670c961",
    "subjectId": "db",
    "text": "Деректер қорын репликациялау (Replication) не үшін қолданылады?",
    "options": [
      {
        "id": "fe319dea-14a5-46f4-b8f0-c8cad8726a0e",
        "text": "Деректерді бірнеше серверге көшіру арқылы олардың қолжетімділігін және сенімділігін (fault tolerance) арттыру үшін"
      },
      {
        "id": "efdf7dcd-f196-4ff3-8dcb-07c02fc303ee",
        "text": "Деректердің қалыпты формаларын тексеру үшін"
      },
      {
        "id": "399f2501-cbb3-4449-8126-1d10bb9efc5a",
        "text": "Кесте құрылымын автоматты түрде өзгерту үшін"
      },
      {
        "id": "8e923d3f-9b08-42e8-aa38-8fcd4b3407f0",
        "text": "SQL сұраныстарын автоматты форматтау үшін"
      },
      {
        "id": "8dabbcf0-3605-4bb3-9073-082010e5616b",
        "text": "Деректердің қауіпсіздік деңгейі"
      },
      {
        "id": "81c82c61-4e83-4cbe-aa8e-b8409c228380",
        "text": "Импорттау"
      },
      {
        "id": "b1157f05-cdb3-4aaa-8cf7-d55cd6d5d78a",
        "text": "Иә, әрқашан міндетті түрде сақталады"
      },
      {
        "id": "3195ced1-d044-4944-ad67-f67e798ab986",
        "text": "Үш рет қайталанатын байланыс түрі"
      }
    ],
    "correctOptionIds": [
      "fe319dea-14a5-46f4-b8f0-c8cad8726a0e"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "734ebc8a-0bc8-44d7-941c-5a3805d8340c",
    "subjectId": "db",
    "text": "Дистрибьюцияланған (үлестірілген) деректер қорын жобалаудағы фрагментация деген не?",
    "options": [
      {
        "id": "0074c9c7-0878-48fe-a0c7-66f3cb7654ab",
        "text": "Деректерді желідегі әртүрлі түйіндерде орналастыру үшін бөліктерге бөлу процесі"
      },
      {
        "id": "bc3dfa09-7fbf-4600-875a-1c3ee7a1f60d",
        "text": "Деректердің жоғалуы салдарынан бүлінуі"
      },
      {
        "id": "ae77efb9-c656-4f5c-bd83-77f6366db2ad",
        "text": "Индекстердің ескіру процесі"
      },
      {
        "id": "c82cb480-cdd0-484c-b622-ed864d9e5b70",
        "text": "Дерекқор файлдарын сығымдау"
      },
      {
        "id": "0355b226-4019-4e1f-9695-bfb93e21a6ca",
        "text": "Деректерді сақтау форматтары, индекстеу стратегиялары, файлдық топтар және дискілік кеңістікті бөлу"
      },
      {
        "id": "14d4e413-5969-46ab-9a4a-d894d93bfc71",
        "text": "Тұтынушы интерфейсі деңгейінде"
      },
      {
        "id": "08b32486-c696-49f2-b031-b8489b50efa3",
        "text": "Ол нақты ДҚБЖ бағдарламасына (Oracle, PostgreSQL, т.б.) және физикалық сақтау тәсіліне мүлдем тәуелсіз болады"
      },
      {
        "id": "33f60e99-eabd-4e18-ad75-39bac339cece",
        "text": "Ол кестедегі жолдар санын шектейді"
      }
    ],
    "correctOptionIds": [
      "0074c9c7-0878-48fe-a0c7-66f3cb7654ab"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "a801c225-1d78-4607-b1df-e1cc37d9316f",
    "subjectId": "db",
    "text": "Деректер қорында рөлдерді (Roles) жобалаудың басты мақсаты не?",
    "options": [
      {
        "id": "7b095caf-ef07-4f37-b50d-555cb80f1daf",
        "text": "Қауіпсіздікті қамтамасыз ету үшін пайдаланушылар тобына құқықтарды оңай басқару"
      },
      {
        "id": "f8ac37fa-b140-4269-b1a3-a66965248564",
        "text": "Сұраныстар орындалу жылдамдығын арттыру"
      },
      {
        "id": "b8b248e7-a705-4c18-97de-16288a305bc0",
        "text": "Кестелер арасындағы байланысты оңтайландыру"
      },
      {
        "id": "59d3c829-6ac3-483d-a48f-1919a8296cb3",
        "text": "Бизнес логикасын бағдарламалау"
      },
      {
        "id": "4412c0e4-15ee-4b4a-863c-50ad49e0d216",
        "text": "Транзакциялардың сәтсіз аяқталу мүмкіндігі"
      },
      {
        "id": "d05a6c4a-73e0-46ba-b83e-5d42d78b7267",
        "text": "Бірнеше кестеде қайталанатын баған"
      },
      {
        "id": "3c81bfa9-5f85-466c-8f3a-8c8f1b0ad21d",
        "text": "Екі кестені біріктіріп бір кесте жасау арқылы"
      },
      {
        "id": "6cf0877e-5708-46fc-a37e-2700395a5611",
        "text": "Кестеге телефон1, телефон2, телефон3 деп бірнеше баған қосылады"
      }
    ],
    "correctOptionIds": [
      "7b095caf-ef07-4f37-b50d-555cb80f1daf"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "bddeeb9b-8692-4ded-a6dd-4aa783f61fcd",
    "subjectId": "db",
    "text": "Рөлге (Role) белгілі бір кестені оқу құқығын беру үшін қандай SQL сұранысы қолданылады?",
    "options": [
      {
        "id": "1b69a26b-9fbf-4b09-906a-2a4a15d18b27",
        "text": "GRANT SELECT ON table_name TO role_name"
      },
      {
        "id": "78b0bc65-679c-4498-ad58-ec750f542718",
        "text": "PERMIT SELECT ON table_name TO role_name"
      },
      {
        "id": "7214392c-924e-4665-8bf5-b16a585135aa",
        "text": "GRANT READ ON table_name TO role_name"
      },
      {
        "id": "b9072304-846a-4497-bafb-babd5f334c94",
        "text": "ALLOW SELECT TO role_name"
      },
      {
        "id": "6526ac27-1309-4178-9874-beb2d18f8f71",
        "text": "Деректердің жоғалуы салдарынан бүлінуі"
      },
      {
        "id": "2c468e2c-2bb0-4823-b93b-28c57787b4b3",
        "text": "Талаптарды жинау кезеңінде"
      },
      {
        "id": "90e8cf4e-44db-4c97-8989-c08242aaa113",
        "text": "Иә, әрқашан міндетті түрде сақталады"
      },
      {
        "id": "34e3ee13-5a5f-47cf-8b71-62266dd53a09",
        "text": "Олардың арасында ешқандай кілт арқылы байланыс орнатылмайды"
      }
    ],
    "correctOptionIds": [
      "1b69a26b-9fbf-4b09-906a-2a4a15d18b27"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "d10f06f6-93cb-47d7-b69f-f64a92081379",
    "subjectId": "db",
    "text": "Пайдаланушыдан кестені жаңарту құқығын кері қайтару командасы қандай?",
    "options": [
      {
        "id": "3d00827f-f4c4-4705-a7ce-321b6eb559b7",
        "text": "REVOKE UPDATE ON table_name FROM user_name"
      },
      {
        "id": "056dc5ce-f515-49ad-8edb-fb6cffe52345",
        "text": "REMOVE UPDATE ON table_name FROM user_name"
      },
      {
        "id": "3e0f4921-becf-4c54-9b63-9eaa4d23f6a1",
        "text": "DENY UPDATE ON table_name TO user_name"
      },
      {
        "id": "f4bcb9da-9bb8-4538-ad9b-a66cb5b81c88",
        "text": "DELETE PERMISSION UPDATE"
      },
      {
        "id": "7fa796b1-3648-45b0-906b-7bfda4e62290",
        "text": "Қолданбаларды өзгертпей, кесте құрылымын өзгерту мүмкіндігі"
      },
      {
        "id": "806d1e8f-bce0-4345-9045-441b18f2a08c",
        "text": "Аралық байланыстырушы кесте (junction table) құру және оған екі кестенің бастапқы кілттерін сыртқы кілт ретінде қосу арқылы"
      },
      {
        "id": "250168a5-5590-4e87-90b8-e56c2bacbfc6",
        "text": "SQL сервердің жадын баптау"
      },
      {
        "id": "46409f33-5ffb-4657-9b67-f3e6cda548ab",
        "text": "Логикалық немесе концептуалды деңгейді өзгертпей, деректердің дискіде сақталу тәсілін немесе индекстерін өзгерте алу мүмкіндігі"
      }
    ],
    "correctOptionIds": [
      "3d00827f-f4c4-4705-a7ce-321b6eb559b7"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "8c5bd586-9553-432d-aab0-d6d97b3c85f4",
    "subjectId": "db",
    "text": "Деректер қорын жобалауда Виртуалды кестелердің (Views) қауіпсіздік үшін рөлі қандай?",
    "options": [
      {
        "id": "4efa8b8d-962c-41b5-b2f2-a514baf4f896",
        "text": "Пайдаланушыға негізгі кестенің тек рұқсат етілген бағандары мен жолдарын көрсетіп, құпия деректерді жасыру"
      },
      {
        "id": "23d5064a-b5fc-4a10-b9a2-acf167f95568",
        "text": "Кестедегі жазбаларды шифрлау"
      },
      {
        "id": "a7228147-d861-4d53-ba7c-4924c5fc3533",
        "text": "Сыртқы кілттерді автоматты түрде өшіру"
      },
      {
        "id": "b3000431-019b-45eb-ab8b-451a00a57a83",
        "text": "Деректерді басқа серверге автоматты түрде көшіру"
      },
      {
        "id": "6b0b9ea9-9069-4561-be90-3cb2a8ae7550",
        "text": "Дерекқордың физикалық өлшемін"
      },
      {
        "id": "68d2049b-adc5-4ae7-b138-15c215611bf4",
        "text": "ER диаграммасын құру"
      },
      {
        "id": "7de2f421-fdcc-491f-84f0-758dc1c817d5",
        "text": "Иә, әрқашан міндетті түрде сақталады"
      },
      {
        "id": "019ddbf7-530d-4b6d-94f8-191eae0886ba",
        "text": "Экспорттау"
      }
    ],
    "correctOptionIds": [
      "4efa8b8d-962c-41b5-b2f2-a514baf4f896"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "2710a7e7-c632-4da0-989c-a53869b32d07",
    "subjectId": "db",
    "text": "ER-диаграммада біріншілік кілт (Primary Key) қалай белгіленеді?",
    "options": [
      {
        "id": "aa8cbf65-9409-47ab-8b96-863096bece6c",
        "text": "Асты сызылған мәтінмен (Underline)"
      },
      {
        "id": "670da8ba-3873-4a3a-9129-15a6d33178c1",
        "text": "Қою (Bold) қаріппен және жұлдызшамен"
      },
      {
        "id": "8b59734f-7ddb-47c2-8158-010c260ffb9b",
        "text": "Итальялық (Italic) қаріппен"
      },
      {
        "id": "26e0282f-de2c-40dc-b7f2-a1a20913800d",
        "text": "Көк түспен"
      },
      {
        "id": "c19f802b-944c-4d58-ac5b-557b295adfc5",
        "text": "SQL сұраныстар деңгейінде"
      },
      {
        "id": "d0ba7b54-c158-4473-a37c-0bfefde4e4f3",
        "text": "REVOKE UPDATE ON table_name FROM user_name"
      },
      {
        "id": "ff801684-e7e3-4682-b10a-8da8bf9628c5",
        "text": "Телефондардың барлығы бір ұяшыққа үтір арқылы жазылады"
      },
      {
        "id": "693bc1aa-bf12-4069-ada7-06c17aef0f56",
        "text": "Концептуалды ER-модельді нақты бір деректер моделіне (мысалы, реляциялық схемаға) сәйкестендіру және қалыпқа келтіру (нормализация)"
      }
    ],
    "correctOptionIds": [
      "aa8cbf65-9409-47ab-8b96-863096bece6c"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "1008d046-8798-447a-a31d-d4021b03e2ed",
    "subjectId": "db",
    "text": "ER-диаграммада көпмәнді атрибут қандай графикалық белгімен көрсетіледі?",
    "options": [
      {
        "id": "d8d661a6-a26e-4474-9bce-6ba7eb62b514",
        "text": "Қос жиекті сопақшамен (Double Oval)"
      },
      {
        "id": "ef4e283f-7d7f-4d4f-9a03-6851039854cd",
        "text": "Қос жиекті ромбпен"
      },
      {
        "id": "0a2c75f5-b543-4d9d-8971-c92f823f946b",
        "text": "Штрихталған сопақшамен"
      },
      {
        "id": "983d4e4c-0a19-4f47-8373-66693094cefb",
        "text": "Қос жиекті тіктөртбұрышпен"
      },
      {
        "id": "dcd3b41f-365b-4427-bb40-df77f2e3f5c6",
        "text": "Нысандардың (Entity) өзара байланыстары"
      },
      {
        "id": "58a6fe10-f8c2-4b47-93b5-fcfad02b5636",
        "text": "REVOKE UPDATE ON table_name FROM user_name"
      },
      {
        "id": "b9b9925f-5a98-4e20-8658-8f31589cc8c6",
        "text": "Питер Чен (Peter Chen)"
      },
      {
        "id": "2c969a47-2422-4bca-b6c3-9e1d504c6d6f",
        "text": "Бір ұяшыққа үтір арқылы жазылады"
      }
    ],
    "correctOptionIds": [
      "d8d661a6-a26e-4474-9bce-6ba7eb62b514"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "cd3b9b28-c1f9-4b33-ab86-10cec51866e6",
    "subjectId": "db",
    "text": "ER-диаграммада туынды атрибут (derived attribute) қандай графикалық белгімен көрсетіледі?",
    "options": [
      {
        "id": "114cb4b1-d028-4923-bb84-cc330db14a82",
        "text": "Штрихталған (пунктирлік) сопақшамен (Dashed Oval)"
      },
      {
        "id": "7b62b6fa-92d0-4872-a81d-96bf8bf0538d",
        "text": "Қос жиекті сопақшамен"
      },
      {
        "id": "15092f72-a553-46c0-8973-452193b8fac2",
        "text": "Тіктөртбұрышпен"
      },
      {
        "id": "6a5298d8-a055-4f7b-9adc-8d91e321a77a",
        "text": "Ромбпен"
      },
      {
        "id": "071e1720-eb9a-424d-8369-5d3a1be00d39",
        "text": "Дерекқордың желіге қосылу міндеттілігін"
      },
      {
        "id": "433e2565-4fff-4f63-a35d-d9088172617a",
        "text": "ER-диаграммалар негізінде автоматты түрде SQL CREATE TABLE кодтарын (DDL) генерациялайды"
      },
      {
        "id": "2f146742-3d6f-4473-b062-437d9275adbc",
        "text": "Кестелердің нормализациялануы"
      },
      {
        "id": "b0373459-3264-4d8a-8731-4c47dcc0eea8",
        "text": "Кесте құрылымын автоматты түрде өзгерту үшін"
      }
    ],
    "correctOptionIds": [
      "114cb4b1-d028-4923-bb84-cc330db14a82"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "4e4f8125-c0f8-415b-98d7-5ef90f9ad8fe",
    "subjectId": "db",
    "text": "CASE (Computer-Aided Software Engineering) құралдары дерекқорды жобалауда не істейді?",
    "options": [
      {
        "id": "c1c27d84-7681-44d5-b72e-3253e919be86",
        "text": "ER-диаграммалар негізінде автоматты түрде SQL CREATE TABLE кодтарын (DDL) генерациялайды"
      },
      {
        "id": "2108cde1-6141-4447-aee7-5f9c4a2b0b41",
        "text": "Дерекқордың орындалу уақытын тексереді"
      },
      {
        "id": "05369e6f-94bd-46d7-a607-1c2dba6984be",
        "text": "Деректерді автоматты түрде толтырады"
      },
      {
        "id": "75fc09f5-8ff3-4298-a895-07f8d52c5665",
        "text": "Пайдаланушы интерфейсін құрады"
      },
      {
        "id": "76cd07d4-0b3f-4e97-afba-50dc8b15e363",
        "text": "1:1, 1:M және M:N байланыстары"
      },
      {
        "id": "6d1e40a3-c4a8-421c-97f3-41c1f2a411ba",
        "text": "Тек триггерлер мен процедуралар арқылы"
      },
      {
        "id": "270d31d6-6b18-4a41-b449-515d509c5397",
        "text": "Кестелерге деректер енгізу"
      },
      {
        "id": "f4af21ea-5854-4cc1-a4e9-700869049773",
        "text": "Суррогаттық кілттерді өзгерту мүмкіндігі"
      }
    ],
    "correctOptionIds": [
      "c1c27d84-7681-44d5-b72e-3253e919be86"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "8a6aec1b-92b1-4c8d-b9b9-da79e86b26da",
    "subjectId": "db",
    "text": "Дерекқор схемасын нақты ДҚБЖ-дан ER-диаграммаға кері айналдыру процесі қалай аталады?",
    "options": [
      {
        "id": "f08b2a0b-dd5e-4c0c-9cb6-f3717edb6541",
        "text": "Кері инженерия (Reverse Engineering)"
      },
      {
        "id": "78cb451c-fdec-4e17-9247-5453d7802ca0",
        "text": "Тура инженерия (Forward Engineering)"
      },
      {
        "id": "62afe632-d6d4-4386-8bac-a856104a9984",
        "text": "Рефакторинг"
      },
      {
        "id": "6eae692f-da1c-4726-93a7-6bb7c53d4f9d",
        "text": "Денормализация"
      },
      {
        "id": "b26fb2d2-a7b4-410e-b300-0071308361f6",
        "text": "Бір бағанға JSON форматында жазылады"
      },
      {
        "id": "15a22257-29fe-4cfa-a52c-b1bf883b1481",
        "text": "Кестеде бос ұяшықтар (NULL) көбейгенде"
      },
      {
        "id": "683f04d5-c426-420b-8654-af66687f580b",
        "text": "Ол өте баяу сұрыпталады"
      },
      {
        "id": "e0249130-a270-4fb6-9a31-eae8e655b781",
        "text": "Бастапқы кілтті суррогаттық кілтпен алмастыру"
      }
    ],
    "correctOptionIds": [
      "f08b2a0b-dd5e-4c0c-9cb6-f3717edb6541"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "71e4aac8-b025-4b39-9946-740c25e1f0de",
    "subjectId": "db",
    "text": "ER-диаграмма негізінде ДҚБЖ үшін физикалық схема құру процесі қалай аталады?",
    "options": [
      {
        "id": "33965032-088c-40bf-84a2-39a005de87ad",
        "text": "Тура инженерия (Forward Engineering)"
      },
      {
        "id": "5050a710-8c70-4b56-bda2-6ad923113dec",
        "text": "Кері инженерия (Reverse Engineering)"
      },
      {
        "id": "01dbea8e-eae0-4833-9acb-249cc749d634",
        "text": "Импорттау"
      },
      {
        "id": "285e0bad-69f0-47cb-8168-3829113dd281",
        "text": "Экспорттау"
      },
      {
        "id": "97c06466-8be8-48fe-ac5c-ad5b0c227ade",
        "text": "Сыртқы кілтке NULL қояды"
      },
      {
        "id": "5db8bf95-1284-404b-88bf-95e2ee7ef937",
        "text": "Пәндік сала мамандарымен бірге бизнес-талаптар негізінде ДҚБЖ-ға тәуелсіз жоғары деңгейде"
      },
      {
        "id": "990d7f7d-b1e7-4c0b-aded-6a1ee8fd766e",
        "text": "Ол кестені денормализациялайды"
      },
      {
        "id": "81c1d1dc-98b7-4606-a329-0ae3e786cfa4",
        "text": "REMOVE UPDATE ON table_name FROM user_name"
      }
    ],
    "correctOptionIds": [
      "33965032-088c-40bf-84a2-39a005de87ad"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "055a0995-59e7-45db-883f-cdf614dc3ad2",
    "subjectId": "db",
    "text": "Үш деңгейлі ANSI-SPARC архитектурасында сыртқы деңгей (external level) нені сипаттайды?",
    "options": [
      {
        "id": "97b18337-9e0d-479b-ab31-5b9a83115136",
        "text": "Жеке пайдаланушылар мен қолданбалардың деректерді көру деңгейін (көріністер, views)"
      },
      {
        "id": "76055929-74bd-47d0-8843-aeac7096f8c4",
        "text": "Деректердің физикалық файлдық орналасуын"
      },
      {
        "id": "1d906816-0dca-4ef4-b027-717f7376ac69",
        "text": "Жалпы дерекқордың логикалық схемасын"
      },
      {
        "id": "1c030a10-f23e-47a3-9c28-4264855fee99",
        "text": "Деректерді басқару серверін"
      },
      {
        "id": "cbca6dfa-f6eb-4363-99d2-401274e3e559",
        "text": "Екі кестенің бірігуі"
      },
      {
        "id": "5217b6e8-d974-4886-87d8-5d24cdfeda94",
        "text": "Схема (Schema)"
      },
      {
        "id": "d80ae96a-48f3-4c4b-86de-20819b336c20",
        "text": "Виртуалды көріністер (Views) арқылы"
      },
      {
        "id": "37d0f5da-9831-412d-ba1d-57d998da92a5",
        "text": "Концептуалды -> Физикалық -> Логикалық"
      }
    ],
    "correctOptionIds": [
      "97b18337-9e0d-479b-ab31-5b9a83115136"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "c798fd20-c482-43eb-947a-7e79d5c8cbb8",
    "subjectId": "db",
    "text": "Үш деңгейлі ANSI-SPARC архитектурасында концептуалды деңгей (conceptual level) нені сипаттайды?",
    "options": [
      {
        "id": "04c33a3c-b142-4a76-bfb7-731515d3c5ac",
        "text": "Жалпы дерекқордың логикалық құрылымын, нысандар мен олардың байланыстарын"
      },
      {
        "id": "28a2e5f6-97f2-4667-9a13-bff0dbc2373b",
        "text": "Деректердің физикалық дискіде сақталу тәсілін"
      },
      {
        "id": "7db13070-0db4-49a3-9cb4-1b0b64b93b25",
        "text": "Пайдаланушының сыртқы көріністерін"
      },
      {
        "id": "881474ed-7778-476f-9e4c-c4619a6c9c3a",
        "text": "SQL сұраныстарының орындалу жоспарын"
      },
      {
        "id": "31d5de82-004f-4903-88c2-4bc81fc16fa1",
        "text": "Жоқ, ол орын үнемдеу үшін сақталмайды, сұраныс кезінде есептеледі"
      },
      {
        "id": "d857a2a7-6339-430d-a683-24af84d7e61f",
        "text": "Кесте бағандарын (мысалы, сирек қолданылатын немесе үлкен бағандарды) бөлек кестелерге бөлу"
      },
      {
        "id": "d1b4eb3a-f04f-4278-bb85-f3f5dcc222a6",
        "text": "Міндетті (Mandatory) қатысуды"
      },
      {
        "id": "a8e24a46-539c-45e9-95ab-9904087ea978",
        "text": "Индекстерді азайту"
      }
    ],
    "correctOptionIds": [
      "04c33a3c-b142-4a76-bfb7-731515d3c5ac"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "df475cf9-5aec-49f4-9220-f7965b55b782",
    "subjectId": "db",
    "text": "Үш деңгейлі ANSI-SPARC architecture-да ішкі деңгей (internal level) нені сипаттайды?",
    "options": [
      {
        "id": "57a724e9-e26a-47b7-8cb0-778d37ef5817",
        "text": "Деректердің дискіде қалай сақталатынын, индекстер мен файлдар құрылымын (физикалық деңгей)"
      },
      {
        "id": "00cf9273-54e7-4b4f-a665-1c3f794cc6f3",
        "text": "Пайдаланушының деректерді қабылдау ережелерін"
      },
      {
        "id": "7037a06f-bb3a-403b-af4f-55ea6326cbd6",
        "text": "ER-диаграмманың құрылымын"
      },
      {
        "id": "3c168aea-a1aa-49f5-9eb7-363c3d5fc318",
        "text": "Дерекқордың логикалық тұтастығын"
      },
      {
        "id": "b69ef6fa-f980-44ff-bac5-4f83526c8e69",
        "text": "Физикалық жобалау кезеңінде"
      },
      {
        "id": "0a307304-6ec7-4d38-8ac0-027fce43c63d",
        "text": "Ол үшін жеке жаңа кесте құрылып, сыртқы кілт арқылы байланыстырылады"
      },
      {
        "id": "4852b8dd-bce5-4867-b11e-a0f2c6ba19ae",
        "text": "Кестені тез өшіру үшін"
      },
      {
        "id": "edaa31ab-7079-49b5-8d9b-5a857365c584",
        "text": "Концептуалды жобалау"
      }
    ],
    "correctOptionIds": [
      "57a724e9-e26a-47b7-8cb0-778d37ef5817"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "ba08e2d9-255c-4393-ab67-7291e2cd4388",
    "subjectId": "db",
    "text": "Логикалық деректер тәуелсіздігі (Logical Data Independence) деген не?",
    "options": [
      {
        "id": "41d321fe-709f-40a0-8676-c9cc6dd4582a",
        "text": "Сыртқы деңгейдегі қолданбаларды өзгертпей, концептуалды деңгейдегі схеманы өзгерте алу мүмкіндігі"
      },
      {
        "id": "fb78806e-648c-4f79-a0a4-a98b20ad1a33",
        "text": "Логикалық схеманы өзгертпей, индекстерді өзгерту мүмкіндігі"
      },
      {
        "id": "adf0c25a-1b3b-4b6d-b27b-a4441398900e",
        "text": "Сұраныстардың басқа кестеге тәуелсіз орындалуы"
      },
      {
        "id": "52057632-fd3e-4614-a3db-e9f574135893",
        "text": "Дерекқордағы транзакциялардың оқшаулануы"
      },
      {
        "id": "11c5892c-2374-4dd8-bd18-64f38d57d197",
        "text": "ER-диаграммасы (нысандар мен байланыстар моделі)"
      },
      {
        "id": "6d64ad68-4ea9-4eaf-94f9-a2b8f34e0078",
        "text": "Нақты SQL кестелерінің скрипттері"
      },
      {
        "id": "8fe60657-157a-497b-87b9-c1a83f7c9a43",
        "text": "Дерекқордың физикалық өлшемін"
      },
      {
        "id": "e9480c6c-9a45-47ae-8be6-b58c2cb50558",
        "text": "Аты-жөні бірегей емес (аттастар болуы мүмкін) және уақыт өте келе өзгеруі мүмкін"
      }
    ],
    "correctOptionIds": [
      "41d321fe-709f-40a0-8676-c9cc6dd4582a"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "a007be77-b841-414a-91f3-cfc8c9a846d0",
    "subjectId": "db",
    "text": "Физикалық деректер тәуелсіздігі (Physical Data Independence) деген не?",
    "options": [
      {
        "id": "3f563db3-e3e5-436d-bfff-2c356ef45557",
        "text": "Логикалық немесе концептуалды деңгейді өзгертпей, деректердің дискіде сақталу тәсілін немесе индекстерін өзгерте алу мүмкіндігі"
      },
      {
        "id": "8692bc32-002e-47f9-96f9-72a3c9faf4ed",
        "text": "Қолданбаларды өзгертпей, кесте құрылымын өзгерту мүмкіндігі"
      },
      {
        "id": "95286907-f8e2-4e56-83ac-bda7490fc1ad",
        "text": "Дерекқордың желілік қосылымына тәуелсіз болуы"
      },
      {
        "id": "62d0788d-00fb-4604-8d0e-bdc64f34301b",
        "text": "Суррогаттық кілттерді өзгерту мүмкіндігі"
      },
      {
        "id": "6987c11a-b5ae-4bc1-b07c-b6be815b2f37",
        "text": "SQL сұраныстарының тарихын"
      },
      {
        "id": "42014e85-aa0d-4c85-b730-841b07606881",
        "text": "Қос жиекті тіктөртбұрышпен (Double Rectangle)"
      },
      {
        "id": "272fc98d-d84e-48b6-a4eb-acf86476ff6b",
        "text": "Ол өте баяу сұрыпталады"
      },
      {
        "id": "de46a44b-7eee-40e0-b156-447d91a6084d",
        "text": "Рекурсивті байланыс"
      }
    ],
    "correctOptionIds": [
      "3f563db3-e3e5-436d-bfff-2c356ef45557"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "fcc84ba5-1fff-42a2-a68d-f4af11b292af",
    "subjectId": "db",
    "text": "Реляциялық деректер моделінің авторы кім?",
    "options": [
      {
        "id": "f58f882e-ac11-46ae-8c34-4a79ee4121d6",
        "text": "Эдгар Кодд (Edgar Codd)"
      },
      {
        "id": "0021e948-9a64-4f3a-add5-111f1acbd5f4",
        "text": "Питер Чен"
      },
      {
        "id": "fe0a5c0b-b8b0-4707-bc96-95ca05bbb0d2",
        "text": "Джеймс Франклин"
      },
      {
        "id": "77f985ac-0b04-4bd3-837c-e9efe82f1282",
        "text": "Бьерн Страуструп"
      },
      {
        "id": "c75b45b3-9b79-4e43-bedd-a8316e9ff86e",
        "text": "ДҚБЖ өнімін таңдап орнату"
      },
      {
        "id": "3f481364-f4f8-4ff8-b8e1-2fd2a3ad0791",
        "text": "Бастапқы кілтте қайталанатын мәндер болғанда"
      },
      {
        "id": "44cab703-93d2-4169-84be-10315a7c2904",
        "text": "Индекстелмеген кез келген кесте"
      },
      {
        "id": "6e2d1139-be91-44e6-804a-b0bba519b5fa",
        "text": "Нысандардың байланыс түртерін анықтау"
      }
    ],
    "correctOptionIds": [
      "f58f882e-ac11-46ae-8c34-4a79ee4121d6"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "b85d34b5-014c-4e69-871a-fc85d74802b6",
    "subjectId": "db",
    "text": "Бизнес ережелерін (Business Rules) дерекқор деңгейінде декларативті түрде қалай жүзеге асыруға болады?",
    "options": [
      {
        "id": "395e1057-1702-4ce8-91e7-375513691081",
        "text": "Constraints (UNIQUE, CHECK, NOT NULL, FK) шектеулері арқылы"
      },
      {
        "id": "bd6039d3-ca4e-48c4-9832-ba660c093124",
        "text": "Тек триггерлер мен процедуралар арқылы"
      },
      {
        "id": "f4f673c1-c6b8-4e9d-8390-107c1bfb30ee",
        "text": "Қолданбаның Java немесе Python коды арқылы"
      },
      {
        "id": "3fbd519f-8bb0-4c97-b459-20c7998bd481",
        "text": "Индекстерді құру арқылы"
      },
      {
        "id": "d7f05a1c-1660-4c05-8c05-cdbfb8d883cc",
        "text": "Дерекқордың логикалық тұтастығын"
      },
      {
        "id": "a280b4b8-c3c3-430b-b558-84fb4950ee92",
        "text": "Кестелерді 3NF-ке келтіру"
      },
      {
        "id": "190f639e-8651-4557-97ed-8d4183cb3ee3",
        "text": "Логикалық жобалау (Logical design)"
      },
      {
        "id": "5ffffd2a-d164-4d23-a6ac-04b2da1307a2",
        "text": "Жиі орындалатын SQL кодтарын дерекқор серверінде сақтап, жылдам орындау және қауіпсіздікті арттыру үшін"
      }
    ],
    "correctOptionIds": [
      "395e1057-1702-4ce8-91e7-375513691081"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "02a70d12-dcca-48ee-963a-03dcf0fe04d4",
    "subjectId": "db",
    "text": "Бизнес ережелерін дерекқор деңгейінде процедуралық түрде қалай жүзеге асыруға болады?",
    "options": [
      {
        "id": "9cb11083-648a-4ed6-a305-19a5702850f3",
        "text": "Triggers (триггерлер) және Stored Procedures (сақталатын процедуралар) арқылы"
      },
      {
        "id": "7bf33247-7fe8-451a-8503-848c5960f385",
        "text": "UNIQUE және CHECK шектеулері арқылы"
      },
      {
        "id": "d6bd8659-f333-4762-9ceb-1bd0981a53a2",
        "text": "Кесте бағандарын өшіру арқылы"
      },
      {
        "id": "6d8c20d5-eb16-4c98-9dd5-757b529e9651",
        "text": "Виртуалды көріністер (Views) арқылы"
      },
      {
        "id": "3e9b6042-6185-4c50-84ff-5cd6c3ba6344",
        "text": "Дерекқордан тәуелсіз ER-модель (диаграмма)"
      },
      {
        "id": "d91141db-347f-4767-9266-b9bda9540d94",
        "text": "Үш рет қайталанатын байланыс түрі"
      },
      {
        "id": "9b1482f2-4895-4204-8179-bf3fab18f80e",
        "text": "Концептуалды жобалау кезеңінде"
      },
      {
        "id": "b06b765a-530d-4b66-9d66-520596290a6a",
        "text": "Деректерді басқа серверге көшіру"
      }
    ],
    "correctOptionIds": [
      "9cb11083-648a-4ed6-a305-19a5702850f3"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "7901d244-4ec2-47b0-aebb-4ca47c642483",
    "subjectId": "db",
    "text": "Триггер (Trigger) деген не?",
    "options": [
      {
        "id": "b3c17414-dd45-4885-835b-0d45c8e57584",
        "text": "Кестеде белгілі бір оқиға (INSERT, UPDATE, DELETE) болғанда автоматты түрде орындалатын бағдарламалық код блогы"
      },
      {
        "id": "45eb21e4-1486-4e65-9d01-640e131eeff6",
        "text": "Бастапқы кілттің басқа атауы"
      },
      {
        "id": "03c5fcf4-6b0b-4474-b401-671f15561ef0",
        "text": "Сұраныстың орындалу жылдамдығын өлшейтін құрал"
      },
      {
        "id": "b3cecdc6-d601-4bae-96ee-b1c484dd3a5d",
        "text": "Дерекқордың физикалық файлы"
      },
      {
        "id": "33a88c90-a34d-493e-89a5-d347266d3aaf",
        "text": "Талаптарды жинау кезеңінде"
      },
      {
        "id": "688493ca-8a6e-4912-8d72-5b2ca80deac1",
        "text": "GRANT READ ON table_name TO role_name"
      },
      {
        "id": "592e14d2-b13a-4810-85ea-0599f533d11d",
        "text": "Онда тек сандық деректер сипатталады"
      },
      {
        "id": "90ff0c72-4390-48db-b3ec-e250a4581f31",
        "text": "Аралық кесте құру арқылы ғана"
      }
    ],
    "correctOptionIds": [
      "b3c17414-dd45-4885-835b-0d45c8e57584"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "ec2e2f42-c34e-452f-8135-d21382c8c2a7",
    "subjectId": "db",
    "text": "Stored Procedure (сақталатын процедура) дерекқорда не үшін қолданылады?",
    "options": [
      {
        "id": "4327ba8a-cd0c-4a1b-b4bd-32b489cf368b",
        "text": "Жиі орындалатын SQL кодтарын дерекқор серверінде сақтап, жылдам орындау және қауіпсіздікті арттыру үшін"
      },
      {
        "id": "75e2c2ed-e628-4ea4-be19-9600ec3b04eb",
        "text": "Кестедегі деректерді автоматты түрде өшіру үшін"
      },
      {
        "id": "13337298-aca3-4ee0-bea5-9f7a6afab5c2",
        "text": "Тек сыртқы кілттерді басқару үшін"
      },
      {
        "id": "b51459f5-0011-40e1-a71f-ed9feceac2bb",
        "text": "Деректерді репликациялау үшін"
      },
      {
        "id": "8be9e2dc-bfbd-48d0-b26c-d177f4ac618c",
        "text": "Мәннің тек автоинкрементті болуы"
      },
      {
        "id": "24a90403-89d3-4437-81f9-6cb7df98ae35",
        "text": "Тек қана сандық типті баған"
      },
      {
        "id": "32bbdc97-1311-40be-b32f-87bcc0b9dbda",
        "text": "Кестеге жаңа индекстер қосу"
      },
      {
        "id": "4838fd22-ab8b-4fe4-bf97-0e913266f8b7",
        "text": "Физикалық жобалау кезеңінде"
      }
    ],
    "correctOptionIds": [
      "4327ba8a-cd0c-4a1b-b4bd-32b489cf368b"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "36c87666-cee4-4f99-a6a1-e742f5888ea1",
    "subjectId": "db",
    "text": "Деректер қорында триггерлерді шамадан тыс көп қолданудың негізгі кемшілігі қандай?",
    "options": [
      {
        "id": "49dafee2-9e11-4218-a874-1523446d372f",
        "text": "Сұраныстардың орындалу жылдамдығын төмендетеді және дерекқор логикасын күрделендіреді"
      },
      {
        "id": "db2b247e-a191-40a5-a67f-27d2b8071d80",
        "text": "Дерекқордың өлшемін тым үлкейтіп жібереді"
      },
      {
        "id": "dbf544f4-c022-4431-9ca7-0d824dc3f49a",
        "text": "Бастапқы кілттерді жойып жібереді"
      },
      {
        "id": "f5aea528-9ed3-4f21-8e7f-c8ddf2573616",
        "text": "Индекстерді қолдануға тыйым салады"
      },
      {
        "id": "7c5df27b-ef55-4072-b42d-25b49c0abfea",
        "text": "Мәннің өзгермейтіндігі (stability) және бірегейлігі (uniqueness)"
      },
      {
        "id": "2125f68a-ca65-4cf2-97fb-0afced6a5e23",
        "text": "Бастапқы кілттен туындаған сыртқы кілт"
      },
      {
        "id": "008a4be8-de57-4026-bbb7-f9012d9b5cee",
        "text": "Деректер туралы деректерді (кестелер құрылымы, типтері, шектеулері)"
      },
      {
        "id": "97086fb5-8d2e-4bc2-8dbd-97f3d2d23ef6",
        "text": "Деректердің қалыпты формаларын тексеру үшін"
      }
    ],
    "correctOptionIds": [
      "49dafee2-9e11-4218-a874-1523446d372f"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "294972db-6051-413e-9dae-58275844d5aa",
    "subjectId": "db",
    "text": "Суррогаттық кілт (Surrogate Key) деген не?",
    "options": [
      {
        "id": "62d5fddc-0f08-45ae-8705-160fc15cb5e7",
        "text": "Бизнес мағынасы жоқ, жүйе тарапынан тек жазбаны бірегей сәйкестендіру үшін автоматты түрде генерацияланатын сандық кілт (мысалы, автоинкрементті ID)"
      },
      {
        "id": "c3c6d8a9-8ac7-4c26-ab51-32a4fe4d9423",
        "text": "Басқа кестедегі бастапқы кілттің көшірмесі"
      },
      {
        "id": "ebc040c3-8d3c-423f-b7ee-c85ccdc1888b",
        "text": "Бірнеше бағанның бірігуінен құралған кілт"
      },
      {
        "id": "b8bdc85a-bf1c-4c8e-9df3-85c0b177efe7",
        "text": "Адамның төлқұжат нөмірі немесе ЖСН сияқты кілт"
      },
      {
        "id": "bdb5ab2c-901b-4afd-b423-547f7ee89438",
        "text": "Бірнеше кестеде қайталанатын баған"
      },
      {
        "id": "ebc487b6-f927-42df-ae1b-6dbfebb18b80",
        "text": "Ата-аналық жазба жойылғанда FK бағанына оның әдепкі мәнін тағайындайды"
      },
      {
        "id": "da47001f-0cbc-49f3-91cf-94cc2f7122bb",
        "text": "SQL сұраныстарын жазу"
      },
      {
        "id": "84eaaf18-fcf7-449e-9bab-29d531ed4c72",
        "text": "Тек индекс қойылса ғана сақталады"
      }
    ],
    "correctOptionIds": [
      "62d5fddc-0f08-45ae-8705-160fc15cb5e7"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "46de7886-986a-4116-9100-eab828ef7531",
    "subjectId": "db",
    "text": "Суррогаттық кілттің табиғи кілттен (Natural Key) басты артықшылығы неде?",
    "options": [
      {
        "id": "c4b0cd45-625b-42fa-bfc4-6284a08f2f94",
        "text": "Ол әрқашан тұрақты (өзгермейді) және деректер типі қарапайым (бүтін сан), сондықтан индекстер жылдам жұмыс істейді"
      },
      {
        "id": "d272e17a-07ca-4e65-8803-29fd43a56749",
        "text": "Оның нақты бизнес мағынасы бар"
      },
      {
        "id": "1bd8d39e-cf5e-4de3-8b46-ab2867cf5871",
        "text": "Ол ешқашан жадыдан орын алмайды"
      },
      {
        "id": "2bb07415-4cc6-409f-a760-7a5a27ae9513",
        "text": "Ол сыртқы кілттермен байланысты талап етпейді"
      },
      {
        "id": "0a243ac9-477c-4a95-b0ac-7ccf81b7e8ed",
        "text": "Атрибут (Attribute)"
      },
      {
        "id": "36cd446f-7ba1-4059-84e6-eedc8ed90d4d",
        "text": "Кестеге жаңа индекстер қосу"
      },
      {
        "id": "36682f19-48f7-4995-83c0-80edd53a138e",
        "text": "Индекстер құру, деректерді секциялау (partitioning) және буфер көлемін баптау"
      },
      {
        "id": "fdf6371d-20a0-4288-a1ad-922d4ee33aae",
        "text": "Қолданушы интерфейсін жобалау"
      }
    ],
    "correctOptionIds": [
      "c4b0cd45-625b-42fa-bfc4-6284a08f2f94"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "b6f7ff94-389f-42df-b843-cec40b2d5765",
    "subjectId": "db",
    "text": "Суррогаттық кілттің кемшілігі неде?",
    "options": [
      {
        "id": "2a00b828-a94a-41c2-929c-2a3128dd240a",
        "text": "Оның бизнес мағынасы жоқ, сондықтан пайдаланушы үшін қосымша бірегейлік тексерулерін (мысалы, ЖСН-ге UNIQUE қою) талап етеді"
      },
      {
        "id": "14faf07d-44cb-4e05-a175-27c5c74c6d8d",
        "text": "Ол өте баяу сұрыпталады"
      },
      {
        "id": "2b0d9038-7e1f-49d9-87f9-528c8d4d2724",
        "text": "Ол тек мәтіндік деректерді сақтай алады"
      },
      {
        "id": "6b3abc17-635c-4aef-aa42-25c4faf74027",
        "text": "Ол кестені денормализациялайды"
      },
      {
        "id": "593de9b5-3c2a-4d44-a763-89319aa8c78d",
        "text": "Сервердегі жедел жадтың жетіспеуінен"
      },
      {
        "id": "a453bdc0-96d7-4f6d-8c4c-c04591328cf6",
        "text": "Жоқ, ол орын үнемдеу үшін сақталмайды, сұраныс кезінде есептеледі"
      },
      {
        "id": "77b2826f-87f2-49f2-ac9e-bb3739de16c6",
        "text": "Дискідегі файлдарды орналастыру"
      },
      {
        "id": "2b31f79a-5a6a-4129-a095-a0623163ebae",
        "text": "Кестеге жаңа индекстер қосу"
      }
    ],
    "correctOptionIds": [
      "2a00b828-a94a-41c2-929c-2a3128dd240a"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "7a49dbd7-8cd0-4dd2-a99a-9995ffd9239f",
    "subjectId": "db",
    "text": "Деректер қорын жобалауда нысандар мен қасиеттерді жинау үшін алғашқы қадам не болып табылады?",
    "options": [
      {
        "id": "82c485b0-847d-4a7c-a6e9-4887dc78b862",
        "text": "Қолданушы талаптары мен құжаттамаларды зерттеу (Requirements gathering)"
      },
      {
        "id": "de214941-94bc-4b8f-8ae7-00da5dd72f6c",
        "text": "SQL сұраныстарын жазу"
      },
      {
        "id": "ae395594-a24b-4c88-b418-1c2d94b69329",
        "text": "Сервер жадын сатып алу"
      },
      {
        "id": "c2058d5a-5148-4188-9dcb-841a54811508",
        "text": "Кестелерге деректер енгізу"
      },
      {
        "id": "8f708075-eb7b-433f-9de2-d9c7ded93146",
        "text": "Логикалық модель ДҚБЖ-ға мүлдем тәуелді емес"
      },
      {
        "id": "2e3cffa4-99d1-47e5-b336-b9dad805d7e1",
        "text": "SQL Server-де жад көлемін таңдау"
      },
      {
        "id": "afa30b25-985a-4f2c-815e-dd10ba7fdfae",
        "text": "Деректерді репликациялау үшін"
      },
      {
        "id": "8d0b5b86-7d94-4f51-8a60-d245f8464a19",
        "text": "Кестеге телефон1, телефон2, телефон3 деп бірнеше баған қосылады"
      }
    ],
    "correctOptionIds": [
      "82c485b0-847d-4a7c-a6e9-4887dc78b862"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "21010900-028d-4469-a56f-e0ccfb9ff35a",
    "subjectId": "db",
    "text": "Нысанның супертипі мен субтипі (Supertype/Subtype) деген не?",
    "options": [
      {
        "id": "a868fb3f-0548-4f06-a695-a510d280c556",
        "text": "Ортақ қасиеттері бар жалпы нысан (супертип) және оның ерекше қасиеттері бар бөлімдері (субтип) (мысалы, Пайдаланушы -> Студент, Оқытушы)"
      },
      {
        "id": "8f7e4733-507b-4bfd-ab5e-3fcd42dc5023",
        "text": "Екі кестенің бірігуі"
      },
      {
        "id": "aba0acb7-0d67-428d-ae7d-c7d33ce542d6",
        "text": "Бастапқы және екіншілік кілттер жиынтығы"
      },
      {
        "id": "31fb1a8a-457d-43a6-bbe2-99e955994524",
        "text": "Кестедегі үлкен және кіші жолдар"
      },
      {
        "id": "52bbdc8f-3a80-4612-8f63-7722b7653361",
        "text": "Кестенің толығымен жойылу мүмкіндігі"
      },
      {
        "id": "87d42618-1f30-4adb-9fae-cd66b538ab2a",
        "text": "Оның бизнес мағынасы жоқ, сондықтан пайдаланушы үшін қосымша бірегейлік тексерулерін (мысалы, ЖСН-ге UNIQUE қою) талап етеді"
      },
      {
        "id": "fa14976a-ebba-4cf5-8d2c-7a3b17619ff2",
        "text": "Қолданбаның бизнес логикасын жазу"
      },
      {
        "id": "e880585c-f8c6-4a26-a488-a36b1ebc20ac",
        "text": "Кесте бағандарын (мысалы, сирек қолданылатын немесе үлкен бағандарды) бөлек кестелерге бөлу"
      }
    ],
    "correctOptionIds": [
      "a868fb3f-0548-4f06-a695-a510d280c556"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "df035d5a-5f20-49e7-89b0-0467a437f394",
    "subjectId": "db",
    "text": "Супертип пен субтип арасындағы байланыс реляциялық модельде қалай сипатталады?",
    "options": [
      {
        "id": "1526bea8-e2b3-490b-b1df-86be18f3aaa1",
        "text": "Субтип кестесіндегі бастапқы кілт сонымен қатар супертип кестесіне сілтеме жасайтын сыртқы кілт (FK) болады"
      },
      {
        "id": "df72567d-c105-4752-ac9f-f6f9e3ff713e",
        "text": "Олардың арасында ешқандай кілт арқылы байланыс орнатылмайды"
      },
      {
        "id": "82afa63c-b222-470d-93f2-f57693f4f27b",
        "text": "Супертип субтиптің ішкі бағаны болып сақталады"
      },
      {
        "id": "7c779d18-2472-4dd5-9a35-954b163e3859",
        "text": "Олар тек қана бір кесте ішінде сақталады"
      },
      {
        "id": "a232d8bf-c65a-41d4-afe0-df5401aae357",
        "text": "Пайдаланушыға негізгі кестенің тек рұқсат етілген бағандары мен жолдарын көрсетіп, құпия деректерді жасыру"
      },
      {
        "id": "4152cf62-5363-42ad-b095-d9e8c39feea2",
        "text": "Деректерді дискіге жазу жылдамдығын баптау"
      },
      {
        "id": "b3ee7c11-4e6e-4495-b1ff-fd175b5e38e6",
        "text": "Кестенің толығымен жойылу мүмкіндігі"
      },
      {
        "id": "37baca2c-09bb-48d6-a4fc-a1c6d979764a",
        "text": "Екі кестенің бағандары бірдей болуы тиіс"
      }
    ],
    "correctOptionIds": [
      "1526bea8-e2b3-490b-b1df-86be18f3aaa1"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "bc1f0e6a-95cb-434c-8f3d-073c5c104d95",
    "subjectId": "db",
    "text": "Жобалаудағы 1:1 байланысы реляциялық модельде қалай бейнеленеді?",
    "options": [
      {
        "id": "b3970233-218f-4781-a253-1fc2a400395c",
        "text": "Бір кестенің бастапқы кілті екінші кестеде сыртқы кілт (FK) әрі бірегей (UNIQUE) болып табылады"
      },
      {
        "id": "b078272b-7798-48e7-907f-2186ea41479d",
        "text": "Екі кестеде де сыртқы кілт болмайды"
      },
      {
        "id": "d6bcd7ac-2b3e-4579-9833-fac2fc701dd6",
        "text": "Екі кестенің бағандары бірдей болуы тиіс"
      },
      {
        "id": "5a52cf42-3691-48cd-86e2-6909e4fd0216",
        "text": "Аралық байланыстырушы кесте арқылы жүзеге асады"
      },
      {
        "id": "5a7db4ab-cb79-4699-83b5-c1ac1e1aab19",
        "text": "Кестелер арасындағы байланысты оңтайландыру"
      },
      {
        "id": "49d0f5b9-3f53-43cf-9dd5-04a7fb128896",
        "text": "Ол нақты ДҚБЖ бағдарламасына (Oracle, PostgreSQL, т.б.) және физикалық сақтау тәсіліне мүлдем тәуелсіз болады"
      },
      {
        "id": "23d486cc-afa7-43dd-80c1-f8cc70a43ab4",
        "text": "Бастапқы кілтті автоматты түрде тағайындау үшін"
      },
      {
        "id": "e3f1015b-ccd0-4cfb-afe3-180d372abf75",
        "text": "Индекстерді құру жоспары"
      }
    ],
    "correctOptionIds": [
      "b3970233-218f-4781-a253-1fc2a400395c"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "50297902-f2ab-46a1-9ae2-46587187b1be",
    "subjectId": "db",
    "text": "Жобалаудағы 1:M байланысы реляциялық модельде қалай бейнеленеді?",
    "options": [
      {
        "id": "323f81a1-f17b-4096-aed2-0341243dec4e",
        "text": "'1' жақтағы кестенің бастапқы кілті 'M' жақтағы кестеге сыртқы кілт (FK) болып қосылады"
      },
      {
        "id": "856d68cf-3dc9-4884-87f2-aaf736970c3f",
        "text": "'M' жақтағы кестенің бастапқы кілті '1' жаққа қосылады"
      },
      {
        "id": "00987535-ec19-471d-be64-b6f7f60a87ca",
        "text": "Аралық кесте құру арқылы ғана"
      },
      {
        "id": "2e68adc0-b862-48e1-b585-043d458df36b",
        "text": "Екі кестені біріктіру арқылы"
      },
      {
        "id": "73ebb5d4-5c19-43df-a3da-efe912b1e584",
        "text": "Тек кесте құрылған кезде (CREATE TABLE)"
      },
      {
        "id": "b247ffbe-6027-4a90-82c4-d4876e9d5cdf",
        "text": "UNIQUE және CHECK шектеулері арқылы"
      },
      {
        "id": "7825372c-e72d-41a5-a68a-c50e4c86c483",
        "text": "Логикалық схеманы өзгертпей, индекстерді өзгерту мүмкіндігі"
      },
      {
        "id": "03c926dc-a513-4afd-a559-63d7a2e92281",
        "text": "Сыртқы кілт болып табылатын атрибут"
      }
    ],
    "correctOptionIds": [
      "323f81a1-f17b-4096-aed2-0341243dec4e"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "0e0e12fa-25ed-4606-8f78-59cf53ee2183",
    "subjectId": "db",
    "text": "Нысандар мен қасиеттер арасындағы байланыстарды графикалық түрде бейнелеу үшін UML-де қандай диаграмма қолданылады?",
    "options": [
      {
        "id": "954973cf-5eff-49c4-8fbc-3a44bb5c93ef",
        "text": "Класс диаграммасы (Class Diagram)"
      },
      {
        "id": "13fda12a-d2d9-4368-a865-dc5e118747f2",
        "text": "Прецеденттер диаграммасы (Use Case Diagram)"
      },
      {
        "id": "6b2d75ac-ee54-49a8-b530-bca0d64d0b41",
        "text": "Күйлер диаграммасы (State Diagram)"
      },
      {
        "id": "882865cc-f1b6-436f-b67b-679373608009",
        "text": "Тізбектілік диаграммасы (Sequence Diagram)"
      },
      {
        "id": "cc103ebe-7fb3-4c26-b567-df88592001ad",
        "text": "Бастапқы және екіншілік кілттер жиынтығы"
      },
      {
        "id": "b8ed930a-ac06-48d2-98ea-1dbaf2594e4d",
        "text": "Triggers (триггерлер) және Stored Procedures (сақталатын процедуралар) арқылы"
      },
      {
        "id": "73a8f95b-372b-46d2-ad5c-16f930952f40",
        "text": "Кестелер санын шектеу"
      },
      {
        "id": "ece35c18-b2c4-4d84-a321-2e6dafda1863",
        "text": "Кестелерді 3NF-тен 1NF-ке түсіру"
      }
    ],
    "correctOptionIds": [
      "954973cf-5eff-49c4-8fbc-3a44bb5c93ef"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "686b795c-823c-4490-a919-89400e3b99ce",
    "subjectId": "db",
    "text": "Нысанның кандидаттық кілті (Candidate Key) деген не?",
    "options": [
      {
        "id": "1a01b489-6d26-40e2-ae14-0d065e679262",
        "text": "Жазбаны бірегей сәйкестендіре алатын және бастапқы кілт болуға үміткер кез келген атрибут немесе атрибуттар жиынтығы"
      },
      {
        "id": "66f35da6-5780-4e2e-9882-b63dc9842cc3",
        "text": "Кестедегі кез келген сыртқы кілт"
      },
      {
        "id": "8f56b563-951b-4e2e-b2f2-17eb30d18460",
        "text": "Тек қана сандық типті баған"
      },
      {
        "id": "504d7ef4-ed3a-4118-887f-d20428c75ade",
        "text": "Кесте құрылғаннан кейін қосылатын қосымша кілт"
      },
      {
        "id": "62c5f182-b58a-474b-8664-da6f6b51369a",
        "text": "Индекстер көмегімен"
      },
      {
        "id": "5f304fd7-2e30-4b42-a64f-a6cd0ec302f0",
        "text": "Тек сыртқы кілттер арқылы байланыстар"
      },
      {
        "id": "4c7c1f65-7c16-46d7-96cc-150064f43833",
        "text": "Қолданбаның Java немесе Python коды арқылы"
      },
      {
        "id": "0eed2e7a-8d88-4c3e-8480-4269fc0770e4",
        "text": "UNIQUE және CHECK шектеулері арқылы"
      }
    ],
    "correctOptionIds": [
      "1a01b489-6d26-40e2-ae14-0d065e679262"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "6d1ad669-1259-4a7d-bc3a-d015bf70db69",
    "subjectId": "db",
    "text": "Composite Key (құрама кілт) деген не?",
    "options": [
      {
        "id": "1216a318-7c40-4e6f-9a35-1f3814314820",
        "text": "Бірнеше бағанның бірігуінен құралған бастапқы кілт"
      },
      {
        "id": "2b34a94c-9a86-41fa-aaca-695b04b36da9",
        "text": "Басқа кестедегі бастапқы кілтке сілтеме жасайтын кілт"
      },
      {
        "id": "c83b37cd-e926-4d0b-aebe-f013772b68c0",
        "text": "Бизнес ережелерін тексеретін кілт"
      },
      {
        "id": "a2eaab17-782a-4fe4-b118-4d3977ec7c0f",
        "text": "Автоматты түрде өсетін сандық кілт"
      },
      {
        "id": "2e61e44b-da28-4ccd-a888-436dc8be5cfa",
        "text": "Кестедегі нақты бір жол"
      },
      {
        "id": "43eba3a8-cba2-4a15-8aab-15f04313a756",
        "text": "Дерекқордан тәуелсіз ER-модель (диаграмма)"
      },
      {
        "id": "c65efe28-0f01-45ba-b7a5-b1726dd3faa8",
        "text": "Тізбектілік диаграммасы (Sequence Diagram)"
      },
      {
        "id": "e652ab45-55c9-4a83-9472-52185fa34e0c",
        "text": "Жазбаны бірегей сәйкестендіре алатын және бастапқы кілт болуға үміткер кез келген атрибут немесе атрибуттар жиынтығы"
      }
    ],
    "correctOptionIds": [
      "1216a318-7c40-4e6f-9a35-1f3814314820"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "f7ff6d14-d195-422a-b525-11b8956581ae",
    "subjectId": "db",
    "text": "Реляциялық кестеде құрама кілтті қолданудың қолайсыздығы қандай?",
    "options": [
      {
        "id": "eadb9b71-a7fe-4860-a6bb-4c8ef371b567",
        "text": "Оған сілтеме жасайтын сыртқы кілттер де құрама болуы тиіс, бұл сұраныстар мен индекстерді күрделендіреді"
      },
      {
        "id": "c2686c63-c7d4-4440-b6e6-bea4536e06b2",
        "text": "Ол дерекқордың қауіпсіздігін бұзады"
      },
      {
        "id": "002a01ad-ec39-4f81-80ed-29c7e6d85862",
        "text": "Ол кестедегі жолдар санын шектейді"
      },
      {
        "id": "8d33040d-5c48-4dfa-9cf1-8e6ff5874ec1",
        "text": "Оны тек бір ғана ДҚБЖ қолдайды"
      },
      {
        "id": "b442e350-7de2-4a34-b219-82b8d5b62cf2",
        "text": "SQL сұраныстарының қате жазылуынан"
      },
      {
        "id": "a9f0bd7b-fde6-49bb-954b-be8a770083f3",
        "text": "Кесте құрылымындағы индекстердің міндеттілігін"
      },
      {
        "id": "69e76c55-188a-4037-a085-5bba17dc972b",
        "text": "Бизнес логикасын бағдарламалау"
      },
      {
        "id": "f86524fe-1fe4-47d3-8f8b-164be8f68cdc",
        "text": "Бизнес ережелерін тексеретін кілт"
      }
    ],
    "correctOptionIds": [
      "eadb9b71-a7fe-4860-a6bb-4c8ef371b567"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "442cb1db-722f-4217-a4aa-80c0dfef5e22",
    "subjectId": "db",
    "text": "Табиғи кілт (Natural Key) ретінде адамның аты-жөнін таңдау неліктен нашар шешім болып табылады?",
    "options": [
      {
        "id": "115c28e7-7129-4e53-8343-9b6a921c8af3",
        "text": "Аты-жөні бірегей емес (аттастар болуы мүмкін) және уақыт өте келе өзгеруі мүмкін"
      },
      {
        "id": "500dab89-521b-4e21-9eb9-8dfbfbd487b2",
        "text": "Ол өте ұзақ сақталады"
      },
      {
        "id": "740388b6-aa82-4cbb-baf7-306fdb72cf2e",
        "text": "Оның деректер типі сандық емес"
      },
      {
        "id": "e91bb1a5-7dc4-48cc-b9bd-effc79ef055f",
        "text": "Ол сыртқы кілтпен байланыса алмайды"
      },
      {
        "id": "2458fa01-26de-442f-93a6-615c2c7a0ad6",
        "text": "SQL сұраныстар деңгейінде"
      },
      {
        "id": "9f26274b-aed8-4e98-a2d2-361284790889",
        "text": "Деректерді жаңарту кезіндегі аномалияларды болдырмау және жадыны үнемдеу"
      },
      {
        "id": "0d0b816f-3382-4cec-b9c3-fdd5f129427b",
        "text": "Деректері жоқ бос кесте"
      },
      {
        "id": "e9ad0619-ca09-44e1-8e0d-c64957c56159",
        "text": "Концептуалды модель физикалық файлдар құрылымын сипаттайды"
      }
    ],
    "correctOptionIds": [
      "115c28e7-7129-4e53-8343-9b6a921c8af3"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "8484976f-5724-495a-8e05-6754dfbf82cb",
    "subjectId": "db",
    "text": "Жобалаудағы байланыстың кардиналдығы (Cardinality) нені білдіреді?",
    "options": [
      {
        "id": "361c0bae-ab46-4252-95f4-0a9b42fa925c",
        "text": "Бір нысанның қанша данасы екінші нысанның даналарымен байланыса алатынын көрсететін қатынас (мысалы, 1:1, 1:M, M:N)"
      },
      {
        "id": "f50eb4e8-9184-4a4c-8960-c6aa34624b6c",
        "text": "Кестедегі жалпы бағандар санын"
      },
      {
        "id": "aa801808-d1a4-4620-912a-7673eea0daa0",
        "text": "Дерекқордың физикалық өлшемін"
      },
      {
        "id": "38109313-a0c3-497d-8212-d441c1e6f15a",
        "text": "Транзакциялардың бір секундтағы санын"
      },
      {
        "id": "8142545f-8b84-4793-b2f8-04cf12e22002",
        "text": "Рекурсивті байланыс"
      },
      {
        "id": "425dca8f-966c-4d68-aad9-66f5c73abf82",
        "text": "Деректерді желідегі әртүрлі түйіндерде орналастыру үшін бөліктерге бөлу процесі"
      },
      {
        "id": "c339b333-db0f-4b02-bb27-fe1484b2ebd9",
        "text": "Кестелер арасындағы байланысты оңтайландыру"
      },
      {
        "id": "feacc08e-0ff8-4023-9ff8-133c3ecafad2",
        "text": "Пәндік саланың дербес өмір сүретін және ақпарат сақталатын объектісі немесе түсінігі"
      }
    ],
    "correctOptionIds": [
      "361c0bae-ab46-4252-95f4-0a9b42fa925c"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "a40e7a79-311f-4903-b299-820aef0e0f62",
    "subjectId": "db",
    "text": "Байланыстың міндеттілігі (Optionality / Participation) нені көрсетеді?",
    "options": [
      {
        "id": "391af943-9d51-4c2f-ae45-7ec240fa1c3a",
        "text": "Нысан данасының байланыста міндетті түрде қатысуы керек пе (минималды кардиналдық 1) әлде қатыспауына болады ма (минималды кардиналдық 0)"
      },
      {
        "id": "c8923502-edfa-4e98-9842-e45d63c1842e",
        "text": "Сыртқы кілттің міндетті түрде бірегей болуын"
      },
      {
        "id": "c64f4d38-4afe-4685-b02a-b2059d259b6f",
        "text": "Кесте құрылымындағы индекстердің міндеттілігін"
      },
      {
        "id": "9ae96585-ea40-4223-8efc-d62e1207f5a9",
        "text": "Дерекқордың желіге қосылу міндеттілігін"
      },
      {
        "id": "ce8ee1d1-758a-4ac3-bfba-567546717b90",
        "text": "Физикалық жобалауда"
      },
      {
        "id": "b8975414-cf8d-4c63-b1d2-bfb01cefa51f",
        "text": "Бастапқы кілтті суррогаттық кілтпен алмастыру"
      },
      {
        "id": "cd60ba48-1c6e-48a1-834b-d65dd3e61d4e",
        "text": "Индекстелмеген кез келген кесте"
      },
      {
        "id": "dd97a132-d8b9-4ad4-8595-82466de8e092",
        "text": "Ол тек мәтіндік деректерді сақтай алады"
      }
    ],
    "correctOptionIds": [
      "391af943-9d51-4c2f-ae45-7ec240fa1c3a"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "f83765ee-42ba-4909-9c12-01cf297186b4",
    "subjectId": "db",
    "text": "ER-диаграммада байланыс сызығының ұштарындағы тармақталған белгілер (мысалы, 'қарға табаны' — Crow's Foot нотациясы) нені білдіреді?",
    "options": [
      {
        "id": "0945a2a7-2d5b-4337-8433-d97e4e6ae046",
        "text": "Байланыстың кардиналдық дәрежесін"
      },
      {
        "id": "4d0991ce-1ae9-4aba-acfa-b6fb782c1238",
        "text": "Бастапқы кілттердің санын"
      },
      {
        "id": "77b57b68-236a-4680-a35c-5a14bff3e4f8",
        "text": "Бағандардың деректер типтерін"
      },
      {
        "id": "ee6a662a-0351-401b-a1ea-a8ba3f778ef2",
        "text": "Кестелердің нормализациялану деңгейін"
      },
      {
        "id": "330b7c52-43a6-4094-8965-8cb8a5ad7fb4",
        "text": "Оның бизнес мағынасы жоқ, сондықтан пайдаланушы үшін қосымша бірегейлік тексерулерін (мысалы, ЖСН-ге UNIQUE қою) талап етеді"
      },
      {
        "id": "a199a043-b57d-4901-bc99-82b4e1bc423d",
        "text": "Triggers (триггерлер) және Stored Procedures (сақталатын процедуралар) арқылы"
      },
      {
        "id": "405e5a75-ecfb-4f7a-99b1-9cc92666909d",
        "text": "Бизнес ережелерін тексеретін кілт"
      },
      {
        "id": "b5780c41-4cc1-4059-b823-5b7f9b1489ee",
        "text": "Деректерді репликациялау үшін"
      }
    ],
    "correctOptionIds": [
      "0945a2a7-2d5b-4337-8433-d97e4e6ae046"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "e1aabd88-d4e6-4c3f-932d-86c8730f88e3",
    "subjectId": "db",
    "text": "Crow's Foot нотациясында 'қарға табаны' белгісі нені білдіреді?",
    "options": [
      {
        "id": "923a8594-1429-426b-9107-dd97db56cc34",
        "text": "Көп (Many / M) қатынасын"
      },
      {
        "id": "fd157828-4788-4263-9348-9455cc206dd6",
        "text": "Бір (One / 1) қатынасын"
      },
      {
        "id": "96b0d57f-b42a-4e52-91f1-4f7c4656d3d3",
        "text": "Нөл (Zero / 0) қатынасын"
      },
      {
        "id": "3ade89b3-cb80-4e3e-984e-5f270e7b4ebc",
        "text": "Байланыстың жоқтығын"
      },
      {
        "id": "088f3e4d-fcbe-40ee-8938-fc0f0f702a93",
        "text": "Атрибуттары өте аз кесте"
      },
      {
        "id": "5771790f-6d91-4195-a806-909692347d53",
        "text": "Бір (One / 1) қатынасын немесе міндетті қатысуды"
      },
      {
        "id": "403a174c-9f9a-41fa-afbd-6ae449bdc273",
        "text": "Жаңадан қосылған баған"
      },
      {
        "id": "21b26ce5-3679-4715-9647-807d401eec79",
        "text": "Индекстерді қолдануға тыйым салады"
      }
    ],
    "correctOptionIds": [
      "923a8594-1429-426b-9107-dd97db56cc34"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "0dcfb75f-beca-453d-bfcf-37f86f3f4032",
    "subjectId": "db",
    "text": "Crow's Foot нотациясында сызықтағы шеңбер (O) белгісі нені білдіреді?",
    "options": [
      {
        "id": "4e832085-5bee-422d-8a46-0ac6b49c2bc3",
        "text": "Міндетті емес (Optional / 0) қатысуды"
      },
      {
        "id": "64c877a5-4070-4c39-991d-fe6691e871dc",
        "text": "Міндетті (Mandatory) қатысуды"
      },
      {
        "id": "a0cd566b-7725-495a-9604-ef87c7f06b57",
        "text": "Көп (Many) қатысуды"
      },
      {
        "id": "100526c5-4564-4474-a67d-5e8f20f34fd7",
        "text": "Бастапқы кілтті"
      },
      {
        "id": "58a6a772-92ac-4d3f-a134-ec74df7f0584",
        "text": "Кестелер арасындағы байланысты оңтайландыру"
      },
      {
        "id": "2f1569c1-b912-4882-802a-e86a0e8dc8df",
        "text": "Кесте жолдарын белгілі бір шарт бойынша (мысалы, датасы немесе ID-і бойынша) бөлек файлдарға бөлу"
      },
      {
        "id": "8b57670f-b488-494b-9738-186ca8743de9",
        "text": "Сыртқы кілттерді анықтау"
      },
      {
        "id": "5572cec8-e5e2-462b-946c-3e06bb847af1",
        "text": "Олардың арасында ешқандай кілт арқылы байланыс орнатылмайды"
      }
    ],
    "correctOptionIds": [
      "4e832085-5bee-422d-8a46-0ac6b49c2bc3"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "77618e4a-3008-4a40-9bb6-d25e32d8ba37",
    "subjectId": "db",
    "text": "Crow's Foot нотациясында сызықтағы тік сызықша (|) белгісі нені білдіреді?",
    "options": [
      {
        "id": "0112f13f-49f1-4b3d-a65b-524eac96e46d",
        "text": "Бір (One / 1) қатынасын немесе міндетті қатысуды"
      },
      {
        "id": "f6ef4595-f3bb-48fc-a36b-a7bb1078959c",
        "text": "Көп (Many) қатынасын"
      },
      {
        "id": "f46946f5-c1a6-45fc-b22f-458e0770778c",
        "text": "Бос мәнді (NULL)"
      },
      {
        "id": "0029debf-770d-4c6a-ad64-6e433b20ce4e",
        "text": "Индекстің барын"
      },
      {
        "id": "1a44626d-062f-4db6-a2bd-d14563dc1bdf",
        "text": "Бьерн Страуструп"
      },
      {
        "id": "97df3aa6-89d1-4d09-b3f4-2cc8003b4834",
        "text": "Деректердің артықшылығы артады және жаңарту кезінде деректердің сәйкессіздігі (inconsistency) туындау қаупі жоғарылайды"
      },
      {
        "id": "9c8e83e0-abb1-4989-a2e3-5c4699d1036a",
        "text": "Тұтастық шектеулерін жою үшін"
      },
      {
        "id": "f80e081b-96ce-4bfd-8810-c7e7aee61f40",
        "text": "Физикалық -> Логикалық -> Концептуалды"
      }
    ],
    "correctOptionIds": [
      "0112f13f-49f1-4b3d-a65b-524eac96e46d"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "a2b575ee-0cfb-4178-ae78-913a255f0f75",
    "subjectId": "db",
    "text": "Деректер қорын логикалық жобалауда 'nullability' деген не?",
    "options": [
      {
        "id": "cf7f96ce-6333-4ae2-a098-9e1b0bc8cfc6",
        "text": "Баған мәнінің бос (NULL) болуына рұқсат беру немесе бермеу (NOT NULL) қасиеті"
      },
      {
        "id": "640ecf5b-f8c7-4c07-9774-778f84e03eff",
        "text": "Транзакциялардың сәтсіз аяқталу мүмкіндігі"
      },
      {
        "id": "81fef6bf-eb87-4160-8f7b-16e80ada798a",
        "text": "Кестенің толығымен жойылу мүмкіндігі"
      },
      {
        "id": "b65389bc-12d7-4805-baaa-de0100bc5a62",
        "text": "Деректердің қауіпсіздік деңгейі"
      },
      {
        "id": "4e0c6df1-f061-49ad-9be5-831f3588aedc",
        "text": "Оны тек бір ғана ДҚБЖ қолдайды"
      },
      {
        "id": "a479a18a-9e53-4cb8-9626-36da415316d4",
        "text": "Бизнес мағынасы жоқ, жүйе тарапынан тек жазбаны бірегей сәйкестендіру үшін автоматты түрде генерацияланатын сандық кілт (мысалы, автоинкрементті ID)"
      },
      {
        "id": "9f422627-d7eb-4836-96d1-08e8ae902a46",
        "text": "Жаңа сыртқы кілттерді көбейту"
      },
      {
        "id": "07f23f6e-aeb7-4512-95bd-99ff0d6322af",
        "text": "Сұраныстардың орындалу жылдамдығын төмендетеді және дерекқор логикасын күрделендіреді"
      }
    ],
    "correctOptionIds": [
      "cf7f96ce-6333-4ae2-a098-9e1b0bc8cfc6"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "4081dcae-ba8d-48fa-a05f-2e0b8f945539",
    "subjectId": "db",
    "text": "SQL-де CHECK шектеуі кесте деңгейінде қашан тексеріледі?",
    "options": [
      {
        "id": "68a992e2-dbc9-45ab-b2f4-03797294c355",
        "text": "Жаңа жол қосылғанда (INSERT) немесе баған мәні өзгертілгенде (UPDATE)"
      },
      {
        "id": "c937d61e-23fc-4b0d-842c-a55e6f5bf234",
        "text": "Тек кесте құрылған кезде (CREATE TABLE)"
      },
      {
        "id": "de88cb09-42fa-4d26-9e2c-c81c7c62f09d",
        "text": "Тек сұраныс орындалғанда (SELECT)"
      },
      {
        "id": "20acfab6-c299-445d-88ed-07ffb029a138",
        "text": "Тек дерекқор іске қосылған кезде"
      },
      {
        "id": "1772d7d1-3b35-4d1e-b87d-94ff79c20ad1",
        "text": "Кестедегі нақты бір жол"
      },
      {
        "id": "89257a50-7a62-45cc-8961-c5326dc60c4d",
        "text": "Кесте бағандарын өшіру арқылы"
      },
      {
        "id": "45460686-8849-45af-b2fc-f757293c3ded",
        "text": "Ол сыртқы кілттермен байланысты талап етпейді"
      },
      {
        "id": "0902bf62-7724-4004-8637-c0e3ab3111a1",
        "text": "Асты сызылған мәтінмен (Underline)"
      }
    ],
    "correctOptionIds": [
      "68a992e2-dbc9-45ab-b2f4-03797294c355"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "965e58c1-4029-4625-b3f1-b448b3d22f9b",
    "subjectId": "db",
    "text": "Жобалау кезеңінде деректердің қауіпсіздігі үшін шифрлау (Encryption) қай жерде жоспарланады?",
    "options": [
      {
        "id": "f8a33697-2f4f-47ac-bb4a-5d99a2bae10a",
        "text": "Физикалық жобалау кезеңінде"
      },
      {
        "id": "8ae329c5-4cf8-4cc6-81b3-04122dd73ffb",
        "text": "Концептуалды жобалау кезеңінде"
      },
      {
        "id": "2d330fb9-7155-447d-8156-5d5a1f7b8660",
        "text": "Логикалық жобалау кезеңінде"
      },
      {
        "id": "112d3f4f-39b4-4eb7-82a2-e2ff262bf327",
        "text": "Талаптарды жинау кезеңінде"
      },
      {
        "id": "443b92ac-273e-4b12-8292-d9de7dc38a31",
        "text": "Болашақ дерекқорға қойылатын барлық функционалдық және ақпараттық талаптарды анықтау және жүйелеу"
      },
      {
        "id": "8379001a-6c05-48d1-8cb4-76a9d610cccd",
        "text": "Деректердің қауіпсіздік деңгейі"
      },
      {
        "id": "e8979497-5281-45ef-b6bd-16e03d451c0a",
        "text": "Индекстер (кластерленген және кластерленбеген)"
      },
      {
        "id": "8e6537ff-f4bd-4424-a281-3bed36bc6fcc",
        "text": "Кестелер саны тым азайып кетеді"
      }
    ],
    "correctOptionIds": [
      "f8a33697-2f4f-47ac-bb4a-5d99a2bae10a"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  },
  {
    "id": "09c9c68d-61c0-4bf9-8fc8-0e95e0b8967d",
    "subjectId": "db",
    "text": "Деректер қорын жобалауда 'Metadata' (Метадеректер) термині нені білдіреді?",
    "options": [
      {
        "id": "8c43251b-4a02-4df3-bbb1-cfe77c3f1211",
        "text": "Деректер туралы деректерді (кестелер құрылымы, типтері, шектеулері)"
      },
      {
        "id": "86b50193-1574-4320-b1f1-dff1da77f893",
        "text": "Архивтелген деректерді"
      },
      {
        "id": "9a6594a6-f276-4930-824d-a5b0f6c604d9",
        "text": "Пайдаланушылардың жеке деректерін"
      },
      {
        "id": "6d9faac2-2f57-42ba-bfab-bfb5f8b82fdc",
        "text": "SQL сұраныстарының тарихын"
      },
      {
        "id": "650c68ac-4083-45c0-b337-ae01970982d2",
        "text": "Индекстерді қолдануға тыйым салады"
      },
      {
        "id": "70a2539b-9041-44a3-8d55-7164657b290d",
        "text": "Индекстер (кластерленген және кластерленбеген)"
      },
      {
        "id": "decad1d5-beca-426c-9bd7-0ddcee69b2d4",
        "text": "Бастапқы кілттерді өшіру"
      },
      {
        "id": "0a4fb036-7b5a-4c32-94ff-889742454527",
        "text": "REVOKE UPDATE ON table_name FROM user_name"
      }
    ],
    "correctOptionIds": [
      "8c43251b-4a02-4df3-bbb1-cfe77c3f1211"
    ],
    "type": "MULTIPLE",
    "topic": "Деректер қорын жобалау",
    "difficulty": "medium"
  }
] as Question[];
